Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: Aimless
th_th: ไม่มีเป้าหมาย

source: Restraining
th_th: ถูกจองจำ

source: {1} has arrived at {2}
th_th: {1} ได้มาถึงที่ {2}

source: Failed!
th_th: ล้มเหลว!

source: (No XP)
th_th: (ไม่มี XP)

source: *Thunk*
th_th: *ตุบ*

source: {1} is butchering {2} for meat!!
th_th: {1} กำลังแล่เนื้อ {2}!!

source: I can't pick that up
th_th: ข้าหยิบมันไม่ได้

source: Training
th_th: กำลังฝึกฝน

source: {1} has been released from prison.
th_th: {1} ได้รับการปล่อยตัวแล้ว.

source: This isn't mine
th_th: นี่ไม่ใช่ของข้า

source: Paid c.{1} for bed rental.
th_th: จ่าย c.{1} เพื่อเช่าเตียง.

source: Can't afford c.{1} for bed rental.
th_th: มีเงินไม่พอ c.{1} สำหรับค่าเช่าเตียง.

source: This bed needs power to operate.
th_th: เตียงนี้ต้องใช้ไฟฟ้าในการทำงาน.

source: Received c.{1} reward.
th_th: ได้รับรางวัล c.{1}

source: I have to dismantle the furniture first.
th_th: ต้องแยกชิ้นส่วนเฟอร์นิเจอร์ก่อน.

source: I have to unmount the buildings first.
th_th: ต้องยกเฟอร์นิเจอร์ออกก่อน.

source: Prospecting
th_th: กำลังสำรวจ

source: Adding materials
th_th: กำลังเพิ่มวัสดุ

source: Locking
th_th: ล็อค

source: Unlocking
th_th: ปลดล็อค

source: Lockpicking
th_th: สะเดาะกุญแจ

source: Pick failed
th_th: สะเดาะล้มเหลว

source: Pick success!
th_th: สะเดาะสำเร็จ!

source: Lockpicking (Chance {1}%)
th_th: สะเดาะกุญแจ(มีโอกาส {1}%)

source: Cutting
th_th: กำลังตัด

source: Shackles broken!
th_th: โซ่ตรวนถูกทำลาย!

source: Cutting: {1,num}
th_th: ตัด: {1,num}

source: *Crunck*
th_th: *แคร๊ง!*

source: I'm not strong enough to do that
th_th: ข้าไม่แข็งแรงพอ

source: Moving
th_th: เคลื่อนที่

source: Move order
th_th: คำสั่งเคลื่อนที่

source: Running
th_th: กำลังวิ่ง

source: Moving to door
th_th: กำลังไปที่ประตู

source: Moving to door inside
th_th: ไปประตูด้านใน

source: Moving to current door
th_th: ไปที่ประตูเดิม

source: Moving to door outside
th_th: ไปที่ประตูด้านนอก

source: Gate guard
th_th: ปกป้องประตู

source: Moving to gate
th_th: เดินไปที่ประตู

source: Open gate
th_th: เปิดประตู

source: Bashing gate
th_th: พังประตู

source: Smashing
th_th: ทลาย

source: Assaulting town
th_th: บุกโจมตีเมือง

source: Worker
th_th: คนงาน

source: Operating machine
th_th: ใช้งานเครื่องจักร

source: Operating automatic machine
th_th: ใช้งานเครื่องจักรระบบอัตโนมัติ

source: Hauling to
th_th: ขนไปยัง

source: Ditching to make space
th_th: ทิ้งเพื่อเพิ่มพื้นที่

source: Ditching resources
th_th: ทิ้งทรัพยากร

source: Ditching loot
th_th: ทิ้งไอเท็ม

source: Collecting resource
th_th: กำลังรวบรวมทรัพยากร

source: Looting
th_th: เก็บของ

source: Finding building mats
th_th: ค้นหาวัสดุก่อสร้าง

source: Filling machine
th_th: เติมวัสดุใส่เครื่องจักร

source: Try filling machine
th_th: พยายามเติมวัสดุใส่เครื่องจักร

source: Try emptying machine
th_th: พยายามทำให้เครื่องจักรว่างเปล่า

source: Unjamming machine
th_th: กำลังซ่อมแซมเครื่องจักรที่ขัดข้อง

source: Unjam all machines
th_th: ซ่อมแซมเครื่องจักรที่ขัดข้องทั้งหมด

source: Keeping everything running
th_th: ทำให้ทุกอย่างทำงานได้อย่างเต็มที่

source: Delivering
th_th: กำลังไปส่ง

source: Open current door
th_th: เปิดประตูบานนี้

source: Opening door here
th_th: กำลังเปิดประตูบานนี้

source: Closing door here
th_th: ปิดประตูบานนี้

source: Open destination door
th_th: เปิดประตูเป้าหมาย

source: Opening door
th_th: เปิดประตู

source: Closing door
th_th: ปิดประตู

source: Locking door
th_th: ล็อคประตู

source: Unlocking door
th_th: ปลดล็อคประตู

source: Locking door here
th_th: กำลังล็อคประตู

source: Locking door from inside
th_th: ล็อคประตูจากด้านใน

source: Locking door from outside
th_th: ล็อคประตูจากด้านนอก

source: Unlocking door here
th_th: กำลังปลดล็อคประตู

source: Bashing door
th_th: กำลังพังประตู

source: Locking up cages
th_th: ล็อคกรงขัง

source: Locking up
th_th: กำลังขัง

source: Locking up from outside
th_th: กำลังขังจากด้านนอก

source: Opening up
th_th: กำลังเปิด

source: Entering building
th_th: เข้าไปยังอาคาร

source: Ransacking town
th_th: เข้าปล้นสะดมเมือง

source: Leaving building
th_th: ออกจากอาคาร

source: Lockpicking Shackles
th_th: สะเดาะโซ่ตรวน

source: Removing Shackles
th_th: ถอดโซ่ตรวน

source: Escaping
th_th: กำลังหนี

source: Cutting shackles
th_th: กำลังตัดโซ่ตรวน

source: Cutting lock
th_th: กำลังตัดตัวล็อค

source: Breaking shackles
th_th: กำลังทำลายโซ่ตรวน

source: Breaking lock
th_th: กำลังทำลายตัวล็อค

source: Get out of cage
th_th: ออกจากกรง

source: Escape cage
th_th: หนีออกจากกรง

source: Repairing
th_th: ซ่อมแซม

source: Engineer
th_th: วิศวกร

source: Lifting/Snatching
th_th: หยิบไป/หยิบฉวย

source: Capture Target
th_th: จับกุมเป้าหมาย

source: Lifting/Snatching Order
th_th: คำสั่งปล้น/โจรกรรม

source: Kidnapping
th_th: ลักพาตัว

source: Lifting
th_th: กำลังยก

source: Lifting and healing
th_th: กำลังยกและรักษา

source: Putting down
th_th: วางลง

source: Building
th_th: สิ่งก่อสร้าง

source: Demolishing
th_th: ทำลาย

source: Collecting item
th_th: เก็บไอเท็ม

source: Idleness
th_th: อยู่เฉยๆ

source: Standing
th_th: ยืน

source: Getting up
th_th: ลุกขึ้น

source: Waking up
th_th: ตื่น

source: Stumbling
th_th: กะเผลก

source: Equipping weapon
th_th: สวมใส่อาวุธ

source: Equipping crossbow
th_th: สวมใส่หน้าไม้

source: Sheathing weapon
th_th: เก็บอาวุธ

source: Fixing Legs
th_th: ซ่อมแซมชิ้นส่วนขา

source: First aid
th_th: ปฐมพยาบาล

source: Splinting
th_th: เข้าเฝือก

source: Medic
th_th: รักษา

source: Splint Rigging
th_th: อุปกรณ์เข้าเฝือก

source: Robotics
th_th: จักรกล

source: Standing still
th_th: ยืนนิ่งๆ

source: Stand still dammit!
th_th: ยืนนิ่งๆ สิวะ!

source: Worshiping
th_th: กำลังบูชา

source: Looting food
th_th: กำลังขโมยอาหาร

source: Picking up food
th_th: หยิบอาหารขึ้นมา

source: Fetch
th_th: ไปเก็บมา

source: Playing 'Limbs'
th_th: เล่นกับอวัยวะ 'แขน,ขา'

source: Limb Jealousy
th_th: อยากได้ซากศพบ้าง

source: Getting food
th_th: หาอาหาร

source: Grabbing food
th_th: หยิบอาหาร

source: Finding weapon
th_th: หาอาวุธ

source: Looting the dead
th_th: ค้นหาของจากศพ

source: Confiscating goods
th_th: ริบสินค้า

source: Foraging animals
th_th: ล่าสัตว์

source: Looting resources
th_th: รวบรวมทรัพยากร

source: Running away
th_th: หนีไป

source: Retreating
th_th: ล่าถอย

source: Retreating fast
th_th: ล่าถอยอย่างรวดเร็ว

source: Going home
th_th: กลับบ้าน

source: Get ready
th_th: เตรียมพร้อม

source: Attacking
th_th: โจมตี

source: Shooting
th_th: ยิง

source: Taking out
th_th: ทำให้สลบ

source: Attacking attackers of
th_th: โจมตีผู้คู่ต่อสู้ของ

source: Attacking trouble makers
th_th: โจมตีตัวก่อกวน

source: Turret guard
th_th: ป้อมปราการ

source: Turret home guard
th_th: บ้านป้อมปราการ

source: Turret gunner
th_th: พลปืนประจำป้อม

source: Assault
th_th: จู่โจม

source: Attacking Squad
th_th: กองจู่โจม

source: Stalking
th_th: สะกดรอยตาม

source: Diplomatting
th_th: กำลังเจรจา

source: Approaching fast
th_th: เข้ามา

source: Talking
th_th: กำลังคุย

source: Making announcement
th_th: กำลังประกาศ

source: Following and talking
th_th: ตามไปคุย

source: Working the slaves
th_th: ใช้งานทาส

source: Selling slaves
th_th: ขายทาส

source: Delivering slaves
th_th: ส่งตัวทาส

source: Shooing
th_th: ไล่

source: Protection
th_th: ปกป้อง

source: Attacking enemies
th_th: กำลังสู้กับ

source: Fighting for master
th_th: สู้เพื่อเจ้านาย

source: Attacking others
th_th: โจมตีสิ่งอื่น

source: Home territory aggression
th_th: จัดการผู้รุกล้ำอาณาเขต

source: Self preservation
th_th: ปกป้องตัวเอง

source: Bodyguard
th_th: คุ้มกัน

source: Following
th_th: ติดตาม

source: Following leader
th_th: ติดตามหัวหน้า

source: Following master
th_th: ติดตามเจ้านาย

source: Staying close
th_th: รักษาระยะ

source: Stripping weapons
th_th: ริบอาวุธ

source: Processing slave
th_th: ดำเนินการควบคุมทาส

source: Watching slaves
th_th: คุมทาส

source: Watching for new slaves
th_th: มองหาทาสใหม่

source: Capturing slave
th_th: จับกุมทาส

source: Ordering slaves
th_th: สั่งซื้อทาส

source: Gathering slaves
th_th: สั่งรวมทาส

source: Gathering slaves for shipping
th_th: สั่งรวมทาสเพื่อขนส่ง

source: Gathering unholy slaves
th_th: รวบรวมทาสที่แปดเปื้อน

source: Obedient Slave
th_th: ทาสที่เชื่อฟัง

source: Carrying slaves
th_th: ทาสแบกของ

source: Protect allies
th_th: ปกป้องพวกพ้อง

source: Protect close allies
th_th: ปกป้องพวกพ้องใกล้เคียง

source: Holding position
th_th: ประจำตำแหน่ง

source: Stand at node
th_th: ยืนประจำที่

source: Shopkeeper
th_th: เจ้าของร้าน

source: Static guard
th_th: ยามรักษาการณ์

source: Static guard indoors
th_th: ยามรักษาการ์ในอาคาร

source: Static town guard
th_th: ยามรักษาการณ์ในเมือง

source: general node
th_th: โหนดทั่วไป

source: Getting a weapon
th_th: หยิบอาวุธ

source: Blood tracking
th_th: ตามรอยเลือด

source: Patrolling
th_th: ลาดตระเวน

source: Patrolling town
th_th: ลาดตระเวนรอบเมือง

source: Wandering town
th_th: เดินเตร็ดเตร่ในเมือง

source: Shopping
th_th: ซื้อของ

source: Relaxing
th_th: พักผ่อน

source: Staying home
th_th: อยู่บ้าน

source: Reigning
th_th: ปกครอง

source: Sitting around
th_th: นั่งรอบๆ

source: Wandering
th_th: เดินเตร็ดเตร่

source: Wandering trader
th_th: พ่อค้าพเนจร

source: Recruiting
th_th: รับสมัคร

source: Travelling
th_th: เดินทาง

source: Travelling quickly
th_th: เดินทางอย่างรวดเร็ว

source: Mission formation
th_th: รูปแบบภารกิจ

source: Attacking target
th_th: โจมตีเป้าหมาย

source: Attacking target unprovoked
th_th: โจมตีเป้าหมายที่ยังไม่ทันตั้งตัว

source: Going to bed
th_th: ไปที่เตียง

source: Sleeping
th_th: นอนหลับ

source: Sleeping on ground
th_th: นอนบนพื้น

source: Hiding
th_th: ซ่อน

source: Put in bed
th_th: วางบนเตียง

source: Getting out of bed
th_th: ตื่น

source: Getting out of bed!
th_th: บอกว่าตื่นได้แล้ว!

source: Find and rescue
th_th: ค้นหาและช่วยเหลือ

source: Find and put in bed
th_th: ค้นหาและวางบนเตียง

source: Find and rescue leader
th_th: ค้นหาและช่วยผู้นำ

source: Kill random prisoner
th_th: สุ่มฆ่าตัวประกัน

source: Kill prisoner
th_th: ฆ่าตัวประกัน

source: Eat random prisoner
th_th: ลองกินนักโทษแบบสุ่ม

source: Dinner time
th_th: ได้เวลาอาหารแล้ว

source: Eat corpse
th_th: กินศพ

source: Eat body
th_th: กินร่างกาย

source: Find crops
th_th: ค้นหาพืชผล

source: Eating crops
th_th: กินพืชผล

source: Eat prisoner
th_th: กินนักโทษ

source: Beat prisoner
th_th: ซ้อมนักโทษ

source: Disposing of corpse
th_th: ทำลายศพ

source: Find corpses
th_th: ค้นหาศพ

source: Corpse disposal
th_th: การทำลายศพ

source: Imprisoned
th_th: จองจำ

source: Put in prison
th_th: วางในคุก

source: Find and put in cage
th_th: ตามหาแล้วจับเข้ากรงขัง

source: Getting in my cage
th_th: เข้าไปในกรง

source: Freeing prisoner
th_th: ปล่อยนักโทษ

source: Liberating prisoners
th_th: ปล่อยนักโทษ

source: Release from prison
th_th: ถูกปล่อยตัวจากคุก

source: Arresting
th_th: การจับกุม

source: Bounty hunting
th_th: ล่าเงินรางวัล

source: Remove Home Intruder
th_th: กำจัดผู้บุกรุกบ้าน

source: Intruder out
th_th: ผู้บุกรุกหนีไป

source: Remove Intruder
th_th: นำผู้บุกรุกออก

source: Throwing out
th_th: ไล่ออกไป

source: Investigating
th_th: สืบสวน

source: Find and kidnap
th_th: ตามหาแล้วลักพาตัวมา

source: Kidnapper
th_th: คนลักพาตัว

source: Rendering system:
th_th: ระบบแสดงผล:

source: Resolution:
th_th: ความละเอียด:

source: Rendering device:
th_th: อุปกรณ์แสดงผล:

source: Full screen:
th_th: เต็มหน้าจอ:

source: Borderless:
th_th: ไร้ขอบ:

source: VSync:
th_th: การซิงค์แนวตั้ง:

source: Monitor:
th_th: จอภาพ:

source: If you have issues with fullscreen mode, you can use a borderless window at your native resolution for the same effect.
th_th: ถ้าเจ้ามีปัญหากับโหมด Fullscreen เจ้าสามารถใช้โหมด Borderless ตามขนาดของหน้าจอแทน เพื่อการแสดงผลแบบเดียวกัน.

source: Use a borderless window with the resolution of the monitor if you are having problems with the fullscreen mode.
th_th: ใช้ Borderless ตามขนาดของหน้าจอถ้าเจ้ามีปัญหากับโหมด Fullscreen.

source: If you have 2 video cards you may need to experiment to get the best settings, especially if your system has nVidia Optimus. With Optimus, the game should use the good graphics card regardless of what is selected here. Now things get weird. It's not our fault, it's the drivers... I actually found in tests that the game ran FASTER if I selected the rubbish on-board intel graphics card. It still used my nVidia card with both settings (because it's forced by nVidia control panel), but for some reason when setting the launcher to use my nVidia card it blocks the CPU while the GPU is rendering. If I choose the integrated card in the launcher, the CPU and GPU run in parallel, resulting in a much better frame rate. I have no idea why, the drivers are just afflicted with madness. TLDR: Force your system to use your good card, but try it out with both cards here in the launcher if you have any low frame-rate problems.
th_th: หากใช้การ์ดจอ 2 ใบขึ้นไป จำเป็นที่จะต้องทดลองปรับเพื่อการตั้งค่าที่ดีที่สุด, โดยเฉพาะอย่างยิ่งหากมี nVidia Optimus. กับ Optimus นั้น ควรใช้การ์ดจอที่มีประสิทธิภาพสูง แบบที่ไม่คำนึงถึงสิ่งที่เลือก. ชักแปลกๆแล้ว ไม่ใช่ความผิดพวกเรานะ เป็นที่ไดรฟเวอร์ต่างหาก.... ข้าพบตอนทดสอบแล้วว่า ตัวเกมนั้นทำงาน "เร็วกว่า" ถ้าข้าเลือกใช้ การ์ดจอ intel on-board กิ๊กก็อกนั่น มันก็ยังใช้ การ์ดจอ nVidia ไปด้วย. TLDR:บังคับให้ระบบใช้การ์ดจอที่ดีที่สุด แต่ควรลองทั้งสองการ์ดจอในตัวลันเชอร์เกม หากเจ้าพบปัญหาเฟรมเรทต่ำ.

source: Video settings options
th_th: ตั้งค่าการแสดงผล

source: Select None
th_th: ไม่เลือก

source: Select All
th_th: เลือกทั้งหมด

source: Refresh list
th_th: อัพเดทลิสต์

source: Version:
th_th: เวอร์ชัน:

source: Author:
th_th: ผู้แต่ง:

source: Description:
th_th: คำอธิบาย:

source: Dependencies:
th_th: อ้างอิง:

source: Missing mod!
th_th: ม็อดสูญหาย!

source: References:
th_th: อ้างอิง:

source: Translation:
th_th: แปลภาษา:

source: Missing dependent mods above:
th_th: ไม่พบ ต้องพึ่งพาม็อดข้างบน:

source: Missing reference mods:
th_th: ไม่พบม็อดที่เกี่ยวข้อง:

source: The mods list represents the load order, in other words mods further down the list will overwrite the mods above them if they have any conflicts.
th_th: รายการม็อดแสดงการโหลดของม็อด, ให้เข้าใจง่ายๆคือ ม็อดที่อยู่ด้านล่างของรายการจะเขียนทับม็อดที่อยู่ด้านบนถ้าหากม็อดนั้นๆมีข้อมูลที่ทับกัน.

source: Mods order info
th_th: รายละเอียดลำดับของม็อด

source: Video settings
th_th: ตั้งค่าวิดิโอ

source: Mods
th_th: ม็อด

source: Changelog
th_th: ประวัติคำสั่ง

source: Serial
th_th: ซีเรียล

source: OK
th_th: ตกลง

source: Cancel
th_th: ยกเลิก

source: Save config
th_th: บันทึกการปรับแต่ง

source: Advanced
th_th: การตั้งค่าขั้นสูง

source: Language:
th_th: ภาษา:

source: Please restart the game to apply the new settings.
th_th: กรุณาเริ่มต้นเกมใหม่อีกครั้งเพื่อเปิดใช้งานการตั้งค่า.

source: NVIDIA profiles updated
th_th: ข้อมูลจาก Nvidia profiles ได้รับการอัพเดทแล้ว

source: No video devices detected.
th_th: ไม่พบอุปกรณ์ที่เกี่ยวข้องกับการแสดงภาพ.

source: Video Error
th_th: มีความผิดพลาดของวีดีโอ

source: Invalid video resolution.
th_th: รายละเอียดจอแสดงผลไม่ถูกต้อง.

source: One or more mods are missing or in incorrect order. Continue anyway?
th_th: Mods ตัวใดตัวหนึ่งผิดผลาดหรือแสดงผลไม่ถูกต้อง. จะยังเล่นเกมต่อมั้ย?

source: Mods warning
th_th: คำเตือน Mods

source: To apply properly the new language you need to restart the game.
th_th: เพื่อให้การเปลี่ยนภาษามีผล เจ้าต้องรีสตาร์ทเกมส์.

source: Information
th_th: ข้อมูลเพิ่มเติม

source: Activate
th_th: กำลังทำงาน

source: Try Demo
th_th: ทดลองตัวเกมตัวอย่าง

source: Enter Key
th_th: กรอก Key

source: Failed to activate Kenshi.
th_th: ล้มเหลวในการเปิดใช้งาน Kenshi.

source: Error
th_th: มีความผิดพลาด

source: Activation Key
th_th: Key เปิดใช้งาน

source: This is your serial key code. Press deactivate if you want to install on another machine.
th_th: นี้คือ serial code ของ, กรุณาปิดการใช้งานก่อน(deactivated) หากต้องการติดตั้งเกมที่อุปกรณ์อื่น.

source: Deactivate
th_th: ปิดการใช้งาน (deactivated)

source: Demo Mode
th_th: โหมดทดลอง

source: Kenshi has now been deactivated. You can still play it in Demo mode
th_th: Kenshi ถูกปิดการใช้งานแล้ว ยังสามารถเล่นต่อได้ในโหมด demo

source: Deactivated
th_th: ปิดการใช้งานแล้ว

source: There was an error deactivating this machine.
th_th: มีข้อผิดพลาดในการหยุดเครื่องจักร.

source: Bah
th_th: เหอะ

source: DISMISS
th_th: ยกเลิก

source: PREVIOUS
th_th: ก่อนหน้า

source: CONTINUE
th_th: ต่อไป

source: SKIP
th_th: ข้าม

source: FINISH
th_th: สำเร็จ

source: TUTORIALS
th_th: โหมดฝึกสอน

source: ACTIVATE
th_th: เริ่มการทำงาน

source: You can move the camera with the WASD keys. To rotate your view hold the middle mouse button, to zoom use the mouse scroll. Do both to continue.
th_th: สามารถเลื่อนมุมมองกล้องด้วยปุ่ม WASD. หากต้องการมองไปรอบๆ ให้กดปุ่มลูกกลิ้งเมาส์, หากต้องการซูมภาพ ให้เลื่อนลูกกลิ้งเม้าส์. ทำทั้งหมดเพื่อไปต่อ.

source: The middle bottom panel shows the characters in your active squad. To select a squad member, left click the character icon on the panel.
th_th: ช่องตรงกลางล่างจะแสดงตัวละครในกลุ่มที่ใช้อยู่ปัจจุบัน. คลิกซ้ายบนไอคอนตัวละครที่ต้องการในแถวเพื่อเลือกตัวละครนั้น.

source: To give a move order to your character, right click on the terrain.
th_th: หากต้องการเคลื่อนที่ตัวละครของ ให้กดคลิกขวาที่พื้น.

source: Double click on your character icon to centre on screen and follow their movement.
th_th: ดับเบิ้ลคลิกบนไอคอนตัวละครตรงกลางจอ เพื่อติดตามตัวละคร.

source: Basic Controls
th_th: การควบคุมพื้นฐาน

source: Right click on characters or interactable objects to interact. Hold the right mouse button on to get more availiable actions
th_th: คลิกขวาที่ตัวละครหรือสิ่งของเพื่อตอบโต้. คลิกขวาค้างไว้เพื่อตัวเลือกที่เยอะขึ้น

source: Select a character from your squad
th_th: เลือกตัวละครจาก กลุ่ม(squad) ของ

source: This shows your selection's current state, statistics and other basic info. Mouse over each item for more information.
th_th: นี้ี่จะแสดงสภาวะปัจจุบัน, สถิติและข้อมูลเบื้องต้นของตัวที่เลือก. เลื่อนลูกศรไปบนไอเทม เพื่อดูรายละเอียด.

source: This shows the selected character's current health condition. Mouse over each item for more information.
th_th: แสดงค่าเลือดปัจจุบันและสถานะของตัวละครที่เลือก. เลื่อนเม้าส์ไปที่ไอเท็มเพื่อดูข้อมูล.

source: The arrow buttons allow you to pause and fastforward the game speed.
th_th: สามารถกดปุ่มลูกศรเพิ่มหยุดเกม หรือเร่งความเร็วของเกมได้.

source: Here you'll find your character's current funds and the in-game time and date.
th_th: จะเห็นการเงินของตัวละครที่เลือก เวลาและวันที่ในเกมตรงนี้.

source: This opens the 'Build' menu
th_th: เปิดเมนู "สร้าง" ตรงนี้

source: Here you can open your inventory, skill statistics, world map, tech and squad management menus. For more tips and tutorials make sure to check out the Help menu at the very bottom.
th_th: เปิดหน้าต่างกระเป๋า, สกิล, แผนที่โลก, เทคโนโลยี และการจัดการทีมตรงนี้. ไปที่เมนู "ช่วยเหลือ" ด้านล่างสำหรับตัวช่วยอื่นๆ.

source: This shows assigned player jobs and orders for the selected character.
th_th: รายการนี้มอบหมายงานและคำสั่งของตัวละครที่เลือก.

source: GUI overview
th_th: ภาพรวม GUI

source: Tap the 'M' key to open up the map. You can use the world map to navigate and find nearby towns or points of interest
th_th: กดปุ่ม​ M เพื่อ​เปิดแผนที่​ ​สามารถ​ใช้แผนที่​โลกเพื่อ​นำทางและค้นหา​เมือง​ใกล้เคียง​หรือ​เป้าหมาย​ที่​น่าสนใจ​

source: What do I do?
th_th: ข้าควรทำอะไร?

source: There is no linear story or mission to guide you in Kenshi. Be a trader, a thief, a bounty hunter, a farmer or even a warlord... You'll need to explore the world and find your own adventure.
th_th: ในkenshi​ไม่ได้​มีเนื้อเรื่อง​ที่​เป็น​เส้นตรง​หรือ​ภารกิจ​ให้​​ทำ​สามารถ​ที่จะ​เป็น​พ่อค้า, โจร, นักล่าค้าหัว, ชาวนา​หรือ​แม้กระทั่ง​เจ้าเมือง​... เจ้าจะต้องออกไปท่องโลก และตามหาการผจญภัยของเจ้าเอง.

source: First things first, you'll need food and funds to survive. To get started you can either scavenge the outlands for loot, mine valuable materials from iron ore veins, or you can even resort to thievery after nightfall.
th_th: ก่อนอื่นเลย เจ้าจะต้องมีอาหารและเงินในการเอาตัวรอด. เพื่อการตั้งตัว เจ้าสามารถที่จะออกไปหาขยะจากดินแดนรกร้าง ขุดแร่ที่มีค่าจากสายแร่ หรือแม้แต่ไปขโมยของชาวบ้านตอนตะวันตกดิน.

source: To cash in your loot, you'll need to find a store. Use the map to navigate to a nearby town and find shops.
th_th: เพื่่อขายของที่เจ้าปล้นมา เจ้าต้องหาร้านค้าให้เจอ. ใช้แผนที่เพื่อทำทางไปยังเมืองใกล้ ๆ และหาร้านค้า.

source: Surviving alone in the world of Kenshi won't be easy, but hiring new recruits will help. Check the town bars for mercs, or buy animal companions from any of the farms outside of town. Remember: You're not special and you're not stronger than everyone else. Train hard, pick your fights wisely and don't be afraid to run like crazy!
th_th: การเอาตัวรอด​ในโลกของ​ kenshi​ เพียง​คนเดียว​ไม่​ใช้เรื่อง​ง่ายแต่การจ้างพักพวก​ใหม่​สามารถ​ช่วยได้ ตรวจสอบตามร้านเหล้าในเมืองสำหรับ​ทหาร​รับจ้าง​ หรือซื้อ​สัตว์​เลี้ยง​จากชาวนาในที่ต่าง​ๆนอกเมือง​. จำไว้ว่า: เจ้าไม่ได้พิเศษและเจ้าไม่ได้แข็งแกร่งไปกว่าทุกคน. ฝึกฝน​ให้​หนัก​ เลือก​การต่อสู้​อย่าง​รอบคอบ​และอย่า​กลัว​การ​วิ่ง​หนี​เหมือน​คนบ้า​!

source: To cash in your loot, you'll need to find a store. Hold 'ALT' key to show nearby shop signs.
th_th: หากต้องการทำเงินจากของที่ได้มา, เจ้าต้องไปหาร้านค้า. กดปุ่ม 'ALT' ค้าง เพื่อแสดงตำแหน่งร้านค้าใกล้ๆ.

source: What do I do? (Towns)
th_th: ข้าทำอะไรงั้นหรือ (ชาวเมือง)

source: You've discovered your first town! Towns are perfect for stocking up on supplies and selling loot.
th_th: เจ้าได้ค้นพบเมืองแรกของเจ้า! เมืองที่สมบูรณ์สำหรับการจัดเก็บวัสดุและขายของที่ระลึก.

source: Be wary of entering private buildings. Residents often don't like trespassers. You can find out whether a building is marked public or private by selecting the building. Also most shops close at night.
th_th: โปรดระวังเมื่อได้เข้าไปในอาคารที่มีเจ้าของ. ผู้อาศัยไม่ชอบให้มีการบุรุกพื้นที่ส่วนตัว. เจ้าสามารถรู้ได้ว่าอาคารนี้เป็นอาคารสาธารณะหรืออาคารที่มีเจ้าของ โดยการเลือกดูที่อาคารนั้น. ร้านค้าส่วนใหญ่ปิดเวลากลางคืน.

source: Too much damage can result in KO, crippling and death. The green bars in the health panel show your health, the red bars show bleeding damage. Bleeding damage will need first aid.
th_th: ได้รับความเสียหายมากเกินไป จะนำไปสู่สถานะ สลบ, พิการ หรือตายได้. แถบสีเชียวในช่องชีวิตจะแสดงพลังชีวิต แถบสีแดงแสดงผลการติดเลือดใหล. ผลเลือดใหลรักษาได้ด้วยการปฐมพยาบาล.

source: You are injured
th_th: เจ้าได้รับบาดเจ็บ

source: In order to heal, you'll need to get a First Aid Kit. You can buy or steal them from stores in town.
th_th: หากต้องการฟื้นฟูเลือด เจ้าจำเป็นต้องใช้ first aid kit, เจ้าสามารถหาซื้อ หรือขโมยได้จากร้านค้าในเมือง.

source: To heal a character you'll need a First Aid Kit in your inventory. Hold and right click the target, then select 'First Aid' from the menu, or simply right click the heal icon over the injured person.
th_th: เจ้าต้องมีชุดปฐมพยาบาลในกระเป๋าหากต้องการรักษาผู้เล่น. คลิกขวาค้างที่ตัวเป้าหมาย จากนั้นเลือก 'ปฐมพยาบาล' จากเมนู หรือสามารถคลิกขวาที่ไอคอนรักษาบนตัวผู้เล่นที่บาดเจ็บได้เช่นกัน.

source: Alternatively you can click the medic button from the rightside command menu. This will heal all wounded squad members within range.
th_th: หรืออีกวิธีหนึ่งคือคลิกที่ปุ่มการแพทย์ในเมนูคำสั่งด้านขวาบน. คำสั่งนี้จะทำการรักษาผู้เล่นที่บาดเจ็บทุกคนที่อยู่ในระยะ.

source: All body parts are each affected in their own way. Your head, chest and stomach, are your vitals. If any of them fall below 0, you will pass out, and if they reach -100 then you will die.
th_th: ทุกส่วนของร่างกายสามารถบาดเจ็บได้ในรูปแบบต่างๆ จุดอ่อนของเจ้าอยู่ที่ศรีษะ หน้าอก และท้อง. หากส่วนใดส่วนหนึ่งเหลือต่ำกว่า 0 จะสลบไป และหากถึง -100 ก็จะตาย.

source: If any of your limbs fall below 0, you won't be able to fight or walk properly. You can use a Splint Kit on broken limbs to speed up recovery and improve the limb's function until recovered.
th_th: หากค่าของอวัยวะส่วนใดก็ตามลดต่ำกว่า 0 เจ้าจะไม่สามารถต่อสู้หรือเดินได้อย่างปกติ. เจ้าสามารถใช้อุปกรณ์เข้าเฝือกอวัยวะส่วนที่เสียหายได้เพื่อเร่งผลการรักษา แต่หากว่าค่าของอวัยวะใดๆลดต่ำกว่า 0 เจ้าจะสลบ.
