Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: HOLD POSITION means that the selected character won't run off to fight enemies, even to protect his allies. He will hold his position and only attack any enemy that comes into close range. He will still use a crossbow normally, but won't move around obstacles to get a shot. Use this setting to tactically position fighters, or just to keep non-combatants away from the fighting.
th_th: คำสั่งรักษาตำแหน่ง หมายถึง ตัวละครที่ถูกเลือกจะไม่ออกไปสู้กับศัตรู, หรือแม้แต่ปกป้องเพื่อน. ตัวละครจะอยู่กับที่และจะโจมตีเฉพาะศัตรูที่เข้ามาใกล้ที่สุด. ตัวละครจะยังใช้ อาวุธประเภท "หน้าไม้" เหมือนปกติ, แต่จะไม่เดินหาที่กำบังเพื่อยิงศัตรู. คำสั่งนี้เหมาะกับการใช้งานสำหรับวางแผนตำแหน่งต่าง ๆ ของตัวละครในการต่อสู้, หรือแยกตัวละครที่ไม่สามารถต่อสู้ได้ออกไป.

source: In non-combat mode a character will never initiate combat, even if his allies are fighting or need help. He will only fight when directly attacked, and is less likely to be targeted by enemies.
th_th: ในโหมดห้ามต่อสู้ ตัวละครจะไม่เริ่มต่อสู้ก่อน, แม้ว่าเพื่อนจะต่อสู้อยู่หรือต้องการความช่วยเหลือก็ตาม. ตัวละครจะเริ่มต่อสู้เมื่อมีคำสั่งให้ต่อสู้จากผู้เล่นโดยตรง, และตัวละครที่อยู่ในโหมดนี้จะตกเป็นเป้าหมายของศัตรูน้อยลง.

source: If this is disabled then the character won't do any of the jobs listed.
th_th: ถ้าคำสั่งนี้ถูกปิดการใช้งาน ตัวละครจะไม่ทำตาม งานต่างๆที่เลือกไว้.

source: The character will make himself offensive, noisy and conspicuous in an attempt to draw more of the enemy to attack him. Using this enables your experienced and well armoured characters to draw trouble away from your more vulnerable ones.
th_th: ตัวละครจะทำตัว ก้าวร้าว, ส่งเสียงดัง และทำตัวเด่น เพื่อเรียกร้องความสนใจจากศัตรูให้มาโจมตี. เปิดใช้งานคำสั่งนี้ ให้กับตัวละครที่มีค่าประสบการณ์สูง และมีเครื่องสวมใส่ที่ภาพดี เพื่อปกป้องตัวละครอื่น ๆ ที่อ่อนแอกว่า.

source: Activates sneak mode so the character will try to go unnoticed.
th_th: เปิดใช้งานโหมดซ่อนเร้นจะทำให้ตัวละครไม่เป็นที่สนใจ.

source: If the character is unconscious, when he wakes up he will stay down on the ground and crawl to avoid detection.
th_th: ถ้าตัวละครหมดสติ, เมื่อตัวละครตื่นขึ้น ตัวละครอยู่หมอบลงกับพื้นและคลานแทนการเคลื่อนไหวปกติ เพื่อหลีกเลี่ยงการตรวจจับ.

source: If enabled then the character will prioritise ranged attacks, melee will be a last resort.
th_th: ถ้าเปิดใช้งาน ตัวละครจะให้ความสำคัญกับการโจมตีระยะไกลมากที่สุด, การโจมตีระยะใกล้จะไว้เป็นทางเลือกสุดท้าย.

source: Pressing this button will order your selected characters to automatically heal everyone else in the squad, including themselves. They will need a medkit in their inventory.
th_th: กดปุ่มนี้เพื่อสั่งให้ตัวละครของ รักษาทุกคนในทีม, รวมถึงตัวละครเองด้วย. ตัวละครที่ได้รับคำสั่งจะต้องมี ชุดปฐมพยาบาล ในช่องเก็บของด้วย.

source: Rescue
th_th: ช่วยเหลือ

source: This will order your selected characters to pick up all your wounded allies. If you own any buildings nearby, they will take the wounded and put them in beds. Make sure to heal their wounds first.
th_th: คำสั่งนี้จะสั่งให้ตัวละครแบกเพื่อนที่บาดเจ็บทั้งหมด. ถ้าหากมีสิ่งก่อสร้างของอยู่ใกล้ ๆ, ตัวละครจะแบกที่บาดเจ็บเพื่อนไปไว้ที่เตียง. ทำให้แน่ใจว่าตัวละครที่บาดเจ็บได้รับการรักษาแผลก่อนจึงใช้คำสั่งนี้.

source: Prospect
th_th: สำรวจ

source: This will give you information on the richness of resources at your location. Stone, iron, water, fertility... It's important to check for these things before building an outpost.
th_th: คำสั่งนี้จะให้ข้อมูลความอุดมสมบูรณ์ของทรัพยากรในจุดที่อยู่ หิน เหล็ก น้ำ ภาพดิน... มันสำคัญมากที่จะตรวจสอบสิ่งเหล่านี้ก่อนจะสร้างฐาน.

source: No jobs assigned
th_th: ไม่มีงานให้มอบหมาย

source: To add jobs, hold shift key when giving an order
th_th: เพื่อมอบงาน, กดปุ่ม shift เพื่อมอบคำสั่ง

source: Research:
th_th: งานวิจัย:

source: Battery charge:
th_th: แบตเตอร์รี่ชาร์จ:

source: Buyer's money:
th_th: เงินผู้ซื้อ:

source: Ok
th_th: ตกลง

source: Yes
th_th: ตกลง

source: No
th_th: ไม่

source: Abort
th_th: ยกเลิก

source: Seems packaging the crash dump failed miserably. There should be a .dmp file there instead.
th_th: ดูเหมือนความผิดพลาดของการถ่ายโอนข้อมูลล้มเหลวอย่างน่าเศร้า. ควรมีไฟล์. dmp อยู่ที่นั่น.

source: Crash fail
th_th: เกิดข้อผิดพลาด

source: Kenshi has crashed. A crash report has been generated in your main install folder:{1}{2}.zip. Please go to the bug report forum at www.lofigames.com/forum/. If you upload it there, with as much information as you can about exactly what happened, this bug is likely to get fixed very quickly. Your help would be appreciated.
th_th: Kenshi ได้หยุดทำงาน รายงานปัญหาด้านเทคนิคได้ถูกสร้างขึ้นใน install folder:{1}{2}.zip. ได้โปรดไปที่ www.lofigames.com/forum/. เพื่อรายงานปัญหาด้านเทคนิค ถ้าหากอัพโหลดที่นั้น ด้วยข้อมูลที่สามารถบอกได้ว่าเกิดอะไรขึ้น ปัญหาด้านเทคนิคนี้จะสามารถแก้ไขได้อย่างรวดเร็ว (เป็นภาษาอังกฤษ). Your help would be appreciated.

source: An exception occurred!
th_th: มีบางอย่างผิดพลาด!

source: I can't afford that.
th_th: ข้าไม่มีปัญญาซื้อหรอก.

source: Hold down the ALT key to steal items
th_th: กดค้างที่ปุ่ม ALT เพื่อขโมยไอเท็ม

source: {1} has been butchered
th_th: {1} โดนแล่เรียบร้อย

source: {1,num} cats added.
th_th: {1,num} cats ได้รับ.

source: Regenerate sector
th_th: สร้างรูปแบบพื้นที่ใหม่

source: Foliage removal
th_th: ลบใบไม้

source: Render all
th_th: แสดงผลทั้งหมด

source: Render selection
th_th: เลือกการแสดงผล

source: Erase selection
th_th: ลบการเลือก

source: Project roads
th_th: โครงการถนน

source: Validate road network
th_th: ตรวจสอบเครือข่าย

source: Hidden
th_th: ถูกซ่อน

source: Road width
th_th: ความกว้างของถนน

source: NavMesh
th_th: การนำทาง

source: Roads
th_th: ถนน

source: Town Placement
th_th: ตำแหน่งในเมือง

source: Reset Population
th_th: รีเซ็ตประชากร

source: Navmesh Tools
th_th: เครื่องมือการนำทาง

source: Terrain Features
th_th: สมบัติภูมิประเทศ

source: Terrain Fog
th_th: หมอกภูมิประเทศ

source: Buildings
th_th: สิ่งก่อสร้าง

source: Fix stuff
th_th: แก้ไขสิ่งต่างๆ

source: Save Mod
th_th: บันทึกม็อด

source: Exit
th_th: ออกเกม

source: Save
th_th: บันทึก

source: Del
th_th: ลบ

source: None selected
th_th: สิ่งที่ไม่ถูกเลือก

source: Show Interior
th_th: แสดงการตกแต่งภายใน

source: Clear
th_th: เคลียร์

source: Clear Nodes
th_th: เคลียร์โหนด

source: Layout
th_th: แผนผัง

source: Interior edit mode
th_th: โหมดแก้ไขภายใน

source: Interior
th_th: ด้านใน

source: Furniture
th_th: เฟอร์นิเจอร์

source: Exterior
th_th: ด้านนอก

source: Signs and NPCs
th_th: สัญญาณและ NPC

source: Level Editor
th_th: แก้ไข Level

source: This will remove this interior for all buildings of this type that reference it. Are you sure you want to delete it?
th_th: นี้จะลบด้านในของสิ่งปลูกสร้างทั้งหมดของประเภทนี้ที่อ้างอิงอยู่. เจ้าแน่ใจหรือว่าต้องการลบ?

source: This will remove this exterior for all buildings of this type that reference it. Are you sure you want to delete it?
th_th: นี้จะลบด้านนอกของสิ่งปลูกสร้างทั้งหมดของประเภทนี้ที่อ้างอิงอยู่. เจ้าแน่ใจหรือว่าต้องการลบ?

source: Autosaved
th_th: บันทึกอัตโนมัติ

source: Save successful
th_th: บันทึกสำเร็จ

source: Error saving game. Please try again.
th_th: พบปัญหาในการบันทึกเกม กรุณาลองใหม่.

source: Failed to save game. Please try again.
th_th: ล้มเหลวในการบันทึกเกม กรุณาลองใหม่.

source: Updates
th_th: อัพเดต

source: Kenshi has now been updated to v{1}. You should go back to the main menu and press [Import Game] to start a fresh new game world with your existing squad. Otherwise some of the world's content may be missing or buggy.
th_th: Kenshi ได้อัพเดตเป็นเวอร์ชั่น {1}. ควรจะกลับไปที่เมนูหลัก และกด [นำเข้าเกม] เพื่อที่จะเริ่มโลกใหม่ด้วยทีมเดิมของ. ไม่อย่างนั้นอาจจะเจอกับ bug หรือบางจุดไม่ทำงานหรือหายไป.

source: Load game error! Your squad has been salvaged. Awarded 10000 cats as compensation.
th_th: โหลดเกมผิดพลาด ! ทีมของถูกกู้คืน. ได้รับแมว 10,000 ตัวเป็นค่าตอบแทน.

source: Demo mode
th_th: โหมดทดลอง

source: Buy the full game to access the editor
th_th: ซื้อเกมตัวเต็มเพื่อเข้าถึงการแก้ไข

source: Map
th_th: แผนที่

source: Faction
th_th: ฝ่าย

source: Research
th_th: วิจัย

source: Crafting
th_th: สร้าง

source: Squads
th_th: กลุ่ม

source: Dialogue
th_th: การสนทนา

source: You currently have no research facilities. Build a research bench and assign someone to work there.
th_th: ตอนนี้ไม่มีโต๊ะวิจัย สร้าง research bench และมอบหมายใครซักคนไปวิจัยเสีย.

source: Types
th_th: ประเภท

source: Blueprints
th_th: พิมพ์เขียว

source: RESEARCH - LEVEL {1,num} (CURRENT RATE: {2,num=fix,p=2}x)
th_th: วิจัย - ระดับ {1,num} (อัตราขณะนี้: {2,num=fix,p=2}x)

source: Ditch items
th_th: ทิ้งของ

source: If they have nothing else to do, characters will automatically put any excess materials they are carrying into storage. This can help to un-block the base AI when things grind to a halt from over-filled inventories.
th_th: หากพวกเขาไม่ได้ทำอะไร พวกเขาจะนำวัตถุดิบส่วนเกินที่พวกเขาแบกไว้ลงกล่องเก็บของโดยอัตโนมัติ สิ่งนี้จะช่วยแก้ปัญหาพื้นฐานของ AI เวลาของเต็มแล้วหยุดชะงักการทำงานลง.

source: Sleep when injured
th_th: นอนเมื่อบาดเจ็บ

source: Characters will automatically go to bed if they are injured and have nothing else to do
th_th: ตัวละครจะไปนอนโดยอัตโนมัติเมื่อได้รับบาดเจ็บและไม่มีอะไรเหลือให้ทำ

source: Sit when idle
th_th: นั่งลงเมื่อไม่มีอะไรทำ

source: Idle characters at home will sit down on chairs and benches, if you have any
th_th: เมื่ออยู่ที่บ้าน ตัวละครที่ไม่มีอะไรทำ จะหาม้านั่งหรือเก้าอี้นั่ง ถ้ามีซักตัวนะ

source: Heal Allies
th_th: รักษาพวกพ้อง

source: Characters with the medic job will also heal characters of allied factions
th_th: ตัวละครที่มีอาชีพเป็นพยาบาลจะช่วย Heal ตัวละครที่มาจาก Faction พันธมิตรได้

source: Help Allies
th_th: ช่วยพวกพ้อง

source: Characters will help out characters from other allied factions if they are under attack
th_th: ตัวละครจะช่วยเหลือตัวละครอื่นจาก Faction พันธมิตร หากถูกโจมตี

source: Rescue Allies
th_th: ช่วยพวกพ้อง

source: Characters with the rescue job will also rescue allied characters from other factions
th_th: ตัวละครที่ี่รับหน้าทีช่วยเหลือจะช่วยตัวละครจาก Faction พันธมิตรของเราด้วย

source: Share Food
th_th: แบ่งปันอาหาร

source: Characters in a squad will automatically share any of their food that is in a backpack (if in range).
th_th: ตัวละครในกลุ่มจะแบ่งบันอาหารจากกระเป๋าหลังโดยอัตโนมัติ(ถ้าอยู่ในระยะ)

source: Feed Animals
th_th: ป้อนอาหารสัตว์

source: If food is running low, you can elect not to feed your animals.
th_th: ถ้าอาหารเหลือน้อย, สามารถเลือกที่จะไม่ให้อาหารสัตว์เลี้ยงได้.

source: Shoot first, ask later
th_th: ยิงก่อน,ถามทีหลัง

source: Your turret gunners will shoot at any potentially dangerous but neutral targets, such as wild animals or bandits, without waiting for them to attack the base first.
th_th: ป้อมปืนของจะยิงทุกสิ่งที่เป็นอันตราย,เช่น สัตว์ป่า หรือ โจร โดยไม่ต้องรอให้พวกนี้โจมตีก่อน แต่จะไม่โจมตีสิ่งที่เป็นมิตร.

source: Follow Formation
th_th: ตามรูปแบบที่วางไว้

source: Random
th_th: สุ่ม

source: Military
th_th: ทหาร

source: Caravan
th_th: คาราวาน

source: Formation used when squad members are following a leader
th_th: ใช้รูปแบบนี้เมื่อสมาชิกในกลุ่มตามผู้นำ

source: Needs research bench level {1,num}
th_th: ต้องการโต๊ะวิจัยระดับ {1,num}

source: Cost:
th_th: ราคา:

source: Paid
th_th: จ่าย

source: Requirements:
th_th: ความต้องการ:

source: New Building:
th_th: สิ่งก่อสร้างใหม่:

source: New Weapon Class:
th_th: อาวุุธประเภทใหม่:

source: New Weapons Grade:
th_th: อาวุธเกรดใหม่:

source: New Armour Type:
th_th: เกราะชนิดใหม่:

source: New Items:
th_th: สิ่ิ่งของใหม่:

source: New Crossbows:
th_th: หน้าไม้ใหม่:

source: New Backpacks:
th_th: เป้สะพายหลังใหม่:

source: New Robot Limbs:
th_th: อวัยวะ(แขน ขา)หุ่นยนต์ใหม่:

source: Not enough artifacts, research cannot begin. Find artifacts and place them in your research bench.
th_th: สิ่งประดิษฐ์ไม่เพียงพอ, ไม่สามารถเริ่มการวิจัย. ตามหาสิ่งประดิษฐ์แล้วนำไปวางในโต๊ะทำวิจัย.

source: Cannot research '{1}'. Requirements not met.
th_th: ไม่สามารถวิจัย '{1}' ไม่พบสิ่งที่ตรงตามข้อกำหนด.

source: Research Blueprint
th_th: วิจัยพิมพ์เขียว

source: Cannot learn this yet
th_th: ไม่สามารถเรียนรู้ได้ขณะนี้

source: Right-click to learn tech
th_th: คลิกขวาเพื่อเรียนเทคโนโลยี

source: Tech Level
th_th: เทคโนโลยี ระดับ

source: Value
th_th: มูลค่า

source: Overview
th_th: ภาพรวม

source: Resources
th_th: ทรัพยากร

source: Prospecting Results
th_th: ผลการสำรวจ

source: Zone:
th_th: พื้นที่:

source: Altitude:
th_th: ระดับความสูงวัดจากน้ำทะเล:

source: Prospector Skill:
th_th: ทักษะขุดแร่:

source: Area Size:
th_th: ขนาดพื้นที่:

source: Green
th_th: เขียวชอุ่ม

source: Arid
th_th: แห้งแล้ง

source: Swamp
th_th: บึง

source: Wind Speed:
th_th: อัตราเร็วลม:

source: Add squad
th_th: เพิ่มกลุ่ม

source: Dismiss
th_th: ถอนสิ่งปลูกสร้าง

source: Maximum number of squads reached.
th_th: จ่ำนวนสมาชิกในหน่วยเต็มแล้ว.

source: The squad needs to be empty before it can be removed.
th_th: หน่วยนี้จะสามารถลบได้ก็ต่อเมื่อเจ้าทำการเอาสมาชิกออกหมดก่อน.

source: You must have at least one squad.
th_th: เจ้าต้องมีอย่างน้อยหนึ่งหน่วย.

source: Dismiss character
th_th: ปลดระวาง ตัวละคร

source: Cannot dismiss the only remaining character in the faction.
th_th: ไม่สามารถปลดระวางตัวละครได้เนื่องจากเหลือคนเดียวใน Faction.

source: Dismiss character '{1}'?
th_th: ปลดระวางตัวละคร '{1}'?

source: Delete
th_th: ลบ

source: Faction name
th_th: ชื่อของฝ่าย

source: ---Active Contracts---
th_th: ---รายชื่อติดต่อ---

source: ---Upcoming Events---
th_th: ---Event เร็วๆนี้---

source: Faction Name
th_th: ชื่อของฝ่าย

source: This faction name already exists
th_th: ชื่อของ Faction นี้ถูกใช้แล้ว

source: Manage Contract
th_th: จัดการรายชื่อติดต่อ

source: Sell value
th_th: ราคาขาย

source: Ammunition
th_th: ลูกกระสุน

source: Research Artifact
th_th: งานวิจัย

source: Unique
th_th: หายาก

source: Book
th_th: หนังสือ

source: Food
th_th: อาหาร

source: Possibly Edible
th_th: น่าจะกินได้

source: Only for:
th_th: สำหรับ :

source: Also edible for animals
th_th: สัตว์กินได้

source: Nutrition
th_th: สารอาหาร

source: Shots
th_th: จำนวนกระสุนที่ยิงได้

source: {1,num} kg
th_th: {1,num} กิโลกรัม

source: Weight
th_th: น้ำหนัก

source: Avg. Price
th_th: ราคาเฉลี่ย

source: Price mark-up
th_th: ค่าเฉลี่ยราคาของ

source: Charges
th_th: จู่โจม

source: Quality
th_th: คุณภาพ

source: Crossbow class
th_th: Class หน้าไม้

source: Accuracy deviation:
th_th: การหักเหของความแม่นยำ:

source: Reload time:
th_th: เวลาบรรจุลูกกระสุน:

source: s
th_th: วินาที

source: m
th_th: เมตร

source: Velocity:
th_th: ความเร็ว:

source: m/s
th_th: เมตร/วินาที

source: Blood loss:
th_th: เสียเลือด:

source: Required skill:
th_th: ต้องมีทักษะ:

source: Ammunition type:
th_th: ประเภทกระสุน:

source: Damage vs robots
th_th: ความเสียหายต่อหุ่นยนต์

source: Damage vs humans
th_th: ความเสียหายต่อมนุษย์

source: Damage vs animals
th_th: ความเสียหายต่อสัตว์

source: Damage vs
th_th: ความเสียหายต่อ

source: Max HP:
th_th: พลังชีวิตสูงสุด:

source: -----STATS-----
th_th: -----สถานะ-----

source: Unarmed damage bonus
th_th: โบนัสความเสียหายมือเปล่า

source: Katana class
th_th: ประเภท คาตานะ

source: Sabre class
th_th: ประเภท ดาบโค้ง

source: Hacker class
th_th: ประเภท ดาบเจาะเกราะ

source: Heavy weapons class
th_th: ประเภท อาวุธหนัก

source: Polearm class
th_th: ประเภท อาวุธด้ามยาว

source: Blunt weapon class
th_th: ประเภท อาวุธไม่มีคม

source: Cutting damage
th_th: ความเสียหายประเภทฟัน

source: Blunt damage
th_th: ความเสียหายประเภททุบ

source: Blood loss
th_th: เสียเลือด

source: Armour penetration
th_th: เจาะเกราะ

source: Attack bonus
th_th: โบนัสโจมตี

source: Defence bonus
th_th: โบนัสป้องกัน

source: Indoors bonus
th_th: โบนัสเมื่ออยู่ภายในสิ่งปลูกสร้าง

source: Indoors penalty
th_th: โทษของการอยู่ภายในสิ่งปลูกสร้าง

source: Model ##
th_th: รุ่น ##

source: Crafted by {1}
th_th: สร้างโดย {1}

source: A masterful weapon crafted by the renowned smith {1} of {2}.
th_th: อาวุธที่สร้างโดยช่างที่มีชื่อเสียง {1} แห่ง {2}.

source: Crafted by the smith {1} of {2}.
th_th: สร้างโดยช่างเหล็ก {1} แห่ง {2}.

source: Manufactured by
th_th: ผลิตโดย

source: empty
th_th: ว่าง

source: Encumbrance reduction
th_th: ลดภาระน้ำหนัก

source: Combat skills bonus
th_th: โบนัสทักษะการต่อสู้

source: Athletics effect
th_th: เอฟเฟกต์การวิ่ง

source: Combat speed effect
th_th: ความเร็วการต่อสู้

source: Stealth skill effect
th_th: ทักษะการพรางตัว

source: Dodge skill effect
th_th: ทักษะการหลบ

source: Stolen from:
th_th: ขโมยมาจาก:

source: Stolen
th_th: ขโมย

source: Buyback
th_th: ซื้อคืน

source: Duststorms
th_th: พายุทราย

source: Acid
th_th: กรด

source: Burning
th_th: ไหม้

source: Gas
th_th: แก็ส

source: Rain
th_th: ฝน

source: Faction Uniform:
th_th: เครื่องแบบฝ่าย:

source: {1} Grade
th_th: ระดับ {1}

source: Light Armour Class
th_th: ประเภท เกราะเบา

source: Medium Armour Class
th_th: ประเภท เกราะปานกลาง

source: Heavy Armour Class
th_th: ประเภท เกราะหนัก

source: Leather
th_th: หนัง

source: Chain
th_th: โซ่

source: Metal Plate
th_th: แผ่นโลหะ

source: Cloth
th_th: ผ้า

source: Blunt resistance
th_th: การต้านทานอาวุธไร้คม

source: Cut resistance
th_th: การต้านทานอาวุธมีคม

source: Cut resistance efficiency
th_th: ประสิทธิภาพการต้านทานอาวุธมีคม

source: Harpoon resistance
th_th: การต้านทานฉมวก

source: [Weather Protections]
th_th: [การป้องกันต่อสภาพอากาศ]

source: Coverage
th_th: คุ้มกัน

source: No Armour Coverage
th_th: ไม่มีเกาะคุ้มกัน

source: Skills
th_th: ทักษะ

source: Stealth effect
th_th: ผลของการขโมย

source: Crossbows effect
th_th: ผลของหน้าไม้

source: Dexterity effect
th_th: ผมของความแม่นยำ

source: Attack damage effect
th_th: ผลของความเสียหาย

source: Assassination skill
th_th: ทักษะการลอบสังหาร

source: Fist protection
th_th: การป้องกันด้วยหมัดเปล่า

source: Melee attack/defence bonus
th_th: โบนัสการโจมตี/ป้องกันระยะประชิด

source: Melee attack bonus
th_th: โบนัสโจมตีระยะประชิด

source: Melee defence bonus
th_th: โบนัสป้องกันระยะประชิด

source: Martial arts bonus
th_th: โบนัสจากศิลปะป้องกันตัว

source: Perception bonus
th_th: โบนัสจากมุมมอง

source: High quality armour crafted by the renowned smith {1} of {2}.
th_th: เกราะชั้นดีที่ถูกสร้างโดยนักตีเหล็กมือฉมัง {1} แห่ง {2}.

source: This item is broken and can be freely removed at any time.
th_th: ไอเทมนี้พังแล้วและสามารถลบเมื่อไหร่ก็ได้.

source: This item is unlocked and can be freely removed at any time.
th_th: ไอเทมนี้ถูกปลดล็อคและสามารถลบเมื่อไหร่ก็ได้.

source: Locked:
th_th: ล็อค:

source: This item is locked in place and cannot be removed. You can try to pick the lock, find a saw, or use brute strength.
th_th: ไอเท็คนี้ถูกล็อค และ ไม่สามารถลบได้ เจ้าสามารถที่จะสะเดาะกุญแจ, หาเลื่อย, หรือใช้แรง ในการลองเปิดได้.

source: Warning: Once this item is locked in place it cannot be removed!
th_th: คำเตือน: ไอเท็มนี้ถูกล็อคในพื้นพี่จึงไม่สามารถลบได้!

source: Location already known
th_th: สถาณที่ทราบอยู่ก่อนแล้ว

source: Right-click to learn new map locations
th_th: คลิกขวาเพื่อเรียนรู้ตำแหน่งแผนที่ใหม่

source: Towns:
th_th: เมือง:

source: Right-click to add the funds to your faction
th_th: คลิกขวาเพื่อเพิ่มทุนให้ฝ่ายของเจ้า

source: Warning: Character template missing for '
th_th: คำเตือน: ไม่พบรูปแบบตัวละครสำหรับ '

source: '. Using fallback
th_th: '. ใช้การคืนค่ากลับ

source: {1} is dead.
th_th: {1} ได้เสียชีวิต.

source: {1} has died from blood loss.
th_th: {1} ได้เสียชีวิตจากการเสียเลือด.

source: {1} has died from starvation.
th_th: {1} ได้เสียชีวิตจากความหิวโหย.

source: Expired
th_th: หมดอายุ

source: {1,num} Days, {2,num}hrs
th_th: {1,num} วัน, {2,num} ชั่วโมง

source: {1,num}hrs
th_th: {1,num} ชั่วโมง

source: {1,num} mins
th_th: {1,num} นาที

source: Trade
th_th: ซื้อขาย

source: Loot
th_th: ขโมย

source: First Aid
th_th: กล่องปฐมพยาบาล

source: Splint Injuries
th_th: บาดเจ็บเข้าเฝือก

source: Repairs
th_th: ซ่อมแซม

source: Talk To
th_th: คุยกับ

source: Pick Up
th_th: หยิบ

source: Throw out of home
th_th: ขับไล่ไปจากบ้าน

source: Throw out of town
th_th: ขับไล่ไปจากเมือง

source: Kidnap
th_th: ลักพาตัว

source: Escape (skill)
th_th: หนี (โดยใช้ทักษะ)

source: Escape (strength)
th_th: หนี (โดยใช้กำลัง)

source: Put Down
th_th: วางลง

source: Put in Bed
th_th: วางลงบนเตียง

source: Attack Target
th_th: โจมตีเป้าหมายที่เลือก

source: Attack Unprovoked
th_th: โจมตีไร้ผล

source: Attack All
th_th: โจมตีทั้งหมด

source: Follow
th_th: ติดตาม

source: Build
th_th: สร้าง

source: Use
th_th: ใช้

source: Auto-Haul
th_th: ลากอัตโนมัติ

source: Open
th_th: เปิด

source: Close
th_th: ปิด

source: Lock
th_th: ล็อค

source: Unlock
th_th: ปลดล็อค

source: Unlock Shackles
th_th: สะเดาะโซ่ล่าม

source: Pick Lock
th_th: สะเดาะกุญแจ

source: Escape
th_th: หลบหนี

source: Repair
th_th: ซ่อม

source: Sleep
th_th: นอน

source: Get in
th_th: เข้าไป

source: Put in
th_th: ใส่

source: Knock Out
th_th: หมดสติ

source: Set Free
th_th: ปล่อยให้เป็นอิสระ

source: Break Out
th_th: แหกคุก

source: Corpse Disposal
th_th: ทิ้งศพ

source: Man Turret
th_th: ป้อมปราการที่ใช้คน

source: Smash
th_th: ทุบ

source: Capture
th_th: จับ

source: Use Tools
th_th: ใช้อุปกรณ์

source: Use Strength
th_th: ใช้กำลัง

source: Stealth Kill
th_th: สังหาร

source: Stealth KO
th_th: ทำให้สลบ

source: Shoot At
th_th: ยิงที่

source: Stand Up
th_th: ยืนขึ้น

source: Your selected character is unconscious
th_th: ตัวละครที่เจ้าเลือกไม่รู้สึกตัว

source: Target:
th_th: เป้าหมาย:

source: Problem: Crafting stations incapable of making this item.
th_th: พบปัญหา: โต๊ะทำงานไม่เหมาะสมในการสร้างไอเท็มนี้.

source: I can't craft anything here with this crappy workbench.
th_th: ข้าไม่สามารถสร้างอะไรจากโต๊ะทำงานห่วยๆแบบนั้นได้หรอกนะ.

source: Do you want to buy this building for c.{1,num}?
th_th: เจ้าต้องการจะซื้อตึกนี้ในราคา c.{1,num}ฆรือไม่?

source: Can't afford to buy this building. It costs c.{1,num}
th_th: ไม่สามารถซื้อตึกนี้ได้ ราคา c.{1,num}

source: Building purchased!
th_th: ซื้ออาคารสำเร็จแล้ว!

source: Mission Complete
th_th: ภารกิจสำเร็จ

source: Mission Failed
th_th: ภารกิจล้มเหลว

source: Options
th_th: ตั้งค่า

source: General
th_th: การตั้งค่าพื้นฐาน

source: Tutorials
th_th: ฝึกสอน

source: Enable/Disable in-game tutorials
th_th: เปิด/ปิด คำแนะนำในเกม

source: Reset Tutorials
th_th: รีเซ็ทคำแนะนำ

source: Auto save
th_th: บันทึกเกมอัติโนมัติ

source: Turns on automatic saves
th_th: เปิดระบบบันทึกเกมอัติโนมัติ

source: Auto save time (minutes)
th_th: เวลาในการบันทึกเกมอัติโนมัติ (นาที)

source: Show character names
th_th: แสดงชื่อตัวละคร

source: Shows the names of your characters on screen, hovering above their heads.
th_th: แสดงชื่อตัวละครบนหน้าจอและบนหัวของตัวละคร.

source: Show movement marker
th_th: แสดงทิศทางการเคลื่อนไหว

source: Shows horrible green marker to show you exactly where you clicked. Useful when you are new to the game, but you should turn them off once you are used to it.
th_th: แสดงเครื่องหมายสีเขียว ที่บอกตำแหน่งที่คลิก มีประโยชน์สำหรับผู้เล่นใหม่ แต่เมื่อชินกับมันแล้วควรปิด.

source: Show rotation marker
th_th: แสดงเครื่องหมายการหมุน

source: Shows horrible green marker to show camera rotation. Useful when you are new to the game, but you should turn them off once you are used to it because it looks horrible.
th_th: แสดงเครื่องหมายสีเขียว ที่บอกการหมุนกล้อง มีประโยชน์สำหรับผู้เล่นใหม่ แต่เมื่อชินกับมันแล้วควรปิด.

source: Edge scrolling
th_th: การเลื่อนขอบ

source: Makes the camera move when you move the mouse pointer to the edge of the screen
th_th: ทำให้กล้องเคลื่อนที่เมื่อเลื่อนเมาส์ไปขอบจอ

source: Language censorship
th_th: เซ็นเซอร์ภาษา

source: Filters out most of the bad language, if you don't like that sort of thing ruining your violent blood-bath and slavery experience.
th_th: จะกรองคำหยาบส่วนมากออกหากไม่ชอบให้มันมารบกวนประสบการณ์ การเล่นของ.

source: Show damage floaters
th_th: แสดงค่าความเสียหายโดยลอยขึ้น

source: Off
th_th: ปิด

source: Simple info
th_th: ข้อมูลเบื้องต้น

source: Full info
th_th: ข้้อมูลเพิ่มเติม
