Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: Affects damage. The Holy Nation prefer them for their advantage when fighting against mechanical enemies. Often considered a thug's weapon in most other cultures, hackers are heavy axe-bladed weapons that do as much blunt damage as chopping damage, relying mainly on brute strength rather than skill. The crude blades don't cause as much bloodloss, so victims tend to get maimed to death instead.
th_th: ผลของความเสียหาย. พวก The Holy Nation ชื่นชอบพวกมันเพื่อความได้เปรียบเมื่อต่อสู้กับศัตรูที่เป็นหุ่นยนต์ บ่อยครั้งที่ถูกวัฒนธรรมต่างๆ มองว่าเป็นอาวุธของพวกอันธพาล ดาบเจาะเกราะเป็นอาวุธขวานหนัก-ดาบที่สร้างความเสียหายแบบทื่อมากพอๆ กับความเสียหายแบบสับ อาศัยความแข็งแกร่งดุจสัตว์ป่าเป็นหลักมากกว่าความสามารถ ใบมีดหยาบไม่ได้ทำให้เสียเลือดมากนัก ดังนั้นผู้ที่ตกเป็นเหยื่อมีแนวโน้มที่จะพิการแทนที่จะตายลง.

source: Affects damage. Most normal people struggle to even lift a full-weight heavy blade, and they require incredible strength and endurance to wield effectively. Beginners struggle with this weapon style and face a hard path ahead. As a result living practitioners are few and many men carry them only for bluff and posturing. The real masters of this weapon however, are men to be feared.
th_th: ผลของความเสียหาย. เหล่าคนธรรมดาส่วนใหญ่ลำบากพอตัว ในการพยายามที่จะยกดาบที่มีนํ้าหนักมากเช่นนี้, ด้วยความที่ต้องการแรงกายมหาศาลและความอดทนอย่างมาก เพื่อใช้ให้ได้เต็มประสิทธิภาพ. มือใหม่นั้นจะลำบากมากกับอาวุธรูปแบบนี้ และต้องเจอเส้นทางที่ยากลำบากรออยู่ข้างหน้า. เป็นผลทำให้ผู้ใช้งานจริงมีน้อย และคนส่วนมากชอบพกไปเพื่อข่มขวัญและวางท่าเเจ้าั้น. ผู้เชี่ยวชาญอาวุธนี้ที่แท้จริงนั้นเป็นบุคคลที่น่าสะพรึงกลัวยิ่งนัก.

source: Affects damage. Blunt weapon damage breaks bones, disables limbs, and temporarily stuns organs. They don't cause much in the way of blood loss so are not usually lethal. Armour is usually designed for protection from blades, so you can often beat through it. A good weapon for the pacifist, or those who like to be different.
th_th: ผลของความเสียหาย. อาวุธทื่อทำให้กระดูกหัก แขนขาใช้การไม่ได้ และสตั๊นอวัยวะภายในชั่วคราว พวกมันไม่ได้ทำให้เสียเลือดมากนัก ดังนั้นมักจะไม่ถึงตาย เกราะส่วนมากมักถูกออกแบบมาเพื่อการปกป้องจากคมมีด ดังนั้นเจ้าจึงสามารถเอาชนะมันได้บ่อยครั้ง อาวุธที่ดีสำหรับผู้รักความสงบหรือผู้ที่ชอบอะไรที่แตกต่าง.

source: Polearms
th_th: อาวุธด้ามยาว

source: Affects damage. An unconventional weapon, polearms have incredible reach and give an advantage when fighting against animals.
th_th: ผลความเสียหาย การใช้อาวุธประเภทด้ามจับยาวที่มีระยะการโจมตีไกล ทำให้ได้เปรียบเมื่อต่อสู้กับคู่ต่อสู้ประเภทสัตว์.

source: Skill at shooting with defensive weapon turrets. Affects accuracy, reload speed, and target acquisition.
th_th: ทักษะในการใช้อาวุธป้อมปืนสำหรับป้องกัน ส่งผลต่อความแม่นยำ, ความเร็วในการบรรจุกระสุนและการโดนเป้าหมาย.

source: Skill at shooting with crossbows. Affects accuracy, reload speed, and target acquisition.
th_th: ทักษะในการใช้หน้าไม้ ส่งผลต่อความแม่นยำ,ความเร็วในการบรรจุลูกกระสุน และการโดนเป้าหมาย.

source: Melee attack
th_th: การโจมตีระยะประชิด

source: This is your general skill in melee combat. It governs your chance to successfully land a hit on your opponent, and is essential whatever weapon you choose to master.
th_th: นี่คือทักษะการโจมตีแบบประชิดตัวของเจ้า, มันคือตัวบังคับว่าการโจมตีของเจ้าจะมีโอกาศโดนคู่ต่อสู้หรือไม่, และเป็นทักษะสำคัญ ไม่ว่าเจ้าจะเลือกอาวุรประเภทไหนก็ตาม.

source: Melee defence
th_th: การป้องกันระยะประชิด

source: This is your ability to perceive and defend against attacks from opponents. By increasing this skill, you will successfully block more attacks when using a sword. A balanced swordsman would keep this skill similar to his Melee Attack level.
th_th: นี่ี่คือความสามารถการรับรู้และป้องกันการโจมตีจากคู่ต่อสู้, โดยการเพิ่มทักษะนี้, เจ้าจะสามารถบล็อกการโจมตีได้มากกว่าเดิมเมื่อใช้อาวุร, นักดาบที่สมดุลควรมีทักษะนี้ไกล้เคียงกันกับทักษะการโจมตีแบบประชิด.

source: A rare skill in this day and age, warriors only consider it a last resort. At normal skill levels, an unarmed man is always at a huge disadvantage against an armed opponent of similar ability. There are stories however, of high-level martial arts masters who can match any master swordsman in combat with just their bare hands. Physical conditioning is an important factor for a martial artist.
th_th: ทักษะที่หาผู้ใช้ได้ยากในปัจจุบัน ในระดับของผู้ฝึกฝนทั่วๆไป ผู้ใช้การต่อสู้มือเปล่ามักจะเสียเปรียบเป็นอย่างมาก เมื่อต้องต่อสู้กับคู่ต่อสู้ที่ใช้อาวุธ แต่ตำนานได้กล่าวไว้ว่า ผู้ใช้ศิลปะการต่อสู้มือเปล่าระดับสูงนั้น พวกเค้าวสามารถที่จะต่อสู้กับผู้ใช้อาวุธผู้เชี่ยวชาญ ได้อย่างสมน้ำสมเนื้อ โดยใช้เพียงแค่มือเปล่าของพวกเค้าเท่านั้นน ทักษะทางด้านกายภาพเป็นส่วนสำคัญของผู้ฝึกฝนศิลปะการต่อสู้มือเปล่า.

source: Dodge
th_th: หลบหลีก

source: The ability to evade attacks without blocking. You need to stay light and fast. If you are encumbered with heavy equipment you won't be able to dodge, or learn anything.
th_th: ทักษะที่จะช่วยให้เจ้าหลบการโจมตีได้โดยไม่ต้องป้องกัน เจ้าจำเป็นต้องตัวเบาและรวดเร็ว หากเจ้ามีอุปกรณ์หนักระเกะระกะ เจ้าจะไม่สามารถหลบหรือเรียนรู้มันได้.

source: Precision shooting
th_th: ยิงแม่นยำ

source: When using ranged weapons, this is your ability to avoid accidentally shooting your allies. Nothing worse than acidentally getting shot in the back by your own friends. It's adversely affected when you have injuries, however.
th_th: เมื่อใช้งานอาวุธระยะไกล, ทักษะนี้จะช่วยให้หลีกเลี่ยงการโจมตีพวกเดียวกันเองโดยไม่ได้ตั้งใจ. ไม่มีอะไรแย่ไปกว่าการถูกยิงจากข้างหลังด้วยน้ำมือของเพื่อนตัวเองแล้วละ. อย่างไรก็ตามทักษะนี้จะแสดงผลลดลงเมื่อเจ้าได้รับบาดเจ็บ.

source: The ability to move around undetected. Enables you to sneak around, steal things and pick locks without anybody noticing. Also invaluable for escaping hostile imprisonment. Breaking out of a cage is all well and good, but you won't get much further without stealth. Much more effective in the darkness. Injuries will hinder your effective stealthiness, although your toughness level can counteract this.
th_th: ความสามารถที่จะทำให้เจ้าเดินไปไหนมาไหนได้โดยไม่โดนตรวจเจอ อนุญาตให้เจ้าย่องไปรอบๆ ขโมยของและปลดล็อคสิ่งต่างๆ โดยไม่มีใครเห็น อีกทั้งยังมีค่าสำหรับใช้หลบหนีจากการจองจำของศัตรู การแหกกรงอาจเป็นเรื่องที่เยี่ยมและยอด แต่เจ้าจะไปไม่ได้ไกลกว่านี้หากไม่มีลอบเร้น ยิ่งตกดึกยิ่งมีประสิทธิภาพ การบาดเจ็บจะทำให้ประสิทธิภาพการลอบเร้นลดลง แม้ระดับความทนทานของเจ้าจะต้านมันได้ก็ตาม.

source: The ability to pick locks, open doors and safes. More importantly however, it's also used to break OUT of situations: cages, jails, handcuffs. It's for those who value freedom and don't wait around to be rescued.
th_th: ความสามารถในการสะเดาะกลอน, เปิดประตูและตู้เซฟ. ที่สำคัญกว่านั้น มันใช้ในการหนีจากสถานการณ์เลวร้าย: คุก, กุญแจมือ. เป็นทักษะสำหรับคนที่เห็นเจ้าค่าในอิสรภาพ และไม่ต้องการรอคอยความช่วยเหลือ.

source: The ability to steal things from containers, safes, storage boxes and people.
th_th: ความสามารถในการขโมยของจากตู้คอนเทนเนอร์, ตู้เซฟ, กล่องเก็บของและคน.

source: If you are in stealth mode you can sneak up behind people and knock them out. This skill determines how long they stay unconscious for.
th_th: ถ้าเจ้าอยู่ในโหมดซ่อนตัวเจ้าสามารถย่องไปข้างหลังคนและทำให้สลบได้. ทักษะนี้จะกำหนดว่าทำให้สลบได้นานแค่ไหน.

source: This is your ability to run faster. Very useful for thieves, scouts and assassins. It is improved by doing lots of running, at full speed, without encumbrance from a heavy inventory.
th_th: นี่คือความสามารถในการวิ่งเร็ว. มีประโยชน์มากสำหรับโจร, หน่วยสอดแนมและนักฆ่า.สามารถพัฒนาให้ดีขึ้นโดยการวิ่งบ่อยๆ, ที่ความเร็วสูงสุด, ปราศจากน้ำหนักถ่วงจากสัมภาระหนักๆ.

source: This is your ability to swim faster and further without drowning.
th_th: ช่วยให้เจ้าสามารถว่ายน้ำได้เร็วและไกลขึ้นโดยไม่จมน้ำ.

source: Survival
th_th: การอยู่รอด

source: Field medic
th_th: แพทย์สนาม

source: This skill saves lives and allows you to stop bleeding wounds and jury-rig critical injuries, allowing characters to continue fighting when they shouldn't. In the long-term however, major injuries require bed rest. A beginner will not only heal wounds more slowly, but will use up all their medkits really quickly.
th_th: ทักษะในการช่วยชีวิตและห้ามเลือด ทำให้ตัวละครสามารถสู้ต่อในสภาวะที่ย่ำแย่ได้ แต่อาการสาหัสจำเป็นต้องรักษาด้วยการนอน และผู้เริ่มต้นไม่เพียงที่จะรักษาได้ช้ากว่า ยังใช้อุปกรณ์ปฐมพยาบาลหมดเร็วมากขี้น.

source: The skill at building and repairing structures.
th_th: ทักษะในการสร้างและซ่อมแซมสิ่งก่อสร้าง.

source: Weapon smith
th_th: ช่างทำอาวุธ

source: The ability to craft higher quality weapons, in a shorter space of time.
th_th: ความสามารถในการสร้างอาวุธที่มีคุณดีขึ้น, ในเวลาที่น้อยลง.

source: Armour smith
th_th: ช่างทำเกราะ

source: The ability to craft higher quality gear and armour, in a shorter space of time.
th_th: ความสามารถในการสร้างชุดเกราะและอุปกรณ์ที่มีคุณดีขึ้น, ในเวลาที่น้อยลง.

source: Crossbow smith
th_th: ช่างทำหน้าไม้

source: The ability to craft higher quality crossbows and bolts, in a shorter space of time.
th_th: ความสามารถในการสร้างหน้าไม้และลูกศรที่มีคุณภาพดีขึ้น, ในเวลาที่น้อยลง.

source: The equivalent of a medical skill for anything or anyone robotic. Used for repairs.
th_th: สิ่งที่คล้ายคลึงในสกิลการรักษาสำหรับใครก็ตามที่เป็นจักรกล นักคือ สกิลการซ่อมแซม.

source: Affects skill at prospecting, and researching new technologies.
th_th: มีผลกับการตรวจสอบทรัพยากรใต้ดิน และวิจัยเทคโนโลยีต่างๆ.

source: Skill at general manual labour work such as mining and using simple machinery.
th_th: ความสามารถแรงงาน เพิ่มความเร็วในการใช้เครื่องจักรพื้นฐานและขุดทรัพยากร.

source: Knowledge of farming crops. This not only affects the speed that you can gather your crops, it also affects the yield when harvesting. In other words, unskilled farmers will mess up some of your crops.
th_th: ความรูทางการเกษตร สิ่งนี้จะมีผลต่อความเร็วและผลสำเร็จในการเก็บเกี่ยวของพืชผลเช่นกัน ความสามารถนี้ถ้ามีน้อยจะทำให้พืชผลเสียหายขณะเก็บเกี่ยว.

source: Skill at cooking food and brewing drinks.
th_th: ทักษะในการทำอาหารและหมักเหล้า.

source: Primary Weapon Damage
th_th: ค่าความเสียหายของอาวุุธหลัก

source: Primary Weapon Speed
th_th: ความเร็วของอาวุุธหลัก

source: Secondary Weapon Damage
th_th: ค่าความเสียหายของอาวุธสำรอง

source: Secondary Weapon Speed
th_th: ความเร็วของอาวุธสำรอง

source: Max Carry Weight
th_th: น้ำหนักการแบกของ

source: Strength XP Carry
th_th: XP การแบกสิ่งของ

source: Strength XP Combat
th_th: XP การต่อสู้

source: Heavy weapon speed
th_th: ความเร็วของอาวุธหนัก

source: Damage Resistance
th_th: ต้านทานการโจมตี

source: Toughness XP
th_th: XP ความอดทน

source: Knockout time
th_th: ระยะเวลาสลบ

source: KO Threshold
th_th: ขีดจำกัดก่อนการสลบ

source: Wounding Degeneration
th_th: ความเสื่อมสภาพของบาดแผล

source: Max Run Speed
th_th: ความเร็ววิ่งสูงสุด

source: Current Run Speed
th_th: ความเร็ววิ่งขณะนี้

source: Athletics XP
th_th: XP วิ่ง

source: Turret Accuracy
th_th: ความแม่นยำป้อม

source: Turret Rate of fire
th_th: อัตรายิงป้อม

source: Friendly Fire Risk
th_th: ความเสี่ยงต่อการยิงเพื่อน

source: Build Speed
th_th: ความเร็วในการสร้าง

source: Repair Speed
th_th: ความเร็วในการซ่อม

source: Mining
th_th: การทำเหมือง

source: Using machinery
th_th: การใช้เครื่องจักร

source: Weapons
th_th: อาวุธ

source: Combat
th_th: ต่อสู้

source: Sciences
th_th: วิทยาศาสตร์

source: Trades
th_th: การค้า

source: Primary weapon
th_th: อาวุธหลัก

source: Secondary weapon
th_th: อาวุธรอง

source: Residents max:
th_th: ผู้อยู่อาศัยสูงสุด:

source: Actual Num Residents:
th_th: จำนวนผู้อยู่อาศัยจริง:

source: Roaming currentMax/desiredMax:
th_th: การสัญจรปัจจุบันสูงสุด/ความต้องการสูงสุด:

source: Roaming Population:
th_th: การสัญจรของประชากร:

source: Num Roaming Squads:
th_th: จำนวนกลุ่มที่กำลังสัญจร:

source: Continue
th_th: เล่นต่อ

source: New game
th_th: เริ่มเกมใหม่

source: Credits
th_th: เครดิต

source: Begin
th_th: เริ่ม

source: Choose your beginning
th_th: เลือกการเริ่มต้นของเจ้า

source: Difficulty:
th_th: ระดับความยาก:

source: Cash:
th_th: เงิน:

source: Play Style:
th_th: รูปแบบการเล่น:

source: Hunger time
th_th: เวลาหิว

source: This sets how long it takes characters to get hungry. A higher number means it takes longer, therefore they need less food to get by.
th_th: การตั้งค่านี้คือระยะเวลาที่ทำให้ตัวละครหิว. ปรับเพิ่มขึ้นหมายถึงใช้เวลานานขึ้น, ดังนั้นพวกเขาจึงต้องการอาหารน้อยลง.

source: Chance of death
th_th: โอกาศเสียชีวิต

source: Determines the overall likelyhood of any character dying (players or NPCs). Directly affects rates of wound degeneration and blood loss (Higher=more likely to die)
th_th: กำหนดโอกาศที่จะเสียชีวิตของตัวละคร (ผู้เล่น หรือ NPC). ส่งผลต่ออาการบาดเจ็บและการเสียเลือด (เพิ่ม=โอกาศตายง่ายขึ้น)

source: Global damage multiplier
th_th: ตัวคูณความเสียหายทั่วไป

source: Overall combat damage for everything. Doesn't necessarily make the game harder or easier, but affects the speed of battles
th_th: ความเสียหายโดยรวมที่เกิดขึ้นในการต่อสู้ ไม่ได้ส่งผลต่อความยาก/ง่ายในเกม แต่จะส่งผลต่อเวลาที่ใช้ในการต่อสู้

source: Production speed
th_th: ความเร็วในการผลิต

source: Affects speed of item production such as mines and crafting (more than 1.0 == easier)
th_th: ส่งผลต่อความเร็วในการผลิตของเช่น เหมืองและการสร้างของ (มากกว่า 1.0 = เร็วขึ้น)

source: Research speed
th_th: ความเร็วในการวิจัย

source: Affects speed of research (more than 1.0 == easier)
th_th: ส่งผลต่อความเร็วในการวิจัย (มากกว่า 1.0 = เร็วขึ้น)

source: Building speed
th_th: ความเร็วในการก่อสร้าง

source: Affects speed of building (more than 1.0 == easier)
th_th: ส่งผลต่อความเร็วในการก่อสร้าง (มากกว่า 1.0 = เร็วขึ้น)

source: Number of nests multiplier
th_th: คูณจำนวนของรัง

source: Affects number of animal nests, bandit camps etc that appear in the wilds. Higher number makes life more dangerous.
th_th: ส่งผลต่อการเพิ่มจำนวนฝูงสัตว์, ค่ายโจร ฯลฯ ที่ปรากฏในป่า. ทำให้ชีวิตอันตรายมากขึ้น.

source: Bandits loot the player
th_th: โจรปล้นผู้เล่น

source: Makes life unfair
th_th: ทำให้การดำรงชีวิตไม่ยุติธรรม

source: Easy prospecting
th_th: หาแร่ง่ายขึ้น

source: Resume
th_th: ต่อ

source: Are you sure you want to exit?
th_th: เจ้าแน่ใจนะว่าจะออกหรือไม่?

source: Loading
th_th: กำลังโหลด

source: Relations:
th_th: ความสัมพันธ์:

source: Residents:
th_th: ผู้พักอาศัย:

source: Hostile Occupiers:
th_th: เจ้าของพื้นที่มีนิสัยดุร้าย:

source: Residents
th_th: ผู้ที่อาศัยอยู่

source: Discovered {1}
th_th: ค้นพบ {1}

source: {1} has been wiped out
th_th: {1} ได้ถูกกำจัดทั้งหมด

source: Alarm raised
th_th: สัญญานเตือนภัยทำงาน

source: Mode
th_th: โหมด

source: Move
th_th: เคลื่อนที่

source: Axis
th_th: แกน

source: Global
th_th: ทั่วโลก

source: Reset the current transform to default values. Snaps to the ground if in movement mode.
th_th: ตั้งค่าการเปลี่ยนแปลงใหม่ เป็น ค่าเริ่มต้น. Snaps to the ground if in movement mode.

source: Revert
th_th: ย้อนกลับ

source: Clean any changes the active mod made to this object
th_th: ล้างทุกการเปลี่ยนแปลง ที่ใช้งาน Mod ทำกับวัตถุนี้

source: Position
th_th: ตำแหน่ง

source: Orientation
th_th: การปรับตัว

source: Scale
th_th: อัตราส่วน

source: X
th_th: แกน X

source: Y
th_th: "แกน Y "

source: Z
th_th: แกน Z

source: Yaw
th_th: หมุนรอบแกน Z

source: Pitch
th_th: หมุุนรอบแกน Y

source: Roll
th_th: หมุนรอบแกน X

source: Scale X
th_th: อัตราส่วนแกน X

source: Scale Y
th_th: อัตราส่วนแกน Y

source: Scale Z
th_th: อัตราส่วนแกน Z

source: Parent
th_th: ผู้ปกครอง

source: Local
th_th: พื้นถิ่น

source: {1} has redirected to {2}
th_th: {1} ได้เปลี่ยนเส้นทางไปยัง {2}

source: {1} against {2} has ended
th_th: {1} กับ {2} ได้สิ้นสุดลงแล้ว

source: {1} against {2} has been defeated
th_th: {1} กับ {2} ได้พ่ายแพ้

source: {1} to {2} has failed
th_th: {1} ที่ {2} ล้มเหลว

source: {1} was defeated on their way to {2}
th_th: {1} ถูกกำราบลงระหว่างทางไปยัง {2}

source: Assault to {1} canceled due to faction weakness
th_th: การโจมตี {1} ถูกยกเลิก เนื่องจากความอ่อนแอของ faction

source: Warning: {1} moving towards {2}
th_th: คำเตือน: {1} เคลื่อนที่ไปยัง {2}

source: {1} on the way to {2}
th_th: {1} กำลังไปยัง {2}

source: Iron
th_th: เหล็ก

source: Stone
th_th: หิน

source: Copper
th_th: ทองแดง

source: Carbon
th_th: คาร์บอน

source: Water
th_th: น้ำ

source: Fertility
th_th: ความอุดมสมบูรณ์

source: Nameless
th_th: นิรนาม

source: Prototype
th_th: ต้นแบบ (Prototype)

source: Shoddy
th_th: ต่ำ (Shoddy)

source: Standard
th_th: มาตรฐาน (Standard)

source: Specialist
th_th: พิเศษ (Specialist)

source: Masterwork
th_th: ผลงานชิ้นเอก (Masterwork)

source: Non-Standard
th_th: ไม่ได้มาตรฐาน (Non-Standard)

source: Head size
th_th: ขนาดหัว

source: Head shape
th_th: สัดส่วนหัว

source: Neck
th_th: คอ

source: Neck width
th_th: ความกว้างคอ

source: Neck length
th_th: ความยาวคอ

source: Jaw
th_th: กราม

source: Cheekbones
th_th: โหนกแก้ม

source: Mouth size
th_th: ขนาดปาก

source: Mouth width
th_th: ความกว้างปาก

source: Nose width
th_th: ความกว้างจมูก

source: Nose length
th_th: ความยาวจมูก

source: Nose arch
th_th: ดั้งจมูก

source: Nose position
th_th: ตำแหน่งจมูก

source: Nose tilt
th_th: ความเอียงจมูก

source: Brow position
th_th: ตำแหน่งคิ้ว

source: Brow tilt
th_th: ความเอียงของคิ้ว

source: Eyes depth
th_th: ความลึกตา

source: Eyes narrow
th_th: ตาแคบ

source: Eyes closeness
th_th: ตาชิด

source: Eyes tilt
th_th: ตาเอียง

source: Eyes height
th_th: ความสูงตา

source: Eyes size
th_th: ขนาดตา

source: Chin depth
th_th: คางลึก

source: Height
th_th: ส่วนสูง

source: Frame
th_th: รูปร่าง

source: Posture
th_th: บุคลิก

source: Shoulder set
th_th: ความสูงไหล่

source: Neck position
th_th: ตำแหน่งคอ

source: Leg length
th_th: ความยาวขา

source: Shoulders
th_th: ไหล่

source: Arm bulk
th_th: ขนาดแขน

source: Hands
th_th: มือ

source: Chest
th_th: หน้าอก

source: Stomach
th_th: ท้อง

source: Waist
th_th: เอว

source: Hips
th_th: สะโพก

source: Legs bulk
th_th: ขนาดขา

source: Legs shape
th_th: สัดส่วนขา

source: Feet
th_th: เท้า

source: Skin Tone
th_th: สีผิว

source: Horns curve
th_th: ความโค้งของเขา

source: Horns top length
th_th: ความยาวเขาด้านบน

source: Horns bottom length
th_th: ความยาวเขาด้านล่าง

source: Horn thickness
th_th: ความหนาของเขา

source: Horns body length
th_th: ความยาวของเขา

source: Cheeks
th_th: แก้ม

source: Chin
th_th: คาง

source: Chin height
th_th: ความกว้างคาง

source: Chin width
th_th: ความสูงคาง

source: Horns thickness
th_th: ความหนาของเขา

source: Breast size
th_th: ขนาดหน้าอก

source: Breast height
th_th: ความสูงหน้าอก

source: Breast spacing
th_th: ความห่างของหน้าอก

source: Eyes shallowness
th_th: ความลึกดวงตา

source: Eyes narrowness
th_th: ความกว้างดวงตา

source: Antenna length
th_th: ความยาวหนวด

source: Horns length
th_th: ความยาวเขา

source: Jaw width
th_th: ความยาวกราม

source: Face arch
th_th: ความโค้งของใบหน้า
