Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: You can also often buy destroyed buildings for a cheaper rate. You must then repair the building before it can be used.
th_th: เจ้าสามารถซื้อสิ่งก่อสร้างที่พังทลายได้ในราคาที่ถูก แต่เจ้าจำเป็นต้องซ่อมมันก่อนจึงจะสามารถใช้งานได้.

source: Next, you'll need to select tech to research. Select TEC from the panel.
th_th: ขั้นต่อไป เจ้าต้องเลือกเทคโนโลยีที่อยากจะวิจัย เลือก TEC จากแถบเครื่องมือ.

source: How to research tech (Researching)
th_th: วิธีวิจัยเทคโนโลยี (การวิจัย)

source: To learn new tech you can buy blueprints from merchants. Or, you can research new tech yourself.
th_th: เรียนรู้สิ่งต่างๆโดยการซื้อพิมพ์เขียวจากพ่อค้า หรือวิจัยด้วยตัวเอง.

source: To research, you must have a scientist assigned to your Research Bench. Select a squad member, hold and right click on your Research Bench and select Use Machine. Research speed will depend on your assigned scientist's Science skill stat.
th_th: เพื่อวิจัย , เจ้าต้องมีนักวิทยาศาสตร์ที่ได้รับมอบหมายงานในการวิจัย , เลือกสมาชิกหน่วย, คลิกขวาค้างไว้ที่โต๊ะวิจัยและเลือกใช้งานเครื่องจักร.ความเร็วการวิจัยขึ้นอยู่กับความสามารถของนักวิทยาศาสตร์.

source: Select any tech you want to research by left clicking it. You can queue up as many as you want.
th_th: เลือกเทคโนโลยีอันก็ได้ตราบใดที่เจ้าต้องการจะวิจัยมัน โดยคลิ๊กซ้าย. เจ้าสามารถเข้าคิวการวิจัยมากเท่าใดก็ตามที่เจ้าต้องการเถิด.

source: How to research tech (Blueprints)
th_th: วิธีการวิจัย (พิมพ์เขียว)

source: You found a blueprint
th_th: เจ้าได้เจอพิมพ์เขียว

source: Blueprints allow you to learn Tech instantly. To learn a blueprint, open your inventory and right click it to learn it.
th_th: พิมพ์เขียวจะช่วยให้เจ้าได้เรียนรู้เทคได้ทันที. เพื่อเรียนรู้พิมพ์เขียว,เปิดสัมภาระของเจ้าและเพียงคลิกขวาเพื่อเรียนรู้มัน.

source: If you are wearing a backpack, make sure to close it first so that the blueprint doesn't switch between your inventory when you try to use it.
th_th: ถ้าเจ้าสวมใส่กระเป๋าสัมภาระอยู่, โปรดจงแน่ใจว่าได้ปิดกระเป๋าแล้ว เพื่อที่พิมพ์เขียวจะได้ไม่สลับที่ เมื่อเจ้าพยายามจะใช้มัน.

source: First, select a building you want to construct from the panel. Hint: Building a small shack will allow you to build a Research Bench inside, with this you can learn and unlock new tech.
th_th: ขั้นแรก เลือกสิ่งก่อสร้างที่ต้องการจะสร้างจากแถบเครื่องมือนี้. แนะนำ : สร้างกระต๊อบจะทำให้เจ้าสร้างโต๊ะวิจัยข้างใน เจ้าจะเรียนรู้และปลดล็อกสิ่งใหม่ได้.

source: Welcome to Build mode
th_th: ยินดีต้อนรับสู่โหมดสร้าง

source: Next, choose where to place the building on the terrain. If the building shows red, there is an obstruction and you cannot place it. If blue, you're too close to another town. If green, you're good to go!
th_th: ต่อไป เลือกตำแหน่งที่จะวางสิ่งก่อสร้างลงบนพื้น ถ้าเป็นสีแดงแสดงว่ามีอะไรขวางทางอยู่และจะวางไม่ได้ ถ้าเป็นสีฟ้าหมายถึงใกล้เมืองอื่นมากเกินไป ถ้าเป็นสีเขียวก็ลุยเลย!

source: To rotate the position of the building, use the < and > keys. Once you're happy, left click to place the building and hit the Confirm button.
th_th: หมุนตำแหน่งสิ่งก่อสร้าง, ใช้ปุ่ม < และ > . เมื่อเจ้ารู้สึกพอใจ กดคลิกซ้ายเพื่อวาง และกดปุ่มยืนยัน.

source: Select squad members and right click the construction to begin adding materialsif they have them.
th_th: เลือกลูกทีมและคลิกขวาที่การก่อสร้าง เพื่อเริ่มเติมวัสดุ ถ้าพวกเขามี.

source: Construction will be much quicker depending on the number of people who are assigned, and their Engineer skill stats.
th_th: ความเร็วในการก่อสร้างขึ้นอยู่กับจำนวนคนที่ช่วยกันสร้างและค่าสถานะ Enigineer.

source: This shows how many building materials are needed to complete the construction.
th_th: นี่จะแสดงจำนวนวัสดุที่ต้องใช้สร้างสิ่งก่อสร้างจนเสร็จ.

source: Once the Condition bar is filled, the construction is complete and ready to use.
th_th: ถ้าแถบเงื่อนไขถูกเติม สิ่งก่อสร้างจะเสร็จและพร้อมใช้งาน.

source: Building (Construction)
th_th: อาคาร (การก่อสร้าง)

source: Select your construction to check it's status.
th_th: เลือกการก่อสร้างของเจ้าเพื่อดูสถานะ.

source: The prospecting window tells you information about the resources in the current area.
th_th: หน้าต่างนี้บอกข้อมูลเกี่ยวกับทรัพยากรในสถานที่นี้.

source: The top section is information at the point the character is standing. The lower section is a map of the resources in the vicinity. You can select the resource type that is shown on the map. Characters with a higher science skill will be able to detect resources from farther away.
th_th: ส่วนของด้านบนแสดงข้อมูลที่จุดที่ตัวละครกำลังยืนอยู่. ส่วนของด้านล่างคือแผนที่ของทรัพยากรในบริเวณไกล้เคียง. เจ้าเลือกประเภทของทรัพยากรที่แสดงอยู่บนแผนที่ได้. ตัวละครที่มีค่านักวิทยาศาสตร์สูงจะมองเห็นทรัพยากรที่อยู่ไกลออกไป.

source: Missing a limb
th_th: แขน/ขา​ ขาด

source: You appear to be missing a limb. Limbs are useful things to have so you may want to get that replaced. You can buy various robotic limbs from robotics vendors.
th_th: เหมือน​แขนขา​เจ้าจะหายไป. แขนและขาเป็น​สิ่งจำเป็น​ที่ต้องมีไว้ เว้นแต่ว่าเจ้าต้องการ​หาอะไรมาใช้แทน. เจ้าสามารถ​ซื้อแขนขาหุ่นยนต์​หลายๆแบบได้จากผู้ขายหุ่นยนต์​.

source: Install new limbs using the robotics window availiable from the character's inventory. Robotic limbs require skeleton repair kits to fix. The maximum health of the limb will also degrade as it takes damage but it can be restored to its full health in a skeleton repair bed.
th_th: ติด​ตั้ง​แขนขาใหม่​จะใช้หน้าต่าง​หุ่นยนต์​ที่ปรากฏ​ในช่องเก็บของ​. แขนขาหุ่นยนต์​ต้องการ​ Repair​ Kit เพื่อ​ทำการซ่อมแซม​. ค่าความแข็ง​แกร่ง​สูงสุด​ของแขนขา​หุ่นยนต์​จะลดลง​หากได้รับ​ความเสียหาย​ แต่สามารถ​ซ่อมแซม​กลับมา​เป็น​เหมือนเดิม​ได้ด้วย Skeleton Repair​ bed.

source: Error: Character model for race '{1}' not found
th_th: ข้อผิดพลาด: ไม่พบโมเดลตัวละครสำหรับเผ่า '{1}'

source: Editor problem
th_th: ข้อผิดพลาดโปรแกรมแก้ไข

source: Editor values missing for the race '{1}'
th_th: ไม่พบค่าสำหรับเผ่า '{1}' ในโปรแกรมแก้ไข

source: Editor values missing for the race '{1}' for both genders.
th_th: ไม่พบค่าสำหรับเผ่า '{1}' ในโปรแกรมแก้ไขสำหรับทั้งสองเพศ.

source: Editor values missing for the race '{1}' for gender: {2}.
th_th: ไม่พบค่าสำหรับเผ่า '{1}' สำหรับเพศ: {2}.ในโปรแกรมแก้ไข.

source: You cannot delete this building while there are still items in its inventory. Precious research artifacts and stuff, don't lose them.
th_th: เจ้าไม่สามารถลบตึกนี้ในขณะที่ยังมีไอเท็มเหลืออยู่ภายในตึก. การวิจัยศิลปวัตถุและสิ่งของนั้นสำคัญมาก, อย่าลืมซะล่ะ.

source: There are still items in the inventory, they will be lost. Are you sure you want to destroy this building?
th_th: ยังมีไอเท็มอยู่ในช่องเก็บของ, มันอาจหายได้. เจ้าแน่ใจนะว่าเจ้าต้องการจะทำลายอาคารนี้?

source: You cannot delete this building while it has mounted buildings.
th_th: เจ้าไม่สามารถลบสิ่งก่อสร้างนี้ได้ขณะที่มีคนอยู่ภายในสิ่งก่อสร้างนี้.

source: Dismantle
th_th: แยกส่วน

source: Dismantling this building will destroy all furniture. Do you want to continue?
th_th: การแยกส่วนตึกนี้จะทำลายเฟอร์นิเจอร์. เจ้าต้องการจะทำต่อหรือไม่?

source: Are you sure?
th_th: แน่ใจไหม?

source: Building '{1}' construction complete at '{2}'.
th_th: ก่อสร้าง '{1}' สิ่งก่อสร้างเสร็จสมบูรณ์ที่ '{2}'.

source: Building '{1}' construction complete.
th_th: สิ่งก่อสร้าง '{1}' เสร็จสมบูรณ์.

source: Building construction complete
th_th: สิ่งก่อสร้างเสร็จสมบูรณ์

source: Contract with
th_th: ติดต่อกับ

source: has been terminated.
th_th: ถูกกำจัด.

source: has ended.
th_th: สิ้นสุดแล้ว.

source: Bodyguard Contract
th_th: สัญญาการคุ้มกัน

source: -Protecting:
th_th: -เป้าหมายคุ้มกัน:

source: -Expires in:
th_th: -สิ้นสุดใน:

source: Base Defence Contract
th_th: สัญญาการคุ้มกัน

source: {1} squad has been removed from {2}
th_th: {1} กลุ่มได้ถูกแยกออกจาก {2}

source: {1} has been enslaved
th_th: {1} ถูกจับเป็นทาส

source: I don't have any materials
th_th: ข้าไม่มีวัสดุเลย

source: I need a medkit.
th_th: ข้าต้องการชุดปฐมพยาบาล.

source: My legs are messed up.
th_th: ขาของข้าเลอะ.

source: I need a repair kit.
th_th: ข้าต้องการชุดเครื่องมือซ่อม.

source: I don't have any tools
th_th: ข้าไม่มีเครื่องมือเลย

source: My arms are messed up...
th_th: แขนข้าเละไม่เหลือชิ้นดี...

source: I'm not skilled enough...
th_th: ข้ามีทักษะไม่เพียงพอ...

source: My arm is messed up too badly.
th_th: แขนของข้าเริ่มจะไม่ดี.

source: It's locked.
th_th: มันล็อค.

source: I can't get out of here.
th_th: ข้าออกไปจากที่นี่ไม่ได้.

source: I can't get there.
th_th: ข้าไปตรงนั้นไม่ได้.

source: It's empty.
th_th: มันไม่มีอะไรเลย.

source: The machine is full.
th_th: เครื่องจักรช่องเต็ม.

source: It's out of resources.
th_th: ทรัพยากรหมดแล้ว.

source: I don't have space to pick that up!
th_th: ข้าไม่มีพื้นที่ที่จะเก็บของนั่นได้เลย!

source: My arm is messed up too badly to lift anything.
th_th: แขนข้าหักเกินที่จะยกอะไรได้.

source: It needs electricity.
th_th: มันต้องใช้ไฟฟ้า.

source: He's in the water.
th_th: เขาอยู่ในน้ำ.

source: I'm busy swimming.
th_th: ข้ากำลังว่ายน้ำ.

source: Ate {1}
th_th: กิน {1}

source: -Wanted For:
th_th: -เป็นที่ต้องการของ:

source: Bounty:
th_th: ค่าหัว:

source: Waiting to be released
th_th: รอที่จะได้ถูกปล่อยตัว

source: Imprisoned, sentence time remaining:
th_th: ถูกจองจำ, เหลือระยะเวลาที่ได้รับโทษ:

source: {1,num} hr
th_th: {1,num} ชั่วโมง

source: Imprisoned, sentence time:
th_th: ถูกจำคุก, เป็นเวลา:

source: FOREVER
th_th: ตลอดไป

source: This character is wanted by the authorities. Turn them in for a reward.
th_th: ตัวละครนี้ถูกหมายหัวจากผู้ทรงอิทธิพล ส่งตัวเพื่อแลกกับรางวัล.

source: Notorious: The bounty will never expire.
th_th: ชื่อเสียงย่ำแย่: ค่าหัวจะไม่มีวันหมดอายุ.

source: The bounty will expire in {1,num} hr
th_th: ค่าหัวจะหมดเวลาในอีก {1,num} ชั่วโมง

source: This character is not wanted by the local faction
th_th: ตัวละครนี้ไม่ถูกหมายหัวจากกลุ่มท้องถิ่น

source: Total Weight:
th_th: น้ำหนักรวม :

source: Overloaded
th_th: น้ำหนักเกิน

source: Heavy
th_th: หนัก

source: Moderate
th_th: นํ้าหนักปานกลาง

source: Lightweight
th_th: น้ำหนักเบา

source: Weightless
th_th: ไม่มีน้ำหนัก

source: Money:
th_th: เงิน:

source: Merchant Info:
th_th: ข้อมูลสินค้า:

source: Prices:
th_th: ราคา:

source: Buys Stolen Goods
th_th: ซื้อของโจร

source: Clothing disguise:
th_th: เสื้อสำหรับปลอมตัว:

source: In secure location:
th_th: อยู่ในที่ปลดภัย :

source: Same faction:
th_th: ฝ่ายเดียวกัน :

source: Slave owner recognition:
th_th: ได้รับการยอมรับเป็นเจ้าของทาส:

source: Someone knows me personally:
th_th: บางคนที่รู้จักข้าเป็นการส่วนตัว:

source: Disguise blown:
th_th: การอำพรางที่ถูกเปิดโปง:

source: {1,num} sec
th_th: {1,num} วินาที

source: Total:
th_th: ทั้งหมด:

source: Not currently in disguise.
th_th: ขณะนี้เจ้าไม่ได้ทำการอำพรางตัว.

source: None
th_th: ไม่มี

source: Disguise:
th_th: อำพรางตัว:

source: Blown!
th_th: ถูกเปิดโปง!

source: Slave of:
th_th: ทาสของ:

source: The faction that owns you.
th_th: ฝ่ายนี้ถูกปกครองโดยเจ้า.

source: Clothing:
th_th: เสื้อผ้า:

source: Minimum (Escaping):
th_th: ขั้นต่ำ (ผู้​หลบหนี):

source: Minimum (Ex-Slave):
th_th: ขั้นต่ำ (อดีต​ทาส):

source: How much you look like an escaped slave. Based on how you are dressed/undressed. Wearing shackles and rags is a big giveaway. Try to avoid hanging around too long near people who may recognise you.
th_th: แต่งตัว​แค่ไหนถึง​จะ​ดู​เหมือน​ทาสหลบหนี​ พื้นฐาน​อยู่​ที่​การแต่งตัว​และ​ไม่​แต่ง​ตัว​ จะเป็น​เป้าสายตา​มากหาก​ยังใส่​โซ่ตรวน​และเศษผ้า​ พยายาม​อย่าเข้าใกล้ผู้​คนมากเกินไป​ เพราะอาจจะ​จำเราได้​.

source: Looks like slave:
th_th: ดูเหมือนทาส:

source: You are a free person.
th_th: เจ้าถูกปลดปล่อย.

source: You are no slave.
th_th: เจ้าไม่ใช่ทาส.

source: War Leader
th_th: ผู้นำสงคราม

source: This is the Commander in charge of an entire army.
th_th: นี้คือผู้บัญชาการรับผิดชอบต่อกองทัพทั้งหมด.

source: Leader
th_th: ผู้นำ

source: This is the leader of this group.
th_th: นี่คือผู้นำของกลุ่มนี้.

source: Kidnapped
th_th: ถูกลักพาตัว

source: This character has been kidnapped, law enforcers will try to help
th_th: ตัวละครนี้ถูกลักพาตัว, ผู้บังคับใช้กฎหมายจะลองพยายามหาทางช่วย

source: Diplomatic Status
th_th: สถานะการฑูต

source: This is a special person with diplomatic importance. Anyone who attacks this guy will be in serious trouble with his faction.
th_th: เขาเป็นบุคคล​พิเศษ​ที่มีความสำคัญกับ​การทูต​ ใคร​ก็​ตามที่โจมตี​เค้าคนนี้จะเจอปัญหาร้ายแรงกับสมาพันธ์​ของเขา.

source: someone
th_th: บางคน

source: Seen!
th_th: เห็น!

source: Undiscovered
th_th: ยังไม่ถูกค้นพบ

source: Situation:
th_th: สถานการณ์:

source: Looks like a slave:
th_th: เหลือเวลา:

source: Time remaining:
th_th: เวลาที่เหลืออยู่ :

source: {1,num} hour
th_th: {1,num} ชั่วโมง

source: Escaped slave
th_th: ทาสที่หลบหนี

source: Keep your [Looks Like A Slave] level as low as possible, wear clothing or disguises and find a plastic surgeon to restore your hair. Don't get spotted.
th_th: พยายามทำให้ค่า[Looks Like A Slave]ให้ต่ำที่สุดเท่าที่จะเป็นไปได้ ใส่เสื้อผ้าหรือปลอมตัว และหาหมอศัลยกรรมเพื่อปลูกผม อย่าให้ถูกจับได้.

source: A slave of {1} that has been seen escaping. Needs to lay low for a day and avoid getting spotted. {2}
th_th: ทาสของ {1} ถูกพบเห็นกำลังหลบหนี. ต้องหาที่หลบซ่อน และ เลี่ยงถูกพบเห็น.{2}

source: Ex-slave
th_th: เคยเป็นทาส

source: Keep your [Looks Like A Slave] level as low as possible, wear clothing or disguises and find a plastic surgeon to restore your hair. You should be safe if you stay out of towns.
th_th: พยายามทำให้ค่า[Looks Like A Slave]ให้ต่ำที่สุดเท่าที่จะเป็นไปได้ ใส่เสื้อผ้าหรือปลอมตัว และหาหมอศัลยกรรมเพื่อปลูกผม อยู่ให้ห่างเมืองไว้แล้วจะปลอดภัย.

source: Was once a slave of {1} but has now escaped. The heat has died down but he still needs to avoid getting found out. {2}
th_th: ครั้งหนึ่งเคยเป็นทาสของ {1} แต่บัดนี้ได้หลบหนี. เหตุการณ์ได้สงบลงแล้วแต่เขายังต้องการหลีกเลี่ยงการที่จะถูกพบเจอ.{2}

source: Slave
th_th: ทาส

source: Your character will have a permanent job assigned called [Obedient slave]. While this is active he will automatically work for his master. You can remove this job, but beware of the consequences...
th_th: ตัวละครของได้อาชีพ[ทาสที่เชื่อฟัง]ถาวร. ในขณะที่อาชีพนี้กำลังทำงาน ตัวละครนี้จะทำงานให้กับเจ้านายของเขา เจ้าสามารถยกเลิกงานได้ แต่ระวังผลที่ตามมา.

source: A slave belonging to {1}. Not considered a person with rights, a slave works for his master until death and nothing more. {2}
th_th: ทาสซึ่งเป็นของ {1}. จะไม่ถูกพิจารณาเป็นตัวบุคคลที่มีสิทธิ , ทาสจะทำงานเพื่อเจ้านายจนกว่าจะตายไม่มากไม่น้อยไปกว่านั้น. {2}

source: Committing Crime!
th_th: กำลังก่ออาชญากรรม!

source: This character is currently committing {1}, make sure nobody witnesses it.
th_th: เจ้านี่กำลัง{1} .เช็คให้มั่นใจนะว่าไม่มีใครเห็น.

source: This character has been caught committing {1}! He might end up with a bounty on his head if he can't vanish. Current bounty is c.{2,num}
th_th: เจ้านี่เป็นถูกจับได้ตอนที่กำลัง{1}! มันอาจจะโดนตั้งค่าหัว ถ้าหนีไม่พ้น. ค่าหัวตอนนี้ c.{2,num}

source: This character has been caught committing {1}! He might end up with a bounty on his head if he can't vanish.
th_th: เจ้านี่เป็นถูกจับได้ตอนที่กำลัง{1}! มันอาจจะโดนตั้งค่าหัว ถ้าหนีไม่พ้น.

source: Escaped Prisoner
th_th: นักโทษหลบหนี

source: This character broke out of prison, if he gets spotted by any guards he is in trouble. Leave town to clear this status. Expires in {1}
th_th: เจ้านี่เป็นนักโทษหลบหนี. ถ้ายามเจอละก็ซวยแน่ๆ. ต้องหนีออกจากเมืองเพื่อลบสถาณะนี้. หมดลงใน {1}

source: State:
th_th: สถานะ:

source: Dead
th_th: ตาย

source: This guy is dead and gone.
th_th: เจ้านี้มันตายไปแล้ว.

source: Locked (lvl: {1,num})
th_th: ล็อค (lvl: {1,num})

source: You are locked in a cage. The lock has a difficulty level of {1,num}.
th_th: เจ้าถูกขังอยู่ในกรง. ล๊อคมีระดับความยาก อยู่ที่ {1,num}.

source: (Unlocked...)
th_th: (ปลดล๊อค...)

source: The cage you are in is UNLOCKED. Nobody knows this but you, you can escape any time you want.
th_th: ห้องขังที่อยู่มันไม่ได้ล็อค. ไม่มีใครรู้เรื่องนี้แต่, สามารถหนีไปตอนไหนก็ได้ที่ต้องการ.

source: Unconscious
th_th: หมดสติ

source: Rebooting
th_th: กู้คืนระบบ

source: This guy is unconscious and probably needs medical attention and rest.
th_th: ชายคนนี้หมดสติ และอาจต้องเข้ารับการตรวจรักษา และพักผ่อน.

source: Sleeping...
th_th: กำลังนอน...

source: Defensive
th_th: ป้องกัน

source: In defensive combat mode the character will not even try to attack, focusing entirely on defense for a +20 skill bonus.
th_th: ในโหมดป้องกัน ตัวละครจะไม่พยายามโจมตี จะตั้งใจป้องกันอย่างเดียว การป้องกัน+20.

source: Normal
th_th: ปกติ

source: Goal:
th_th: เป้าหมาย:

source: Current goal of this character.
th_th: เป้้าหมายของตัวละครนี้.

source: Encumbrance:
th_th: น้ำหนัก:

source: Athletics XP:
th_th: XPความ​ว่องไว​:

source: Strength XP:
th_th: XPความ​แข็งแกร่ง:

source: Run Speed Penalty:
th_th: ความเร็ว​การวิ่งลดลง​:

source: Stealth Penalty:
th_th: การซ่อนเร้น​ลดลง​:

source: Accuracy Error:
th_th: การเล็ง​ผิดพลาด​:

source: degrees
th_th: องศา

source: Weapon Accuracy:
th_th: ความแม่นยำอาวุธ:

source: Skill:
th_th: ความสามารถ:

source: Resulting Accuracy Deviation:
th_th: ผลการหักเหความแม่นยำ:

source: Heavy:
th_th: อาวุธหนัก:

source: Katana:
th_th: คาตานะ:

source: Hacker:
th_th: ดาบเจาะเกราะ:

source: Sabre:
th_th: ดาบโค้ง:

source: Martial Arts:
th_th: ศิลปะการต่อสู้:

source: Polearm:
th_th: อาวุธด้ามยาว:

source: Damage:
th_th: ความเสียหาย:

source: Stealth:
th_th: ลอบเร้น:

source: Athletics:
th_th: วิ่ง:

source: Swimming
th_th: ว่ายน้ำ

source: Max Swim Speed:
th_th: ความเร็วว่ายน้ำสูงสุด:

source: Injuries
th_th: บาดเจ็บ

source: Hunger
th_th: ความหิว

source: Encumbrance
th_th: น้ำหนักเกิน

source: 2 Broken Arms!
th_th: แขนหักทั้งสองข้าง!

source: Current Swim Speed:
th_th: ความเร็วว่ายน้ำปัจจุบัน:

source: Imprisoned:
th_th: กักขัง:

source: My arm is broken!
th_th: แขนข้าหัก!

source: I can't carry anyone with this arm.
th_th: ข้าขนอะไรไม่ได้ด้วยแขนนี่.

source: I don't have any building materials.
th_th: ข้าไม่มีวัสดุก่อสร้าง.

source: I don't have a medkit.
th_th: ข้าไม่มีชุดปฐมพยาบาล.

source: I don't have a splint kit.
th_th: ข้าไม่มีอุปกรณ์เข้าเฝือก.

source: {1} can't talk to people
th_th: {1} พูดกับผู้คนไม่ได้

source: I don't have a repair kit.
th_th: ข้าไม่มีชุดเครื่องมือซ่อม.

source: I need to go outside to do this.
th_th: ข้าต้องออกไปข้างนอกเพื่อทำมัน.

source: I need to be stood on solid ground.
th_th: ข้าต้องการยืนบนพื้นแข็งๆ.

source: Import character
th_th: นำเข้าตัวละคร

source: Import
th_th: นำเข้า

source: Randomise
th_th: สุ่ม

source: Reset
th_th: รีเซ็ต

source: Randomise All
th_th: สุ่มทั้งหมด

source: Body
th_th: ร่างกาย

source: Face
th_th: ใบหน้า

source: Hair
th_th: ผม

source: Export
th_th: ส่งออก

source: Clothes
th_th: เสื้อผ้า

source: Confirm
th_th: ยืนยัน

source: Race
th_th: เผ่า

source: Subrace
th_th: เผ่าย่อย

source: Gender
th_th: เพศ

source: Change Character
th_th: เปลี่ยนตัวละคร

source: Race Description
th_th: คำอธิบายเผ่า

source: Race Stats
th_th: ค่าสถานะเผ่า

source: Hit Points:
th_th: พลังชีวิต:

source: No bleeding
th_th: ไม่บาดเจ็บ

source: Error loading appearance file '{1}'. The file is in an old format or invalid.
th_th: เกิดข้อผิดพลาดในการโหลดไฟล์ดังกล่าว '{1}'. รูปแบบไฟล์เก่าหรือไม่ถูกต้อง.

source: Character '{1}' exported to file {2}
th_th: ส่งออกไฟล์ตัวละคร '{1}' ไปยัง {2}

source: Idle stance
th_th: ท่าทาง

source: Beard
th_th: เครา

source: Hair colour
th_th: สีผม

source: Colour
th_th: สี

source: Saturation
th_th: ความอิ่มตัว

source: Brightness
th_th: ความสว่าง

source: Warning
th_th: คำเตือน

source: There are other characters whose appearance haven't been changed. Are you sure you want to continue?
th_th: มีตัวละครบางตัวที่ยังไม่ได้เปลี่ยนชุด. เจ้าแน่ใจนะว่าจะต่อ ?

source: Acid Rain ({1} protection)
th_th: ฝนกรด ({1}ป้องกัน)

source: It is currently raining acid, and you aren't wearing anything to protect your skin. Best to find shelter soon.
th_th: ขณะนี้ฝนกรดกำลังตก และ เจ้าไม่ได้สวมใส่เครื่องป้องกันผิวหนังของเจ้า เจ้าควรที่จะหาสถานที่หลบ.

source: It is currently raining acid, but your gear is providing you with total protection.
th_th: ขณะนี้ฝนกรดกำลังตก แต่เจ้าได้สวมใส่เครื่องป้อนกันไว้เต็มรูปแบบแล้ว.

source: It is currently raining acid, your gear is providing you with {1} protection.
th_th: ขณะนี้ฝนกรดกำลังตก เครื่องป้องกัน {1} ของเจ้าได้ทำการช่วยป้องกันเอาไว้.

source: Acid!
th_th: กรดโว้ย!

source: You are currently submersed in acid, get out of there as soon as you can.
th_th: เจ้ากำลังจมอยู่ในกรด รีบออกมาจากจุดนั้นเดียวนี้!.

source: Feet Burning!
th_th: ตีนไหม้แล้วโว้ย!

source: The ground here is acidic and burns your feet, find some footwear!
th_th: พื้นที่ตรงนี้เป็นกรด เท้าของเจ้ากำลังไหม้ รีบใส่รองเท้าด่วน!

source: Poison Gas ({1} protection)
th_th: แก็สพิษ ({1} ป้องกัน)

source: You are currently breathing in poison gas.
th_th: ขณะนี้เจ้ากำลังสูดดมแก็สพิษ.

source: Your gear is protecting you from breathing in any poisons.
th_th: ชุดป้องกันของเจ้ากำลังป้องกันเจ้าจากการสูดดมแก็สพิษ.

source: You are currently breathing in poison gas, your gear is providing you with {1} protection.
th_th: ขณะนี้เจ้ากำลังสูดดมแก็สพิษ ชุดสวมใส่ของเจ้าได้ทำการช่วยป้องกันเอาไว้ {1}

source: Burning ({1} protection)
th_th: ไหม้ ({1} ป้องกัน)

source: You are currently on fire.
th_th: ท่่านกำลังไหม้.

source: Your gear is protecting you from being horribly burnt.
th_th: ชุุดป้องกันของเจ้ากำลังช่วยป้องกันการถูกเผาสดอย่างอนาถ.

source: You are currently on fire, your gear is providing you with {1} protection.
th_th: ขณะนี้เจ้ากำลังไหม้ ชุดสวมใส่ของเจ้าได้ทำการช่วยป้องกันเอาไว้ {1}

source: Dust Storm ({1} protection)
th_th: พายุทราย ({1} ป้องกัน)

source: You are in a dust storm, it affects your accuracy in combat.
th_th: เจ้ากำลังอยู่ในพายุทราย ซึ่งมีผลต่อความแม่นยำในการต่อสู้.

source: Your gear is protecting you from the storm.
th_th: ชุุดป้องกันของเจ้ากำลังช่วยป้องกันพายุทราย.

source: You are in a dust storm, your gear is providing you with {1} protection.
th_th: ขณะนี้เจ้ากำลังอยู่ในพายุทราย ชุดสวมใส่ของเจ้าได้ทำการช่วยป้องกันเอาไว้ {1}

source: {1} has been eaten alive.
th_th: {1} ถูกจับกินเป็นๆ.

source: Load Error: Character stat was corrupted and fixed: {1}
th_th: Load Error สถานะตัวละคนเสียหาย และ ถูกแก้ไข {1}

source: Beta limitation: Can't go that way.
th_th: เจ้าไม่สามารถผ่านจุดนี้ใน Version Beta ได้.

source: ROBOTICS
th_th: หุ่นยนต์

source: Repeat Queue
th_th: วนซ้ำ

source: Stations
th_th: สถานี

source: Items
th_th: สิ่งของ

source: Queue
th_th: คิว

source: Description
th_th: คำอธิบาย

source: In production...
th_th: กำลังผลิต...

source: Out of resources
th_th: ทรัพยากรหมด

source: Output full
th_th: ผลผลิตเต็ม

source: Upgrade required
th_th: สิ่งนี้ต้องการการอัปเกรด

source: Not assigned to a craft bench
th_th: ไม่ได้เลือกใช้กับ Craft Bench

source: ETA:
th_th: เวลาที่จะมาถึง:

source: -Current Smith:
th_th: -กำลังสร้าง:

source: (skill: {1,num}{2})
th_th: (ทักษะ: {1,num}{2})

source: -Predicted Result:
th_th: -ผลลัพธ์ที่คาดการณ์:

source: -Material Costs:
th_th: -ค่าวัตถุดิบ:

source: -Critical Success Chance:
th_th: -โอกาสในการทำผลลัพธ์สำเร็จแบบเหนือความคาดหมาย:

source: No items available to craft. You need to buy blueprints or research new items to craft them here
th_th: ไม่มีสิ่งของที่ใช้ได้ในการสร้าง ต้องซื้อพิมพ์เขียว หรือ วิจัยสิ่งใหม่เพื่อสร้างมัน

source: Estimated Craft Time:
th_th: เวลาในการสร้างโดยประมาณ:

source: -Materials Cost:
th_th: -ค่่าวัตถุดิบ:

source: -Fabrics Cost:
th_th: -ค่าผ้า:

source: -Materials Costs:
th_th: -ค่่าวัตถุดิบ:

source: Ingredients
th_th: วัตถุดิบ

source: Invalid item!
th_th: ไอเท็มไม่ถูกต้อง!

source: Empty!
th_th: ว่างเปล่า!

source: Failed to learn from blueprint: Technology requirements not met
th_th: เรียนรู้พิมพ์เขียวไม่สำเร็จ : ความต้องการของเทคโนโลยีขั้นต่ำมีไม่ถึงขั้น

source: Research already known
th_th: ผลวิจัยอันนี้ถูกเรียนรู้แล้ว

source: Day: {1,num}
th_th: วัน: {1,num}

source: Selling Slaves
th_th: ค้าทาส

source: Sell
th_th: ขาย

source: Name:
th_th: ชื่อ :

source: WARNING: Character will become a slave!
th_th: ค้ำเตือน : ตัวละครนี้กำลังจะกลายเป็นทาส!

source: Buying Slaves
th_th: ซื้ื้อทาส
