Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: These are the floating text numbers that show the damage when a character is hit. It also shows in brackets the amount of damage that was stopped by armour. [Full Info] will show separate numbers for each damage type.
th_th: นี่คือกล่องข้อความที่จะแสดงค่าความเสียหายเมื่อตัวละครถูกโจมตีและจะวงเล็บไว้ให้ด้วยว่าความเสียหายที่เข้ามานั้นโดนเกราะกันได้ไปเท่าไหร่ [แสดงแบบเต็ม] จะแยกความเสียหายแต่ละแบบออกจากกันให้เห็น.

source: Font Size
th_th: ขนาดตัวอักษร

source: Civilians in towns (requires restart/import)
th_th: "ประชาชนในเมือง(จำเป็นต้องรีสตาร์ท/นำเข้า) "

source: This will simply prevent some of the less useful civilian NPCs from spawning in towns. Use to improve performance slightly.
th_th: คำสั่งนี้จะป้องกันไม่ให้ NPC ที่ไม่สำคัญเกิดในเมือง. ใช้งานสำหรับผู้ที่ต้องการเพิ่มประสิทธิภาพของเครื่องเล็กน้อย (ทำให้ไม่แลค)

source: Fast zone hopping
th_th: ข้ามเขตแบบไว

source: Allows you to jump between characters in different map zones without any loading time because it keeps a larger area in memory. WARNING: will use more RAM and reduce frame rate
th_th: ทำให้สามารถสลับตัวละครที่อยู่ในเขตแผนที่ที่ต่างกันโดยไม่มีฉาก โหลดปรากฎขึ้นมาเพราะจะโหลดฉากไว้ล่วงหน้าแล้ว คำเตือน:ตัวเลือกนี้จะทำให้ใช้ RAM มากขึ้นและอาจมีอาการ Fps ลดลงได้

source: Gameplay
th_th: รูปแบบการเล่น

source: Population settings (affects performance)
th_th: ขนาดประชากร(มีผลต่อประสิทธิภาพ)

source: Squad size multiplier
th_th: คูณขนาดกลุ่ม

source: This multiplies the number of NPCs in each squad (Does not affect number of squads). Setting higher than 1.0 means MORE characters and bigger battles. WARNING! Will adversely affect performance.
th_th: จำนวนตัวคูณนี้เป็นของ NPCs ต่อกลุ่ม (ไม่ส่งผลต่อจำนวนของกลุ่ม).ตั้งค่าไว้สูงกว่า 1.0 หมายถึง ตัวละครที่มากขึ้น และ การต่อสู้ที่ยิ่งใหญ่ขึ้น. คำเตือน! อาจส่งผลต่อประสิทธิภาพ.

source: Global population multiplier (num NPC squads)
th_th: คูณขนาดประชากรโลก (จำนวนกลุ่ม NPC)

source: This multiplies the number of squads in the world (Does not affect squad size). Setting higher than 1.0 means MORE characters. WARNING! Will adversely affect performance.
th_th: จำนวนตัวคูณนี้เป็นของ จำนวน กลุ่มในโลก (ไม่ส่งผลต่อขนาดของกลุ่ม).ตั้งค่าไว้สูงกว่า 1.0 หมายถึง ตัวละครที่มากขึ้น. คำเตือน! อาจส่งผลต่อประสิทธิภาพ.

source: Difficulty settings
th_th: ระดับความยาก

source: Town raid events: size
th_th: เหตุการณ์ปล้นสะดมเมือง : ขนาด

source: Affects the size (and therefore difficulty) of attacking forces when nearby factions attack your town. WARNING! Making the raids bigger will affect performance
th_th: มีผลต่อขนาด(และส่งผลต่อความยาก) ของกองกำลังจู่โจม ตอนฝ่ายใกล้เคียงกำลังโจมตีเมืองของ. คำเตือน! ทำให้กองกำลังปล้นสะดมใหญ่มาก อาจส่งผลต่อประสิทธิภาพ

source: Town raid events: frequency
th_th: เหตุการณ์ปล้นสะดมเมือง : ความถี่

source: Affects the frequency of the raid events. (Values > 1 means more frequent attacks)
th_th: ส่งผลต่อความถี่ของเหตุการณ์ปล้นสะดม (ค่า > 1 หมายถึง จำนวนความถี่ของการโจมตีที่มากขึ้น)

source: Town attacks frequency
th_th: ความถี่การโจมตีเมือง

source: Bombardment
th_th: การระดมยิง

source: High
th_th: สูง

source: Fewer
th_th: น้อยลง

source: Rare
th_th: หายาก

source: Never
th_th: ไม่เคย

source: This is a separate thing to the raid events. This is for the attacks by bandits and enemies that just happen to be passing by your base and decide to attack it, trying to take it over. The old default was [High]
th_th: ส่วนนี้จะแยกออกจากเหตุการณ์ปล้นสะดม. มีไว้เฉพาะฝ่ายโจมตีโดยพวกโจรและศัตรูที่ผ่านมาแล้วเจอฐานของเจ้าและตัดสินใจโจมตี , พยายามเข้ายึดครอง. ค่าพื้นฐานแบบเก่าคือ [สูง]

source: Dismemberment
th_th: การหั่นศพ

source: Frequent
th_th: บ่อย ๆ

source: Affects how often limbs are lost. [Frequent] means that a limb is lost whenever its HP drops below -100. [Rare] means limbs are only lost when HIT and the damage goes below -100 (a rare occurence). With either setting limbs can still be eaten off also. [Never] means limb loss is disabled completely (boring)
th_th: ส่งผลต่ออวัยวะขาดบ่อยแค่ไหน.[บ่อย] หมายถึงอวัยวะนั้นจะขาดก็ต่อเมื่อ ค่าพลังชีวิตลดลงตํ่ากว่า -100. [ยาก] หมายถึงเฉพาะอวัยวะนั้น ๆ จะขาดก็ต่อเมื่อโดนตี และได้ค่ารับความเสียหายตํ่ากว่า -100 (ยากมากที่จะเกิดขึ้น)ทั้งยังตั้งค่าอวัยวะสามารถถูกกินได้.[ไม่มีวัน] หมายถึง อวัยวะขาดถูกปิดแบบสมบูรณ์(น่าเบื่อมาก)

source: Graphics
th_th: กราฟิค

source: Resolution (need restart)
th_th: สัดส่วนภาพ (จำเป็นต้องเริ่มเกมใหม่)

source: Full screen (need restart)
th_th: โหมดเต็มจอ (จำเป็นต้องเริ่มเกมใหม่)

source: Fullscreen mode, use only if Borderless isn't working for you
th_th: โหมดเต็มจอนั้น เหมาะเมื่อไม่สามารถใช้ โหมดไร้ขอบหน้าจอ กับเครื่องของได้

source: Borderless (need restart)
th_th: โหมดไร้ขอบ (จำเป็นต้องเริ่มเกมใหม่)

source: Borderless is the recommended screen mode, it is a type of fullscreen that allows safer alt-tabbing
th_th: เราแนะนำโหมดไร้ขอบหน้าจอ นี้ เนื่องจากสามารถสลับไปยังหน้าอื่นได้ด้วยการกด Alt-tab

source: View Distance
th_th: ระยะการมองเห็น

source: Increases the distance you can see, but has a negative effect on performance. Recommend you don't set it extremely high or low.
th_th: เพิ่มระยะการมองเห็น อาจมีผลเสียกับประสิทธิภาพเกม แนะนำว่าอย่าปรับสูงเกินหรือต่ำไป.

source: Terrain Detail
th_th: รายละเอียดสภาพพื้นดิน

source: Increases the quality of the terrain, but can have a negative effect on performance.
th_th: เพิ่มความคมชัดพื้นดิน อาจมีผลเสียกับประสิทธิภาพเกม.

source: Grass View Range
th_th: ระยะการมองเห็นของใบหญ้า

source: Grass Density
th_th: ความแออัดของหญ้า

source: Foliage View Range
th_th: ระยะการมองเห็นกลุ่มใบของต้นไม้

source: NPC View Range
th_th: ระยะการมองเห็น NPC

source: Objects View Range
th_th: ระยะการมองเห็นวัตถุ

source: Texture Quality (need restart)
th_th: พื้นผิวสิ่งของ (จำเป็นต้องเริ่มเกมใหม่)

source: Mega-high (danger!)
th_th: โคตรสูง (ระวังแลค!)

source: Medium
th_th: ปานกลาง

source: Low
th_th: ต่ำ

source: Fugly
th_th: ตำมากๆ

source: Increases texture quality, doesn't tend to affect performance but will affect memory use and loading times. /n WARNING! If you don't have enough video RAM to handle the setting you choose then the game will crash randomly because that's just how Microsoft designed it. Recommend > 4GB VRAM for max setting
th_th: การเพิ่มรายละเอียดพื้นผิวของเกมอาจไม่ส่งผลกระทบถึงประสิทธิภาพเกมแต่จะกินแรมการ์ดจอและส่งผลกับเวลาโหลดภายในเกม คำเตือน! หากมีแรมการ์ดจอไม่พอเกมอาจจะเด้งเองได้เพราะไมโครซอฟออกแบบมาอย่างงั้น คำแนะนำสำหรับแรมการ์ดจอคือ > 4GB สำหรับการตั้งค่าสูงสุด

source: Terrain Chunk Size (need restart)
th_th: อัตราการโหลดพื้นที่ (จำเป็นต้องเริ่มเกมใหม่)

source: Small
th_th: เล็ก

source: Large
th_th: ใหญ่

source: The size of terrain chunks. [Large] will make the game run much faster when looking at the horizon for faster computers. Slower systems using a shorter view distance may find it actually runs slower, in which case set it to [Small]. [Small] will also help if you have problems with running out of video RAM, which causes crashes
th_th: ขนาดก้อนภูมิประเทศ [ใหญ่] จะทำให้เกมทำงานได้เร็วขึ้นมากเมื่อมองเส้นขอบฟ้าสำหรับคอมพิวเตอร์แรง. สำหรับคอมช้าที่ใช้ระยะการมองสั้น อาจพบว่ามันทำงานช้าลงซึ่งในกรณีนี้ให้ตั้งค่าเป็น [เล็ก]. [เล็ก] จะช่วยได้ เช่นกันถ้าคุณมีปัญหาเกี่ยวกับ VRAM(แรมการ์ดจอ) ที่เป็นสาเหตุทำให้หลุด

source: Water reflection
th_th: ภาพสะท้อนบนผิวน้ำ

source: Disabled
th_th: ปิดการทำงาน

source: Landscape
th_th: ภูมิประเทศ

source: Characters
th_th: ตัวละคร

source: Everything
th_th: ทุกอย่าง

source: Determines what is reflected in the water. Turning this off will give a good performance boost
th_th: เลือกว่าจะมีเงาอะไรกระทบในน้ำ การปิดตัวเลือกนี้จะช่วยเรื่องความลื่นไหลเกม

source: Shadows
th_th: เงา

source: Turn off shadows if you have problems with performance
th_th: ปิดเงาหากมีปัญหาความเรื่องความลื่นไหลของเกม

source: Shadow Quality
th_th: ภาพแสงเงา

source: 1024 (poor)
th_th: 1024 (แย่)

source: 2048 (nice)
th_th: 2048 (สวยงาม)

source: 4096 (some video cards may freak out)
th_th: 4096 (อาจทำให้การ์ดดจอพัง)

source: Shadow Range
th_th: ระยะของเงา

source: Setting a longer range means that shadows are visible for a longer distance, but also reduces the shadows resolution/quality. Find a balance that you like.
th_th: ตั้งค่าระยะไกลมาก หมายถึง เงานั้นสามารถมองเห็นได้จากระยะไกล,แต่สามารถปรับ ลดเงา ความระเอียด/ภาพ. ปรับสมดุลตามที่ชอบ.

source: Blood
th_th: เลือด

source: Decal Range
th_th: ระยะการมองเห็นรอยกระสุน

source: Decal Resolution
th_th: ความละเอียดรอยกระสุน

source: The quality of blood-splats on the terrain
th_th: ภาพของเลือดที่สาดบนพื้น

source: Harpoon limit
th_th: จำกัดชมวก

source: The max number of harpoons/arrows that are left in the ground. Reduce this if you have frame rate drops around heavy turret areas.
th_th: มันคือจำนวนลูกชมวกและลูกศรที่ปักอยู่บนพื้น ถ้าเฟรมเรทลดลงบริเวณที่มีป้อมปืนแน่นหนาควรลดค่าลง.

source: Audio
th_th: เสียง

source: Music volume
th_th: เสียงดนตรี

source: Ambient volume
th_th: เสียงรอบข้าง

source: Footstep volume
th_th: เสียงฝีเท้า

source: SFX volume
th_th: เสียงเอฟเฟค

source: UI volume
th_th: เสียงการทำงานของปุ่มต่างๆ

source: Music Frequency (minutes)
th_th: ความถี่ของดนตรี (นาที)

source: Affects the overall amount of time that music plays in the game
th_th: ส่งผลต่อระยะเวลาโดยรวมที่เพลงเล่นในเกม

source: Controls
th_th: ควบคุม

source: Invert mouse X
th_th: สลับเมาส์แกน X

source: Invert mouse Y
th_th: สลับเมาส์แกน Y

source: Swap mouse buttons
th_th: สลับปุ่มเมาส์

source: Swap left and right mouse buttons on the GUI
th_th: สลับปุ่มซ้ายและขวาของเมาส์บน GUI

source: Hardware Mouse
th_th: ลูกศรเมาส์ของฮาร์ดแวร์

source: Turning this on will use the windows hardware mouse pointer, which looks a bit weird but has the advantage that it's not affected by the frame-rate. (REQURIES RESTART)
th_th: หากเจ้ากดเปิด ตัวเกมจะใช้ลูกศรเมาส์แบบ Windows มันอาจจะดูแปลกๆนิดหน่อยแต่เจ้าจะได้เปรียบตรงที่มันไม่มีผลแต่เฟรมเรท (จำเป็นต้องรีสตาร์ท)

source: Camera Move Speed
th_th: ความเร็วในการเคลื่อนที่ของกล้อง

source: Camera Rotate Speed X
th_th: ความเร็วในการหมุนกล้อง X

source: Camera Rotate Speed Y
th_th: ความเร็วในการหมุนกล้อง Y

source: Camera Zoom Speed
th_th: ความเร็วในการซูม

source: Key bindings
th_th: ปรับปุ่มภายในเกม

source: Selection
th_th: เลือก

source: Issue command
th_th: ออกคำสั่ง

source: Pause Game
th_th: หยุดเกม

source: Take screenshot
th_th: ถ่ายภาพหน้าจอ

source: Quicksave
th_th: บันทึกด่วน

source: Quickload
th_th: โหลดด่วน

source: Normal game speed
th_th: ความเร็วเกมปกติ

source: Faster game speed
th_th: ความเร็วของเกมที่เร็วขึ้น

source: Fastest game speed
th_th: ความเร็วของเกมที่เร็วที่สุด

source: Up one floor
th_th: ขึ้นไปอีก 1 ชั้น

source: Down one floor
th_th: ลงไปอีก 1 ชั้น

source: Highlight Items
th_th: เน้นไอเท็ม

source: Rotate camera
th_th: หมุนกล้อง

source: Move camera forward
th_th: ขยับกล้องไปข้างหน้า

source: Move camera backward
th_th: ขยับกล้องไปข้างหลัง

source: Move camera left
th_th: ขยับกล้องไปทางซ้าย

source: Move camera right
th_th: ขยับกล้องไปทางขวา

source: Tilt camera up
th_th: ขยับกล้องขึ้น

source: Tilt camera down
th_th: ขยับกล้องลง

source: Rotate camera left
th_th: หมุนกล้องไปทางซ้าย

source: Rotate camera right
th_th: หมุุนกล้องไปทางขวา

source: Zoom in
th_th: ขยายเข้า

source: Zoom out
th_th: ขยายออก

source: Toggle map
th_th: เปิด/ปิด map

source: Toggle character inventory
th_th: เปิด/ปิด ช่องเก็บของ

source: Toggle character stats
th_th: เปิด/ปิด ข้อมูลตัวละคร

source: Toggle research
th_th: เปิด/ปิด วิจัย

source: Toggle faction window
th_th: เปิด/ปิด หน้าต่างฝ่าย

source: Toggle main gui
th_th: เปิด/ปิด GUI หลัก

source: Stop selected characters actions
th_th: หยุุดการกระทำทั้งหมดของตัวละครที่บังคับ

source: Toggle block only mode
th_th: เปิด/ปิด โหมดป้องกันอย่างเดียว

source: Toggle passive mode
th_th: เปิด/ปิด โหมดไม่โต้ตอบ

source: Toggle jobs
th_th: เปิด/ปิด อาชีพ

source: Toggle ranged mode
th_th: เปิด/ปิด โหมดโจมตีระยะไกล

source: Toggle stealth mode
th_th: เปิด/ปิด โหมดลอบเร้น

source: Cycle movement speed
th_th: ปรับอัตราความเร็วเคลื่อนที่

source: Medic order
th_th: คำสั่งแพทย์

source: Rescue order
th_th: คำสั่ั่งช่วยเหลือ

source: Prospect order
th_th: คำสั่งตรวจหาแร่

source: Focus selected character
th_th: สนใจตัวละครที่เลือกเเจ้าั้น

source: Select all characters
th_th: เลือกทุกตัวละคร

source: Select character 1
th_th: เลือกตัวละคร 1

source: Select character 2
th_th: เลือกตัวละคร 2

source: Select character 3
th_th: เลือกตัวละคร 3

source: Select character 4
th_th: เลือกตัวละคร 4

source: Select character 5
th_th: เลือกตัวละคร 5

source: Select character 6
th_th: เลือกตัวละคร 6

source: Select character 7
th_th: เลือกตัวละคร 7

source: Select character 8
th_th: เลือกตัวละคร 8

source: Select character 9
th_th: เลือกตัวละคร 9

source: Select character 10
th_th: เลือกตัวละคร 10

source: Select next character
th_th: เลือกตัวละครถัดไป

source: Select previous character
th_th: เลือกตัวละครก่อนหน้า

source: Cycle squads
th_th: เปลี่ยนไปกลุ่มถัดไป

source: Build mode
th_th: โหมดก่อสร้าง

source: Toggle build mode
th_th: เข้าสู่โหมดก่อสร้าง

source: Confirm build mode
th_th: ยืนยันโหมดก่อสร้าง

source: Undo last building
th_th: ย้อนกลับสิ่งก่อสร้างล่าสุด

source: Rotate building left
th_th: หมุนสิ่งก่อสร้างไปทางซ้าย

source: Rotate building right
th_th: หมุนสิ่งก่อสร้างไปทางขวา

source: Move building up
th_th: ขยับสิ่งก่อสร้างขึ้น

source: Move building down
th_th: ขยับสิ่งก่อสร้างลง

source: Increase building slope
th_th: เพิ่มความชันสิ่งก่อสร้าง

source: Decrease building slope
th_th: ลดความชันสิ่งก่อสร้าง

source: Tools
th_th: เครื่องมือ

source: Toggle game editor
th_th: สลับโปรแกรมแก้ไขเกม

source: Rebuild navmesh
th_th: สร้างการนำทางใหม่

source: Reload biome data
th_th: รีโหลดข้อมูลสิ่งมีชีวิต

source: Editor gizmo: move
th_th: เครื่องมือแก้ไขวิดเจ็ต: เคลื่อนที่

source: Editor gizmo: rotate
th_th: เครื่องมือแก้ไขวิดเจ็ต: หมุน

source: Editor gizmo: scale
th_th: เครื่องมือแก้ไขวิดเจ็ต: ขนาด

source: Defaults
th_th: ตั้งค่าเริ่มต้น

source: Active mods
th_th: ใช้งาน Mods

source: Beta limitation: Area under construction.
th_th: ข้อจำกัดของเบต้า: พื้นที่ที่อยู่ระหว่างการก่อสร้าง.

source: Hold down the ALT key to pick the lock.
th_th: กดปุ่ม ALT ค้างไว้เพื่อล็อค.

source: Hold down the ALT key to escape the cage.
th_th: กดปุ่ม ALT ค้างไว้เพื่อหนีออกจากกรง.

source: Error!
th_th: ข้อผิดพลาด!

source: One of your squads has somehow loaded off the map, reload your game with [reset positions] selected to recover your missing squads
th_th: หนึ่งในตัวละคนในทีมของเกิดการโหลดตำแหน่งผิดพลาด, ลองโหลดเกมขึ้นมาใหม่โดยติ๊กที่ [reset positions] เพื่อรีเซ็ตตำแห่งของตัวละครที่ผิดพลาด

source: Can't place in a building you don't own.
th_th: ไม่สามารถวางในสิ่งก่อสร้างที่ไม่ได้เป็นเจ้าของได้.

source: Can't build too close to another town.
th_th: ไม่สามารถสร้างใกล้กับเมืองอื่นเกินไป.

source: This crop will not grow in this environment.
th_th: การเพาะปลูกจะไม่เติบโตในสภาพแวดล้อมนี้.

source: No resources at this location, mining would be pointless.
th_th: ไม่พบทรัพยากรในสถานที่นี้ เหมืองนี้ไกล้ร้างแล้ว.

source: Cannot build inside incomplete buildings.
th_th: ไม่สามารถสร้างภายในสิ่งปลูกสร้างที่ยังสร้างไม่เสร็จได้.

source: Must be placed outside or on a roof.
th_th: ต้องวางไว้ข้างนอกหรือบนหลังคา.

source: Must be placed inside a building.
th_th: ต้องวางไว้ภายในอาคาร.

source: Can only be placed on certain locations (marked by blue nodes).
th_th: สามารถวางลงบนพื้นผิวที่มั่นคงเเจ้าั้น (ระบุด้วยจุดสีน้ำเงิน)

source: Too close to another building.
th_th: ใกล้กับอาคารอื่นมากเกินไป.

source: No valid usage nodes.
th_th: ไม่มีโหนดการใช้งานที่ถูกต้อง.

source: There are characters in the way.
th_th: มีตัวละครอยู่ในทาง.

source: The building blocks another building use nodes.
th_th: สิ่งก่อสร้างขวางเส้นทางการใช้งานของอีกสิ่งก่อสร้างหนึ่งอยู่.

source: The building has one or more parts on invalid ground.
th_th: ส่วนใดสวนหนึ่งหรือมากกว่านั้นของสิ่งก่อสร้างตั้งอยู่บนพื้นที่ที่ไม่สมบูรณ์.

source: Invalid placing floor number. Change to the correct floor to place it in that position.
th_th: ตำแหน่งชั้นในการวางไอเทมไม่ถูกต้อง กรุณาเปลี่ยนตำแหน่งชั้นวางของไอเทมให้ถูกต้อง.

source: Ground needs to be more level.
th_th: ระดับพื้นต้องการระดับที่มากกว่านี้.

source: Warning: This sign will not be added to the building exterior layout as interior build mode is inactive.
th_th: คำเตือน : ป้ายนี้จะไม่ถูกเพิ่มสู่แผนผังภายนอกอาคาร เนื่องจาก โหมดก่อสร้างภายในไม่ได้ใช้งาน.

source: Error: Mesh file {1} is missing.
th_th: ข้อผิดพลาด: ไฟล์ mesh {1} หายไป.

source: Oi, You can't place that there.
th_th: เฮ้ จะวางตรงนั้นไม่ได้นะ.

source: Item placement group '{1}' has no valid items.
th_th: กลุ่มตำแหน่งรายการ {1} ไม่มีรายการที่ถูกต้อง.

source: Crop yield:
th_th: ผลผลิต:

source: Your Outpost
th_th: ฐานของ

source: Categories
th_th: รายการสินค้า

source: Commands
th_th: คำสั่ง

source: Undo
th_th: ย้อนกลับ

source: Building shell
th_th: โครงสร้างอาคาร

source: Materials cost:
th_th: วัตถุดิบ:

source: Nothing
th_th: ไม่มีอะไร

source: Estimated build time:
th_th: เวลาก่อสร้างโดยประมาณ:

source: Power Output:
th_th: พลังงานส่งออก :

source: Power Consumption:
th_th: การใช้พลังงาน:

source: Power Capacity:
th_th: ความจุพลังงาน:

source: Num People:
th_th: จำนวลคน:

source: Produces:
th_th: ผลิตภัณฑ์:

source: Training max:
th_th: ฝึกฝน สูงสุด:

source: lvl {1,num=fix,p=0}
th_th: เลเวล {1,num=fix,p=0}

source: Turrets bonus:
th_th: โบนัสของป้อมปืน:

source: Place Building:
th_th: วางสิ่งก่อสร้าง:

source: Left-Click
th_th: คลิ๊กซ้าย

source: Clear Building:
th_th: ขจัดสิ่งก่อสร้าง:

source: Right-Click
th_th: คลิ๊กขวา

source: Rotate:
th_th: หมุน:

source: {1} or {2} keys
th_th: กุญแจ {1} หรือ {2}

source: Change Height:
th_th: เปลี่ยนความสูง:

source: {1} and {2}
th_th: {1} และ{2}

source: Change Slope:
th_th: เปลี่ยนความชัน:

source: Undo:
th_th: ย้อนกลับ:

source: Cancel All:
th_th: ยกเลิกทั้งหมด:

source: Press
th_th: กด

source: when finished
th_th: เมื่อเสร็จสิ้น

source: Blue arrows point outwards, towards enemy.
th_th: ลูกศรสีฟ้าชี้สู่ภายนอก, ไปยังศัตรู.

source: Aiming...
th_th: กำลังเล็ง...

source: The game failed to detect a useable mouse
th_th: เกมล้มเหลวในการตรวจจับเม้าส์ที่ใช้งานได้

source: No available renderers found.
th_th: ไม่พบโหมดแสดงภาพที่ใช้ได้.

source: Problem
th_th: ปัญหา

source: Failed to load render system. You probably need to install the june 2010 directX runtimes located in the dependencies folder
th_th: ล้มเหลวในการโหลดระบบ. ต้องติดตั้ง june2010 directX runtimes ที่อยู่ในโฟลเดอร์อ้างอิง

source: DirectX11 unsupported on this system.
th_th: โปรแกรม DirectX11 ไม่รองรับระบบนี้.

source: ERROR creating root
th_th: ผิดพลาดในการสร้างรูท

source: Unfortunately your system cannot run the game. Your video card needs to be capable of running pixel shader v3.0.
th_th: โชคร้ายที่คอมของไม่สามารถรันเกมนี้ได้. การ์ดจอของจะต้องสามารถรัน pixel shader v3.0 ได้.

source: Research complete: {1}
th_th: การวิจัยเสร็จสิ้น:{1}

source: Used artifacts for '{1}' research.
th_th: สิ่งประดิษฐ์สำหรับการวิจัย {1}.

source: Autosaving...
th_th: กำลังบันทึกอัตโนมัติ...

source: Saving...
th_th: กำลังบันทึก...

source: Failed to save game
th_th: ไม่สามารถบันทึกเกมได้

source: Failed to load game
th_th: ไม่สามารถโหลดเกมได้

source: Failed to import game
th_th: ไม่สามารถนำเข้าเกมเพิ่มเติมได้

source: Old save version
th_th: เซฟเวอร์ชั่นเก่า

source: Kenshi has been updated to version {1}. Things have changed since this game was saved which will break everything horribly. Use the import menu to start a new game keeping your existing squad.
th_th: Kenshi ได้รับการอัพเดทเป็นเวอร์ชัน {1} แล้ว. มีหลายอย่างเปลี่ยนแปลงไป ตั้งแต่เกมนี้ถูกเซฟ ซึ่งจะทำให้ทุกอย่างพังเละเทะ. กรุณาใช้เมนูนำเข้า เพื่อเริ่มเกมใหม่ โดยคงกลุ่มปัจจุบันของไว้.

source: Name
th_th: ชื่อ

source: Date
th_th: วันที่

source: Delete Save
th_th: ลบเซฟเกม

source: Are you sure you want to delete this save game?
th_th: แน่ใจที่จะลบเซฟเกมนี้ทิ้งใช่หรือไม่ ?

source: File version
th_th: ไฟล์เวอร์ชั่น

source: Funds
th_th: เงินทุน

source: Members size
th_th: ขนาดสมาชิก

source: Location
th_th: สถานที่

source: Day
th_th: วันที่

source: Load game
th_th: โหลดเกม

source: Load
th_th: โหลด

source: Reset squad positions
th_th: ตั้งค่าตำแหน่งกลุ่มใหม่

source: Error
th_th: ผิดพลาด

source: This save file is invalid
th_th: ไม่พบเซฟไฟล์

source: Import game
th_th: นำเข้าเกมเพิ่มเติม

source: Advanced options
th_th: ตัวเลือกขั้นสูง

source: Import Buildings
th_th: นำเข้าสิ่งก่อสร้างเพิ่มเติม

source: Import Research
th_th: นำเข้าการวิจัยเพิ่มเติม

source: Import Dead NPCs
th_th: นำเข้า NPC ที่ตาย

source: Import Relations
th_th: นำเข้าความสัมพันธ์

source: Save game
th_th: บันทึกเกม

source: Save game error
th_th: บันทึกเกมผพลาด

source: The file name contains invalid characters
th_th: ชื่อตัวละครมีอักษรที่ไม่ถูกต้อง

source: Can't use this file name
th_th: ไม่สามารถใช้ไฟล์ชื่อนี้ได้

source: Overwrite save '{1}'?
th_th: บันทึกทับเซฟ '{1}'?

source: Trespassing
th_th: การบุกรุก

source: Terrorism
th_th: การก่อการร้าย

source: Theft
th_th: หัวโขมย

source: Murder
th_th: ฆาตรกรรม

source: Fencing
th_th: ขายของที่ขโมยมา

source: Burglary
th_th: การลักขโมย

source: Uniform Theft
th_th: ขโมยเครื่องแบบ

source: Enslaving
th_th: ทำให้เป็นทาส

source: Treason
th_th: กบฏ

source: Smuggling
th_th: ลักลอบนำเข้า

source: Escaping Prison
th_th: หนีออกจากคุก

source: Crop Theft
th_th: ขโมยพืชผล

source: crime
th_th: อาชญากรรม

source: Hold middle mouse button to rotate the camera
th_th: กดปุ่มกลางของเมาส์ค้างไว้เพื่อหมุนกล้อง

source: Use mouse wheel to zoom
th_th: ใช้ลูกกลิ้งเมาส์เพื่อซูม

source: Now create your first character. Use the 'Confirm' button when finished.
th_th: บัดนี้สร้างตัวละครแรกของเจ้า. กดปุ่ม'ยืนยัน'เมื่อเสร็จสิ้น.

source: Cannot find any towns from the game start town list.
th_th: ไม่สามารถหาเมืองจากรายชื่อเมืองเริ่มเกมได้.

source: Failed to load the core '{1}' file.
th_th: ไม่สามารถโหลดไฟล์หลัก {1}

source: Failed to load the following mod(s):
th_th: ล้มเหลวในการโหลด mod เหล่านี้(s):

source: Mod error(s) (Ignored files)
th_th: ข้อผิดพลาดของม็อด (ไฟล์ที่ถูกละเว้น)

source: Racial hunger rate:
th_th: ค่าความหิวของเผ่า:

source: Encumbrance effect:
th_th: ผลของน้ำหนัก:

source: Resting/KO state:
th_th: สภาวะ​พักผ่อน​/หมด​สติ​ :

source: Idle:
th_th: ว่าง:

source: Current work:
th_th: งานปัจจุบัน:

source: Oil
th_th: น้ำมัน

source: Racial bleed rate multiplier: x{1,num=fix,p=2}
th_th: ค่าการเสียเลือดของเผ่า: x{1,num=fix,p=2}

source: Your {1} is totally destroyed. Lucky it's not something you need to live.
th_th: {1} ของเจ้าถูกทำลาย. โชคดีที่เจ้ามีชีวิตต่อได้โดยไม่มีมัน.

source: Your {1} is totally destroyed. It's probably the reason you are dead.
th_th: {1} ของเจ้าถูกทำลาย. นี่เป็นสาเหตุที่ทำให้เจ้าตาย.

source: This wound is getting worse. You need first aid.
th_th: บาดแผลนี้กำลังแย่ลง เจ้าต้องได้รับการปฐมพยาบาล.

source: This is a critical wound. If it doesn't get medical treatment you will die.
th_th: บาดแผลนี้เป็นแผลฉกรรจ์. เจ้าจะตายได้ถ้าไม่ได้รับการรักษา.

source: This is a dangerous wound and is getting worse. If you can regain consciousness before it goes below {1,num} then you could save yourself. If it goes below that then you will have to hope you get rescued by somebody else.
th_th: บาดแผลนี้สาหัสและแย่ไปเรื่อยๆ. ถ้าเจ้าฟื้นสติก่อนที่ค่าจะลดไปถึง {1,num} เจ้าจะรอด. ถ้าลดต่ำกว่านั้นก็ต้องรอให้คนมาช่วยอย่างสิ้นหวังแล้วหล่ะ.

source: You will die at {2}
th_th: เจ้าจะตายที่ {2}

source: This is a dangerous wound and is getting worse. Get some medical attention fast. Death at {1}
th_th: บาดแผลนี้สาหัสมากๆ.รีบๆรักษาเร็วเข้า. เจ้าจะตายตอน {1}

source: This limb is severely damaged and in need of repairs. Luckily though skeleton limbs don't degenerate.
th_th: อวัยวะส่วนนี้เสียหายอย่างหนักและต้องการ การซ่อมแซ่ม. แต่โชคดีที่อวัยวะของ skeleton ไม่เสื่อมโทรม.

source: Your {1} needs bandaging, it's slowly getting worse.
th_th: {1} ของเจ้าจำเป็นต้องทำแพล, อาการกำลังแย่ลงเรื่อยๆ.

source: Your {1} needs bandaging.
th_th: {1} ของเจ้าจำเป็นต้องทำแผล.
