Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: The blood stat shows how rapidly you are losing blood. Blood is slowly recovered over time, but if it drops below 0 you will pass out.
th_th: สถานะเลือดแสดงให้เห็นถึงความเร็วของสถานะเลือดใหลต่อเนื่อง เลือดจะค่อยๆฟื้นตัวทีอย่างช้าๆ หากแต่ถ่าสถานะเลือดต่ำกว่า 0 จะสลบ.

source: You are injured 2
th_th: เจ้าได้รับบาดเจ็บ 2

source: The yellow areas of the health bars show bandaged health. Over time, this will slowly heal back to a healthy green.
th_th: บริเวณสีเหลืองในหลอดเลือดหมายถึงเลือดทีได้รับจากการรักษา จะค่อยๆเปลี่ยนเป็นสีเขียวในเวลาไม่นาน.

source: After using a First Aid Kit to bandage your wounds, sleeping in a bed will help fully recover more quickly. You can either build your own beds and camp beds or stay at a bar in town for a fee.
th_th: หลังจากที่ใช้ First Aid Kit รักษาแผลของ หลับบนเตียงจะช่วยให้รักษาแผลได้เร็วยิ่งขึ้น. เจ้าสามารถสร้างเตียงและและแคมป์เพื่อพักผ่อน หรือจะหลับที่งีบหลับที่บาร์เหล้าได้ฟรี.

source: You can select more specific combat modes from the rightside command menu: - Block focuses on defence over attack. - Passive focuses on non-combat unless attacked first. - Chases focuses on chasing down enemies until KO'd. - Taunt focuses on drawing enemy attacks.
th_th: เจ้าสามารถเลือกรูปแบบการต่อสู้อื่นๆที่เหมาะสมได้จากเมนูคำสั่งด้านขวามือ. - Block จะเน้นไปที่​การป้องกัน​มากกว่า​การ​โจมตี​. - Passive จะเน้นไปที่การไม่เข้าร่วม​ต่อสู้​จนกว่า​จะถูก​โจมตี​ก่อน​. - Chases จะเน้นไป​ที่​การตามล่า​จนกว่าศัตรู​จะ​สลบ. - Taunt จะเน้นไปที่การเรียกให้ศัตรูเข้ามาโจมตี.

source: You're under attack!
th_th: ถูกโจมตี!

source: You're under attack... Use the Space Bar to pause the action. This will give you some time to think and plan your next step.
th_th: ถูกโจมตี... กดปุ่ม Spacebar เพื่อหยุดชั่วขณะ ทำให้มีเวลาคิดและวางแผนล่วงหน้า.

source: When you're outnumbered, it may be best to jump ship and flee. If you choose to flee, right click on the terrain to move your character. *Tip: Make sure you have your character(s) selected!
th_th: ถ้ามีกำลังพลน้อยกว่า การหนีเป็นตัวเลือกที่ดีนะ. ถ้าเจ้าเลือกที่จะหนี คลิกขวาบนพื้นเพื่อให้ตัวละครเคลื่อนที่. *คำแนะนำ: ดูให้ดีว่าเจ้าเลือกตัวละครแล้วนะ!

source: If you do choose to stand and fight, select your squad members, hold right click on the target enemy and select Attack Target, ot Attack All from the interaction menu. Just right clicking on on an enemy when the cursor is red also gives an attack order.
th_th: ถ้าเจ้าเลือกที่จะอยู่และสู้ เลือกสมาชิกในทีม คลิกขวาค้างบนศัตรูและเลือกโจมตีเป้าหมาย หรือเลือกโจมตีทั้งหมดจากบนหน้าเมนู. แค่คลิกขวาบนศัตรูเมื่อลูกศรเมาส์เป็นสีแดงก็เป็นการสั่งโจมตีเหมือนกัน.

source: You can select different squad members by clicking on their icons in the squad panel, or by using the number keys, or by left click dragging over the in-game characters. Select your new recruit.
th_th: เจ้าสารารถเลือกสมาชิกกลุ่มได้โดยการกดที่ปุ่มสมาชิก หรือใช้ปุ่มตัวเลข หรือคลิกซ้ายค้างที่ตัวละครดังกล่าว แล้วเลือกที่คำสั่งสมาชิกใหม่.

source: You can check your character's skill statistics by opening the Stats menu from the command menu.
th_th: สามารถตรวจสอบสถิติทักษะของตัวละครของโดยการเปิดเมนูสถิติจากเมนูคำสั่ง.

source: Arrange and rename different squads via the squad menu.
th_th: จัดเรียงและเปลี่ยนชื่อทีมต่าง ๆ ผ่านทางเมนูของทีม.

source: You've just hired your first recruit
th_th: เจ้าพึ่งจ้างลูกน้องคนแรก

source: To perform first aid, exchange inventory items, guard, follow and carry squad members. Hold right click on them, or on their portrait to bring up the interaction menu.
th_th: หากต้องการทำการปฐมพยาบาล แลกเปลี่ยนไอเทม คุ้มกัน ติดตามและแบกสมาชิกกลุ่ม ให้คลิกขวาค้างไว้ที่ตัวหรือรูปภาพของพวกเขาเพื่อเปิดเมนูการโต้ตอบ.

source: You have stolen goods in your inventory
th_th: สินค้าถูกขโมยในคลังสินค้าของ

source: Thief! You've just stolen from someone...
th_th: ขโมย! เพิ่งถูกขโมยจากใครบางคน ...

source: Be careful when selling stolen goods to traders, you might just find yourself in trouble with the law if they catch you offloading their ally's belongings...
th_th: ระมัดระวัง​การขายของ​ที่​ขโมย​มา​ให้​กับ​พ่อค้า​ เจ้า​อาจจะ​เจอ​กับ​ปัญหา​เกี่ยวกับ​กฎหมาย​ได้ถ้าพวกเขา​จับได้​ว่า​ของพวกนั้นเป็นของที่มาจาก​เพื่อน​ของพวกเขา​...

source: When you talk to a trader and initiate the trade screen, hover over a stolen item to check your chances of fencing success before selling. If the Fencing Chance is low and it was stolen from the same faction, you'll likely be caught.
th_th: เมื่อ​เจ้าคุยกับพ่อค้า​และปรากฏ​หน้าต่าง​การแลกเปลี่ยน​ ชี้ไป​ที่​สิ่งของ​ที่ขโมยเพื่อตรวจสอบ​อัตรา​ของ​การเกลี้ยกล่อม​ ก่อนขาย. ถ้าหาก​ Fencing​ Chance​ ต่ำและเป็นของที่ขโมยมาจากสมาพันธ์​เดียวกัน​​มี​โอกาส​ที่จะ​ถูก​จับ.

source: Your best chance of selling stolen goods is to sell to a trader from another town and faction, or find a thief in one of the town bars. Thieves will buy any item off you risk free, however their prices are much less profitable than official merchant prices.
th_th: หากเจ้าต้องการขายของขโมย เจ้าควรไปขายกับพ่อค้าต่างเมือง, เผ่าอื่น, หรือ หาโจรที่รับซื้อแถวบาร์ในเมือง. โจรจะรับซื้อของเจ้าโดยที่เจ้าไม่ต้องรับความเสี่ยง แต่สิ่งที่ต้องแลกมา ก็คือราคาที่ได้รับจะต่ำกว่าราคามาตรฐานในตลาด.

source: Select your KO'd character.
th_th: เลือกตัวละครที่ถูกทำให้สลบ.

source: When unconscious, you'll notice a KO counter appear at the top of the health panel. This counts down how long until the character wakes up again.
th_th: เมื่อ​สลบเจ้าจะ​เห็น​ตัวนับถอยหลัง​แสดง​บนแถบสถานะ​สุขภาพ​ จะเป็น​การนับถอยหลัง​ว่าเมื่อไหร่​ที่ตัวละคร​จะฟื้น​.

source: You are KO'd (1/2)
th_th: เจ้าถูกทำให้สลบ (1/2)

source: You've been knocked out...
th_th: เจ้าถูกทำให้สลบ...

source: If seriously wounded, the unconscious status will change to 'dying' and the character won't get back up until healed by another character. If they don't get first aid in time they will eventually die.
th_th: ในบาดแผลที่ร้ายแรง​ สถานะ​ unconscious จะเปลี่ยนเป็น​ dying และตัวละคร​จะไม่ฟื้น​จนกว่าจะถูก​รักษา​จากตัวละคร​อื่น​ หากไม่​ได้รับรักษา​​ทันเวลาตัวละคร​ก็​มีสิทธิ์​ตาย.

source: Even after healing, a character will need time to recover before regaining consciousness. Particularly bad injuries will enter the character into a recovery coma until their vitals have improved above 0.
th_th: กระทั่ง​หลัง​จาก​การ​รักษา​ ​ตัวละครก็​ยังต้อง​การเวลาในการฟื้นฟู​หลังจาก​ได้​สติแล้ว​ ในกรณีที่​บาดเจ็บ​รุนแรง​ตัวละคร​จะสู่​สถานะ​ recovery coma จนกว่าค่าสถานะของอวัยวะ​จะเพิ่ม​ขึ้น​มากกว่า​ 0.

source: Getting KO'd may seem like a failure, but remember we learn best from our failures. Your toughness and defence stats will be improved each time you are KO'd. This will increase your KO recovery threshold over time.
th_th: การถูกทำให้สลบ อาจจะ​ดู​เหมือน​สิ่งล้มเหลว​ แต่​โปรด​จำไว้สิ่งเรียนรู้​ที่ดีที่สุด​มาจาก​ความล้มเหลว​ ในแต่ละครั้ง​ที่​ตัวละคร​ของ​เจ้า​สลบ ค่าความอดทน​และ​การป้องกัน​ของเจ้า​จะเพิ่มขึ้น​ ทุกครั้งที่​เกิดเหตุ​การณ์​นี้ ​จะเพิ่ม​อัตรา​การฟื้นฟู​จาก​การถูกทำให้สลบ.

source: The rescue job will find nearby unconcious allies and automatically cary them to a bed if there are any availiable in the vicinity.
th_th: งานการช่วยเหลือ​จะเป็น​การค้นหา​พักพวก​ที่สลบอยู่​ในบริเวณ​และทำการอุ้มพวกเขา​ไปที่เตียง​โดยอัตโนมัติ​หากมีเตียง​ที่ว่าง​ในพื้นที่​ใกล้เคียง​.

source: You are KO'd (2/2)
th_th: เจ้าถูกทำให้สลบ (2/2)

source: You can have conscious characters carry KO'd characters to safety. Hold right click on the KO'd character and select Pick Up from the interaction menu.
th_th: เจ้าสามารถ​ให้​ตัวละคร​ที่มีสติสัมปชัญญะ​ แบกตัวละคร​ที่​ถูกทำให้สลบ​ ไป​ยังพื้นที่​ปลอดภัย​ได้​ โดยการคลิกขวาค้าง ที่ตัวละคร​ที่ถูกทำให้สลบ​ และเลือกหยับ จากเมนู​การปฏิบัติ​.

source: To help a KO'd character recover their wounds more quickly, you can carry them to a bed.
th_th: หากต้องการ​ให้การรักษา​อาการสลบ​ ของตัวละคร​เร็วขึ้น​ เจ้าสามารถแบกพวกเขา​ไปไว้ที่เตียง​ได้.

source: To escape a prison cell, you'll need to use your lockpicking skills. Select your imprisoned character and hold right click on the cage to bring up the interaction menu. Select lockpick. The character must be concious.
th_th: ในการหนีออกจากคุก จะต้องใช้ทักษะ lockpicking. เลือก​ตัวละคร​ที่​ถูก​จองจำของเจ้า​ และคลิกขวาค้างบนกรงขัง​ จนกว่า​เมนู​คำสั่งจะแสดง แล้วเลือก​สะเดาะ​กุญแจ​. ตัวละครจำเป็นต้องมีสติ.

source: Now you'll need to wait for success. The speed it takes to pick a lock is dependent on each individual's thievery skill level.
th_th: จากนั้น​เจ้าเพียง​รอจนกว่า​จะสำเร็จ​. ความเร็ว​ในการสะเดาะ​กุญแจ​ ขึ้นอยู่กับ​ความชำนาญของความสามารถ​หัวขโมย.

source: How to escape a prison
th_th: วิธีการแหกคุก

source: You've committed a crime and been imprisoned. You can either wait out your sentence, have another squad member bail you out, or you can try to escape...
th_th: เป็นอาชญากรและถูกควบคุมตัว. เจ้าสามารถ​รอคำพิพากษา​ของเจ้า​ ไม่​ก็​ให้​สมาชิก​ใน​กลุ่ม​ของเจ้าประกัน​ตัวออก​ไป​ หรือจะลองแหกคุก​ออกมา.

source: Once successful, hold right click again on the cage and select escape. You may want to wait until any nearby captors are distracted.
th_th: เมื่อสำเร็จ​แล้ว​ คลิกขวาค้างที่​กรงขังแล้วเลือกหลบหนี​ เจ้าควรรอจนกว่า​ผู้คุมไขว้เขว​.

source: How to escape a prison (cannibal)
th_th: การหนีออกจาก​คุก​(พวก​กิน​คน)

source: You've been captured! Make an escape before you get turned into a cannibal banquet!
th_th: ถูกควบคุมตัว!. หนี! ก่อนที่เจ้าจะกลายเป็นโต๊ะจีนของพวกกินคน!

source: Once successful, hold right click again on the cage and select escape. You may want to wait until any nearby captors are distracted. Hint: Sometimes it's a good idea to use a character as a decoy while the other's escape. Harsh but necessary...
th_th: เมื่อสำเร็จ​แล้ว​ คลิกขวาค้างที่​กรงขังแล้วเลือกหลบหนี​. You may want to wait until any nearby captors are distracted. คำแนะนํา​ : เป็น​ความคิด​ที่​ดีบางครั้ง​ที่เจ้าใช้ตัวละคร​เป็น​ตัวล่อจนกว่า​อีก​ตัวละคร​จะหลบหนี​ มันดู​หดหู่​แต่จำเป็น...

source: Sneaking
th_th: ลอบเร้น

source: By toggling the sneak button, you are entering stealth mode. In this mode you can perform stealth knockouts, kidnaps and steal stuff.
th_th: ด้วย​การ​กดปุ่ม​ลอบเร้นเจ้าจะเข้าสู่​สถานะหายตัว​ ในสถานะนี้เจ้าสามารถ​ทำการ​ แอบตบให้​สลบ,ลักพาตัว​ และขโมย​ของ​.

source: The Stealth cursor displays two icons: an eyeball and a sun. When the eyeball is red, it means that you are in view of nearby NPCs. When the eyeball is blue, it means that you are currently out of anyone's line of sight.
th_th: ในขนาดที่​อยู่​ในสถานะ​หายตัว​จะแสดง​สองสัญลักษณ์​ : สัญลักษณ์​ดวงตา​และสัญลักษณ์​พระอาทิตย์​ เมื่อ​สัญลักษณ์​ดวงตาเป็น​สีแดง​นั้นหมายถึง​เจ้า​อยู่​ในขอบเขต​การมองเห็น​ของ​ NPC​s เมื่อ​สัญลักษณ์​ดวงตาเป็น​สีน้ำเงิน​หมายถึง​เจ้า​อยู่​นอกขอบเขต​ของการมองเห็น​จาก​ทุก​คน.

source: The sun icon shows the light level. When the sun is shaded, you are at your least visible. Hint: Nightfall is prime time for sneaking!
th_th: เครื่อง​หมายพระอาทิตย์​แสดง​ค่าของระดับ​แสง​ เมื่อพระอาทิตย์​เลื่อน​หายไป​ หมายถึง​พื้นที่​ของเจ้า​มองเห็น​ได้​ยาก​ คำแนะนํา​ : เวลากลางคืนเหมาะสม​ที่สุด​สำหรับ​การย่องเบา​!

source: To perform a stealth knockout, right click on an NPC while sneaking. The percentage shows the chance of success. The higher your Assassination skill, the higher the chance.
th_th: ในการทำแอบตบให้​สลบ​ คลิกขวาที่​ NPC​ ในขณะที่กำลังลอบเร้น​ จากนั้น​จะแสดงค่าร้อยละ​ของ​ความสำเร็จ​ หากเจ้า​มีระดับความสามารถ​ในการลอบสังหาร​สูง​ ก็​จะมี​ร้อยละ​ของ​ความสำเร็จ​สูง​.

source: To kidnap an KO'd NPC, hold right click on them, and select Kidnap from the command menu.
th_th: ในการลักพาตัว​​ NPC​ ที่ถูกทำให้สลบ คลิกขวาค้าง​และเลือก​ลักพาตัว​จากเมนู​คำสั่ง​.

source: How to steal
th_th: วิธีการขโมย

source: Careful, trying to open locked items and doors is illegal and could land you in trouble... Well, if you get caught, that is. As a rule, if the cursor shows red, then that action is hostile or illegal.
th_th: ระวังให้ดี การพยายามเปิดสิ่งของหรือประตูที่สลักกลอนไว้อยู่นั้นผิดกฏหมาย และอาจทำให้เจ้าตกในที่นั่งลำบากได้... แต่ก็ถ้าถูกจับได้ล่ะนะ ตามกฏ ถ้าเคอร์เซอร์ขึ้นเป็นสีแดง แสดงว่าการกระทำนั้นเป็นปฏิปักษ์ หรือผิดกฏหมาย.

source: Entering Sneak mode will help reduce the chance of you getting caught while committing crimes. You can find the Sneak button at the bottom right of the UI.
th_th: การเข้าสู่สถานะลอบเร้นจะช่วยลดโอกาสที่เจ้าจะถูกจับตอนก่ออาชญากรรม เจ้าสามารถหาปุ่มลอบเร้นได้จากด้านขวาล่างของ UI.

source: Hold the right mouse and select Pick Lock. The percentage amount displayed shows your chance of success. The lower the number, the longer it will take to pick. Your lock picking speed depends on the Thievery skill stat.
th_th: คลิกขวาค้างไว้แล้วกดสะเดาะกลอน เปอร์เซนที่ขึ้นแสดงถึงโอกาสที่จะทำสำเร็จ ยิ่งตัวเลขน้อย ยิ่งต้องใช้เวลามากในการสะเดาะกลอน ความเร็วในการสะเดาะกลอนขึ้นอยู่กับค่าสถานะทักษะโจร.

source: To steal individual items displayed on shelves and tables, hold ALT and right click on the item.
th_th: เพื่อขโมยสิ่งของแต่ละชนิดที่แสดงอยู่บนชั้นและโต๊ะ ให้กด ALT ค้าง และคลิกขวาที่สิ่งของนั้น.

source: This person has a bounty on their head. You can check if somebody has a bounty in their status panel. Mouse over this panel to check which faction set the bounty.
th_th: ตัวละครนี้มีค่าหัวแสดง สามารถตรวจสอบสถานะค่าหัวได้ที่แถบแสดงสถานะ นำเม้าส์​ไปวางที่หน้าต่าง​เพื่อ​ตรวจสอบ​ว่า​สมาพันธ์​ไหนตั้งค่าหัว.

source: How to do bounties
th_th: วิธีการล่าค่าหัว

source: To collect bounties, you'll need to take them to a police station. First, knock the person out, then pick them up and carry them to the nearest town.
th_th: ในการจะเก็บค่าหัว จะต้องพาพวกมันไปยังสถานีตำรวจ อันดับแรกทำให้สลบ แล้วจับพวกมันไปยังเมืองที่ใกล้ที่สุด.

source: To pick up a bounty, hold and right click the mouse on them to bring up the interaction menu.
th_th: ในการรับงานล่าค่าหัว ให้คลิกเมาส์ขวาค้างขึ้นที่ผู้ว่าจ้างเพื่อเปิด Interaction Menu.

source: Once you've found a police station, talk to the station's police chief for your reward.
th_th: เมื่อถึงสถานีตำรวจคุยกับหัวหน้าสถานีเพื่อรับรางวัล.

source: Your character is hungry...
th_th: ตัวละครกำลังหิว...

source: You need food to survive in this world or you'll starve. You can grow food, buy it, hunt it, or steal it.
th_th: หาอาหารไม่ก็ทนหิวในโลกอันโหดร้ายนี้ซะ!! ปลูก ชื้อ ล่า หรือไม่ก็ขโมยมันมา.

source: Your squad will automatically eat whatever food is in their inventory. Make sure all of your squad are stocked up!
th_th: ทีมของเจ้าจะกินอัตโนมัติเมื่อมีอาหารในช่องเก็บของ ตรวจสอบให้แน่ใจว่ามีอาหารในช่องเพียงพอในช่องเก็บของ!

source: If enemies are still nearby, a character may play dead in order to avoid further fighting and injury.
th_th: ถ้าศัตรูอยู่ใกล้ๆ ตัวละครจะทำการแกล้งตายโดยไม่สนใจอาการบาดเจ็บหรือการต่อสู้.

source: Playing dead
th_th: แกล้งตาย

source: To get up, right click to move. Just make sure there are no enemies around!
th_th: ในการจะลุกขึ้น แค่คลิ๊กขวา ต้องมั้นใจด้วยว่าไม่มีศัตรูอยู่ใกล้!!

source: You can organise your squad by assigning them jobs in the Orders Menu. The is especially useful for farms, mines and other production jobs, since assigned characters will automatically store and replenish raw materials as they work.
th_th: เจ้าสามารถ​เลือกงานให้กับพักพวก​ของเจ้าใน​ Order​ Manu เพื่อ​การทำงานอย่างเป็นระบบ​ มันค่อนข้าง​จำเป็น​ สำหรับการทำไร่​ ขุดแร่​ และสายงานการ​ผลิต​ เมื่อมอบหมาย​งานแล้ว​ ตัวละคร​จะจัดเก็บและ​เติมวัตถุดิบ​ในที่ๆพวกเขา​ทำงาน.

source: You can remove a job at any time by pressing the X button.
th_th: ยกเลิกงานโดยการกดปุ่ม X.

source: Perma-Jobs
th_th: อาชีพถาวร

source: To assign a job, select a character. Then, hold Shift while right clicking to interact with the object or building you wish to assign them to.
th_th: มอบหมายงาน โดยการเลือกตัวละคร กดปุ่ม shift ค้างแล้วคลิกขวาที่สิ่งก่อสร้างหรือวัตถุเพื่อมอบหมายงาน.

source: You can give characters multiple jobs. Top-most jobs in the Orders Menu will always take priority over lower assigned jobs. You can drag jobs to re-order them.
th_th: เจ้าสามารถ​มอบหมาย​งานหลายอย่าง​ให้กับตัวละคร​ได้​ งานที่อยู่​บนสุด​ของ​ Order​ Manu​ จะได้รับความสำคัญก่อนงานข้างล่าง​ เจ้า​สามารถ​ลากปรับเปลี่ยน​งานของพวกเขา​.

source: Your character will automatically behave 'obediently' to their master. If you want to escape, you'll need to dismiss the Obedient Slave auto job by pressing the X.
th_th: ตัวละคร​ของเจ้าจะเชื่อฟัง​'คำสั่ง'​จากเจ้านายของพวกเขา​อัตโนมัติ​ หากเจ้าต้องการ​หนี​ เจ้าจะต้อง​กดปุ่ม​ กากบาท​ เพื่อยกเลิกงาน​อัตโนมัติ​จากคำสั่ง​ทาส.

source: Being a slave
th_th: สถานะ ทาส

source: You've been enslaved. You can either live out the rest of your life as a slave, or you can break free and escape.
th_th: เมื่อเจ้า​ถูก​จับ​เป็น​ทาส​ เจ้าสามารถ​ใช้ชีวิตทั้งชีวิต​กับการเป็นทาส​ หรือ​ปลดแอก​และหลบหนี​.

source: You can then hold right click on your character to bring up the interaction menu and unlock your shackles to escape.
th_th: เจ้าสามารถ​หลบหนี​ด้วยการคลิกขวาค้างที่​ตัวละคร​ของ​เจ้า​จน​เมนู​คำสั่ง​ขึ้นมา​แล้วเลือกปลดล็อค​โซ่ตรวน​.

source: Careful, even if you successfully escape, you're now branded a slave. If anyone recognises you, you'll be recaptured.
th_th: โปรดระมัดระวัง​ตัว​ถึงแม้​เจ้าจะสามารถ​หลบหนี​ออกมา​ได้​ เจ้า​ก็​ยัง​ติด​สถานะทาส​อยู่​ ถ้าหาก​มีใครจำเจ้า​ เจ้ามีโอกาส​ถูก​จับ​อีก​ครั้ง​.

source: Your character's status will show as Disguised when you are hidden in full uniform.
th_th: ตัวละคร​ของเจ้า​จะ​ขึ้น​สถานะ​ปลอมตัว​ เมื่อแต่งกาย​อย่างมิดชิด​.

source: Disguises & uniforms
th_th: การปลอมตัว & เครื่องแบบ

source: If you have the complete outfit, you can use faction uniforms to disguise yourself. Disguise success is dependent on the Stealth skill stat.
th_th: หากเจ้ามีเครื่อง​แต่ง​กายครบ​ เจ้าสามารถ​ใช้​เครื่อง​แต่ง​กาย​ของ​สมาพันธ์​เพื่อปลอมตัว​ของเจ้า​ได้​ การปลอมตัว​สำเร็จ​ขึ้นอยู่กับ​ความสามารถ​หัวขโมย​ของเจ้า.

source: Careful you don't get caught wearing a faction's uniform, most people don't take too kindly to imposters.
th_th: โปรดระมัดระวัง​ถึงแม้​เจ้าจะไม่ถูกจับขนาดสวมใส่​เครื่อง​แบบ​ของสมาพันธ์​ ผู้​คนส่วนใหญ่ก็​ไม่​ให้​ความ​ปราณี​กับพวก​แอบอ้าง​เหมือน​กัน​.

source: Your machine is full. Machines and buildings only have a maximum amount of materials they can hold after they've produced them. You won't be able to produce anything else until you've shifted these materials.
th_th: เครื่องจักรของเจ้าความจุเต็ม เครื่องจักรและสิ่งก่อสร้างสามารถเก็บผลผลิตได้เป็นจำนวนจำกัด และจะไม่สามารถผลิตอะไรเพิ่มได้จนกว่าจะย้ายผลผลิตเหล่านี้ออกไป.

source: Your machine is full
th_th: เครื่องจักรเต็ม

source: Build Storage Boxes to hold excess materials.
th_th: สร้างที่เก็บของเพื่อเก็บวัตถุดิบต่างๆ.

source: Building gates and walls
th_th: สร้างประตูและกำแพง

source: When building walls, you need to be careful not to place them facing inside out. The arrows you see show the OUTSIDE facing direction of the walls.
th_th: เมื่อสร้างกำแพง ควรตรวจสอบให้แน่ใจว่าหันด้านในและด้านนอกถูกด้าน ลูกศรที่เห็นแสดงให้เห็นถึงด้านนอกของกำแพง.

source: You can use the < and > buttons to rotate before placing them.
th_th: เจ้าสามารถใช้ปุ่ม < และ > เพื่อเปลี่ยนทิศทางก่อนสร้างกำแพง.

source: As with other buildings, you can only place them when they glow green.
th_th: เช่นเดียวกันกับสิ่งปลูกสร้างอื่น ๆ เจ้าสามารถเริ่มสร้างได้เมื่อตัวอย่างสิ่งปลูกสร้างเป็นสีเขียว.

source: Once you're happy, left click to set it down. To finish the link, right click.
th_th: เมื่อเจ้าพอใจกับทิศทาง ให้คลิกขวาเพื่อสร้างสิ่งปลูกสร้าง หากต้องการสร้างการเชื่อมต่อ ให้คลิกขวา.

source: To craft items, open the Tech menu
th_th: หากต้องการสร้างของ ให้เปิดเมนูเทค

source: Open the Crafting tab
th_th: เปิดแท็บการสร้างของ

source: This will show available items you can craft in the middle section. The bottom panel shows how much time and materials you'll need to make that item.
th_th: แท็บนี้จะแสดงให้เห็นถึงไอเทมที่สามารถสร้างได้ในส่วนตรงกลาง แผงด้านล่างแสดงให้เห็นว่าจะต้องใช้เวลาและทรัพยากรเท่าไรในการสร้างไอเทมนั้น.

source: How to craft
th_th: วิธีการสร้างของ

source: First, you need to select a station from the section on the left side of the menu.
th_th: อันดับแรก, เจ้าจะต้องเลือกฐานจากทางซ้ายของเมนู.

source: Left click to select an item to craft. You can queue multiple items, or alternatively you can cancel them with the X.
th_th: คลิกซ้ายเพื่อเลือกรายการที่จะสร้าง. เจ้าสามารถสร้างสิ่งของได้ทีละหลายชิ้นต่อเนื่องกัน, และสามารถยกเลิกได้ด้วยการกด X.

source: Now, make sure you have workers assigned to the work station which is crafting these items. You'll also need pleny of raw materials before you start crafting.
th_th: ในขณะนี้,ต้องมั่นใจว่าเจ้ามีคนงานที่ได้รับมอบหมายหน้าที่ ที่โต๊ะทำงานที่จะสร้างของพวกนั้น. อีกทั้งเจ้าต้องการวัตถุดิบจำนวนมากก่อนจะเริ่มสร้าง.

source: You can buy blueprints or research new items to craft.
th_th: เจ้าสามารถซื้อพิมพ์เขียวหรือค้นคว้ารายการใหม่เพื่อสร้างของ.

source: To craft items, you need to build a workbench from the Crafting section of the build menu.
th_th: ในการสร้างสิ่งของ, เจ้าจะต้องสร้างโต๊ะทำงานก่อนโดยสามารถสร้างได้จากเมนูก่อสร้าง.

source: How to craft (No bench)
th_th: วิธีสร้าง (ไม่มีที่สร้าง)

source: First things first though, you're going to need to research all the necessary buildings, equipment and schematics needed for crafting.
th_th: ก่อนอื่น, เจ้าจะต้องไปค้นคว้าทุกสิ่งที่จำเป็นในการก่อสร้าง, อุปกรณ์และแผนงานจำเป็นสำหรับการสร้าง.

source: Build a Research Bench to learn new tech and crafts.
th_th: สร้างโต๊ะค้นคว้าเพื่อเรียนรู้เทคโนโลยีและสร้างของใหม่ๆ.

source: Left click to select your new building and view its info.
th_th: คลิ๊กซ้ายเพื่อเลือกสิ่งก่อสร้างใหม่ของเจ้าและดูข้อมูลของสิ่งนั้น.

source: This shows the current state of the building.
th_th: นี่แสดงให้เห็นถึงสถานะขณะนี้ของสิ่งปลูกสร้าง.

source: Some buildings will need a power supply.
th_th: สิ่งปลูกสร้างบางแห่งจำเป็นต้องมีตัวจ่ายพลังงาน.

source: To save power for other buildings, you can use the Power switch to turn off specific buildings.
th_th: เพื่อประหยัดพลังงานสำหรับสิ่งปลูกสร้างอื่น ๆ เจ้าสามารถใช้ปุ่มเปิด/ปิดพลังงาน เพื่อปิดพลังงานสิ่งปลูกสร้างที่เจ้าเลือกไว้.

source: Some machines and buildings need workers to operate them. This bar shows how many workers are currently operating the machine and the maximum possible amount of them.
th_th: เครื่องจักรบางตัวและสิ่งปลูกสร้างบางอัน ต้องการคนงานเพื่อดำเนินงาน. แถบนี้แสดงสถานะจำนวนคนงาน ว่ากำลังดำเนินงานเครื่องจักรอยู่ และจำนวนที่เป็นไปได้สูงสุดของคนงาน.

source: Many machines and buildings need certain raw materials in order to run. This panel shows exactly what items are needed to add to it.
th_th: เครื่องจักรและสิ่งปลูกสร้าง จำเป็นต้องมีวัตถุดิบบางอย่าง จึงจะใช้งานได้ แผงนี้แสดงถึงของที่จำเป็นต้อง ใช้ในการเติมเข้าไป.

source: You've built your first production building
th_th: เจ้าได้สร้างโรงผลิตแห่งแรกสำเร็จ

source: Production buildings rely on a number of factors.
th_th: โรงผลิตขึ้นอยู่กับหลายปัจจัย.

source: The more workers, the faster the output.
th_th: ยิ่งคนงานมาเท่าไหร่ ยิ่งได้ผลผลิตไวเท่านั้น.

source: To research new tech such as buildings, defensive weapons and crafting, you need to construct a Research Bench from the Build menu. But, before you can build a Research Bench, you need a building to house it.
th_th: เพื่อวิจัยเทคโนโลยีใหม่ๆ เช่น สิ่งปลูกสร้าง อุปกรณ์ป้องกัน และการสร้างสิ่งของ เจ้าจำเป็นต้องสร้างโต๊ะวิจัยจากเมนูก่อสร้าง. ทว่า ก่อนจะสร้างโต๊ะวิจัยได้ เจ้าจำเป็นต้องมีสิ่งก่อสร้างสำหรับตั้งมันเสียก่อน.

source: How to research tech (Benches)
th_th: วิธีวิจัยเทคโนโลยี (โต๊ะ)

source: Either you can buy a house in a town, or you can build your own house outside of an NPC town. Left click on a building to check if it is for sale.
th_th: เจ้าสามารถซื้อบ้านในเมือง, หรือเจ้าจะสร้างบ้านของเจ้าเองนอกเมืองของ NPC. คลิกซ้ายบนสิ่งก่อสร้างเพื่อตรวจดูว่ามันขายไหม.

source: Some buildings are availiable for purchase. This panel will tell you how much the building costs, with a button to buy it.
th_th: สิ่งก่อสร้างบางแห่งซื้อได้ แถบเครื่องมือนี้จะบอกราคา พร้อมกับปุ่ม ซื้อ.

source: Buildings for sale
th_th: สิ่งก่อสร้างสำหรับขาย
