Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: Your {1} needs bandaging, but it's not urgent.
th_th: {1} ของเจ้าจำเป็นต้องทำแผล, แต่มันไม่ใช่เรื่องรีบด่วนอะไร.

source: Your {1} is in the process of healing.
th_th: {1} ของเจ้ากำลังได้รับการรักษา.

source: Your {1} is okay.
th_th: {1} ของเจ้าอยู่โอเคแล้ว.

source: You have {1} points of wear damage. The manual recommends you find a Skeleton Bed for maintenance.
th_th: เจ้ามีค่าความเสียหายสึกกร่อนอยู่ {1} แต้ม คู่มือแนะนำให้เจ้าหา Skeleton Bed สำหรับการบำรุงรักษา.

source: You have {1} points of wear damage, this detracts from your max health and can be fixed at a Skeleton Bed.
th_th: เจ้ามีค่าความเสียหายสึกกร่อนอยู่ {1} แต้ม สิ่งนี้จะลดค่าพลังชีวิตสูงสุดของเจ้าและสามารถแก้ไขได้ที่ Skeleton Bed.

source: Your stats will be negatively affected.
th_th: สถานะตัวละครของเจ้าจะลดลง.

source: Your movement speed will be negatively affected.
th_th: ความเร็วการเคลื่อนที่ของเจ้าจะลดลง.

source: Your combat and manual labour skills will be negatively affected.
th_th: ทักษะการต่อสู้และทักษะการงานของเจ้าจะลดลง.

source: You won't be able to kick.
th_th: เจ้าไม่สามารถเตะได้.

source: This limb is gone forever.
th_th: อวัยวะนี้หายไปตลอดกาล.

source: Skeletons don't need to eat.
th_th: Skeletons ไม่จำเป็นต้องกิน(อาหาร).

source: You are well fed and currently have no problem.
th_th: เจ้ากินดีอยู่ดีและไม่มีปัญหาอะไร.

source: You are suffering from malnutrition, but you have food so you are recovering. Stat penalty is {1}
th_th: เจ้าเริ่มไม่สบายจากการขาดอาหาร. ตราบใดที่ยังมีอาหารเหลืออยู่ เจ้าก็ยังได้รับการฟื้นฟู. สถานะถูกลดไป {1}

source: You have passed out from starvation. You have food though, so hopefully you will recover.
th_th: เจ้าสลบไปเพราะว่าขาดอาหาร. ถึงเจ้ายังมีอาหารเหลืออยู่ก็หวังว่าจะฟื้นสภาพกลับมาได้นะ.

source: You are slowly recovering from starvation.
th_th: เจ้าค่อยๆฟื้นฟูจากการขาดอาหารอย่างช้าๆ.

source: You are suffering from malnutrition, Your stats and strength will be affected, you need to get some food as soon as possible. Stat penalty is {1}
th_th: เจ้าเริ่มไม่สบายจากการขาดอาหาร. ทำให้มีผลต่อความแข็งแกร่งและสถานะของเจ้า, รีบๆหาอาหารเร็วเข้า. สถานะถูกลดไป {1}

source: You have passed out from starvation. One of your squad mates will have to feed you or you're going to die.
th_th: เจ้าสลบไปเพราะว่าขาดอาหาร. เพื่อนร่วมทีมของเจ้าจะต้องให้อาหารเจ้าไม่อย่างนั้นเจ้าจะตาย.

source: You have passed out from starvation. You're all alone and going to die. Nobody cares.
th_th: เจ้าสลบไปเพราะว่าขาดอาหาร. เจ้าเหลือเพียงคนเดียว และก็กำลังจะตายไปคนเดียว. ไม่มีใครสนใจชีวิตเน่าๆของเจ้า.

source: You are starving to death. Get some food fast. When the red bar goes below {1} you will pass out. When it reaches zero, you die.
th_th: เจ้ากำลังจะอดตาย. รีบๆหาอาหารเร็วเข้า. ตอนที่แถบสีแดงต่ำกว่า {1} เจ้าจะสลบ. เมื่อมันลดถึง 0 เจ้าจะตาย.

source: You are kind of healthy for now.
th_th: ดูเหมือนเจ้าจะสุขภาพดีนะ.

source: Gone forever. RIP.
th_th: จากไปตลอดกาล RIP.

source: BEING EATEN ALIVE!!
th_th: กำลังถูกกินทั้งเป็น!!

source: Something is eating you alive! AAAAAAHHHHHHHHHH!!
th_th: บางอย่างกำลังกัดกินเจ้าทั้งเป็น! อ๊าาาาาาา!!

source: Dying
th_th: กำลังจะตาย

source: Severe limb damage has now led to critical blood loss. You will die without medical attention.
th_th: แขนขาที่ได้รับบาดเจ็บทำให้เจ้าเสียเลือดมาก เจ้าจะตายหากไม่ได้รับการรักษา.

source: If you don't get medical attention, you will die.
th_th: หากเจ้าไม่ได้รับการรักษาตอนนี้ เจ้าจะตาย.

source: Knocked out cold.
th_th: สลบเหมือด.

source: Recovery coma
th_th: ฟื้นจากอาการหมดสติ

source: You've suffered too much damage. You won't be getting up again until all critical body parts have recovered above 0.
th_th: เจ้าบาดเจ็บมากเกินไป และไม่สามารถลุกขึ้นได้จนกว่าชิ้นส่วนร่างกายได้รับการฟื้นฟู.

source: Playing dead...
th_th: แกล้งตาย...

source: This person has regained consciousness but is staying down, waiting for all the enemies to leave the area.
th_th: ตัวละครนี้เริ่มได้สติ แต่ต้องอยู่นิ่ง ๆ, เพื่อรอให้ศัตรูทั้งหมดออกไปจากพื้นที่.

source: Bleeding out
th_th: มีเลือดออก

source: Unconscious from blood loss and bleeding to death. Hope that the bleeding stops before it's too late.
th_th: ไม่ได้สติเพราะเสียเลือดและเลือดไหลไม่หยุด หวังว่ามันจะหยุดไหลก่อนที่จะสายไป.

source: Blood loss KO
th_th: เสียเลือดจนสลบ

source: Unconscious from blood loss. It will recover over time, bed rest will help.
th_th: ไม่ได้สติเพราะเสียเลือด ต้องใช้เวลาในการฟื้นฟู, นอนพักบนเตียงน่าจะช่วยได้.

source: Crippled
th_th: พิการ

source: Your legs are incapable of supporting you.
th_th: ขาของเจ้ารับน้ำหนักเจ้าไม่ไหวแล้ว.

source: Crippled arm
th_th: แขนพิการ

source: Your sword arm is crippled and you are unable to fight.
th_th: แขนข้างที่จับดาบของเจ้าพิการ, เจ้าไม่สามารถสู้ได้.

source: Critical
th_th: แผลฉกรรจ์

source: Critical injuries will continue to degenerate without medical attention.
th_th: แผลฉกรรจ์จะทำให้เลือดเจ้าลดไปเรื่อยๆถ้าไม่ได้รับการรักษา.

source: Limb trauma
th_th: อวัยวะบาดเจ็บ

source: One or more limbs have been seriously crippled by critical injury.
th_th: มีอวัยวะบาดเจ็บรุนแรงจากแผลฉกรรจ์.

source: Staying low
th_th: หมอบต่ำไว้

source: You are staying down, hoping to avoid drawing attention.
th_th: เจ้ากำลังหมอบต่ำลง หวังว่าจะเลี่ยงการเป็นที่สะดุดตาได้.

source: Starving
th_th: หิวโหย

source: You are starving to death. Get some food fast.
th_th: เจ้ากำลังจะหิวตาย. หาอาหารกินด่วน.

source: Bleeding
th_th: เลือดไหล

source: Losing blood, will collapse if blood goes below 0.
th_th: กำลังเสียเลือด. เจ้าจะสลบถ้าเลือดต่ำกว่า 0.

source: Discovered!
th_th: ถูกพบ!

source: You've been discovered, somebody has noticed that you are an escaped slave.
th_th: เจ้าถูกพบ!. ใครบางคนจำได้ว่าเจ้าคือทาสหลบหนี.

source: Disguise Blown!
th_th: เจ้าถูกเปิดโปง!

source: You've been discovered, somebody has seen through your disguise.
th_th: เจ้าถูกเปิดโปง. ใครบางคนมองออกว่าเจ้ากำลังปลอมตัว.

source: Cooldown {1,num} second
th_th: คูลดาวน์ {1, NUM} วินาที

source: In Disguise
th_th: กำลังปลอมตัว

source: You are currently disguised as {1}
th_th: เจ้ากำลังปลอมตัวเป็น {1}

source: Wounded
th_th: ได้รับบาดเจ็บ

source: Malnourished
th_th: ขาดสารอาหาร

source: You are hungry and suffering from malnutrition, but you are fed and slowly recovering. Your stats and strength will be affected until you recover fully.
th_th: เจ้ากำลังหิวและทนทุกข์จากการขาดสารอาหาร, แต่เจ้าได้อาหารแล้วและกำลังฟื้นตัวอย่างช้าๆ. stats และ strength ของเจ้าจะได้รับผลกระทบจนกว่าเจ้าจะฟื้นตัวเต็มที่.

source: Hungry
th_th: หิว

source: You are hungry and suffering from malnutrition. Your stats and strength will be affected, you need to get some food as soon as possible.
th_th: เจ้าหิวและทรมานจากการขาดแคลนอาหาร. ค่าสถานะและความแข็งแกร่งจะได้รับผลกระทบ, เจ้าต้องได้รับอาหารโดยเร็วที่สุด.

source: Slightly Injured
th_th: บาดเจ็บเล็กน้อย

source: Encumbrance penalty:
th_th: ข้อเสียของน้ำหนัก:

source: Full speed bonus:
th_th: โบนัสความเร็วสูงสุด:

source: This is the rate at which your athletics skill is increasing while running.
th_th: นี่คืออัตราที่ทักษะการวิ่งเพิ่มขึ้นในขณะวิ่ง.

source: Weapon weight:
th_th: น้ำหนักอาวุธ:

source: This is the rate at which your strength is increasing.
th_th: นี่่คืออัตราที่ความแข็งแกร่งเพิ่มขึ้น.

source: Encumbrance bonus:
th_th: โบนัสน้ำหนัก:

source: Carrying somebody:
th_th: แบกใครบางคน:

source: Toughness XP:
th_th: XP ความทนทาน:

source: Crippled left arm:
th_th: แขนซ้ายพิการ:

source: Crippled right arm:
th_th: แขนขวาพิการ:

source: Blood loss trauma:
th_th: บาดแผลที่ทำให้เสียเลือด:

source: Critical wounds:
th_th: แผลฉกรรจ์:

source: This is the rate at which your toughness increases when you get hurt.
th_th: นี่คืออัตราที่ความอึดจะเพิ่มขึ้นตามความเจ็บ.

source: KO point:
th_th: แต้มสลบ:

source: When an injury to a body part goes below your KO point of {1,num} then you are down for good. Your body will enter a coma and won't regain consciousness until all critical body parts have healed above 0.
th_th: ขณะร่างกายบาดเจ็บน้อยกว่า {1,num} แต้มสลบ ต่อจากนี้เจ้าก็แย่ของจริง ร่างกายเจ้าจะเข้าสู่อาการโคม่าและไม่สามารถเรียกคืนสติได้ จนกว่าจะจุดที่ร่างกายเสียหายจะถูกรักษามากกว่า 0 แต้ม.

source: Run speed:
th_th: ความเร็วในการวิ่ง:

source: Stealth mode:
th_th: โหมดลอบเร้น:

source: max:
th_th: สูงสุด:

source: Hunger Rate:
th_th: อัตราความหิว:

source: Athletics Skill:
th_th: ทักษะการวิ่ง:

source: Max possible speed:
th_th: ความเร็วสูงสุดที่ทำได้:

source: Leg injury:
th_th: บาดเจ็บที่ขา:

source: Armour/equipment:
th_th: เกราะ/อุปกรณ์:

source: Robotics:
th_th: วิทยาการหุ่นยนต์:

source: Stealth skill:
th_th: ทักษะลอบเร้น:

source: Max speed:
th_th: ความเร็วสูงสุด:

source: Carrying something:
th_th: กำลังแบกอะไรบางอย่าง:

source: Crawling:
th_th: คลาน:

source: Injuries:
th_th: อาการบาดเจ็บ:

source: Pup
th_th: แบเบาะ

source: Teen
th_th: วัยรุ่น

source: Elder
th_th: วัยชรา

source: Adult
th_th: ผู้ใหญ่

source: {1} skill:
th_th: ทักษะ:{1}

source: Hunger:
th_th: ความหิว:

source: Weather:
th_th: สภาพอากาศ:

source: Working in darkness:
th_th: ทำงานในที่มืด:

source: Limbs disabled:
th_th: แขน-ขา พิการ:

source: Missing arm penalty:
th_th: บทลงโทษเมื่อเสียแขน:

source: Stat Multiplier:
th_th: ตัวคูณสถิติ:

source: Total equipment bonuses:
th_th: โบนัสอุปกรณ์สวมใส่ทั้งหมด:

source: Indoors bonus:
th_th: โบนัสเมื่ออยู่ในอาคาร :

source: Weather penalty:
th_th: ผลลัพธ์ของสภาพอากาศ:

source: Crossbows:
th_th: หน้าไม้:

source: Crossbows
th_th: หน้าไม้

source: Precision:
th_th: แม่นยำ:

source: Careful Shooting
th_th: ยิงอย่างระวัง

source: Perception:
th_th: การรับรู้:

source: Perception
th_th: การรับรู้

source: Attack:
th_th: พลังโจมตี:

source: Weapon indoors penalty:
th_th: ไม่อนุญาตให้มีการถืออาวุธในอาคาร:

source: Base hit chance:
th_th: โอกาสโจมตีฐาน:

source: Defense:
th_th: พลังป้องกัน:

source: Defensive combat mode:
th_th: รูปแบบการต่อสู้แบบป้องกัน:

source: Your defense skill is your chance of blocking enemy attacks.
th_th: ทักษะการป้องกัน ทำให้เจ้ามีโอกาสป้องกันการโจมตีของศัตรู.

source: Strength XP rate:
th_th: อัตราการเติบโตของค่าความแข็งแกร่ง:

source: Max carry weight:
th_th: น้ำหนักที่สามารถแบกได้:

source: Blunt weapon damage:
th_th: ความเสียหายจากอาวุธประเภทไร้คม:

source: Strength
th_th: ความแข็งแกร่ง

source: Attack speed:
th_th: ความเร็วในการโจมตี:

source: Block speed:
th_th: ความเร็็วในการป้องกัน:

source: Weapon cutting damage:
th_th: ความเสียหายจากอาวุธประเภทตัด:

source: Dexterity
th_th: ความชำนาญ

source: Toughness XP rate:
th_th: อัตราการได้รับ XP ความทนทาน:

source: Health KO point:
th_th: แต้มพลังชีวิต(สลบ)

source: Wound degeneration speed:
th_th: ความเร็วในการเสื่อมสภาพของบาดแผล:

source: Damage resistance:
th_th: ลดทอนความเสียหาย:

source: Dodge skill:
th_th: สกิลหลบ:

source: Leg injury penalty:
th_th: ติดโทษจากอาการขาบาดเจ็บ:

source: Equipment penalty:
th_th: ได้รับโทษจากอุปกรณ์:

source: Defensive mode:
th_th: โหมดป้องกัน:

source: -End total:
th_th: ยอดรวม:

source: Dodge:
th_th: หลบหลีก:

source: Engineering
th_th: วิศวกรรม

source: Weapon Smithing
th_th: การตีอาวุธ

source: Armour Smithing
th_th: การตีชุดเกราะ

source: Crossbow Smithing
th_th: การสร้างหน้าไม้

source: Labouring
th_th: แรงงาน

source: Cooking
th_th: ปรุงอาหาร

source: Farming
th_th: เพาะปลูก

source: Attack
th_th: โจมตี

source: Science
th_th: วิทยาศาสตร์

source: Thievery
th_th: ขโมย

source: Turrets
th_th: ป้อมปืน

source: Athletics
th_th: วิ่ง

source: Precision Shooting
th_th: ยิงแม่นยำ

source: Vet
th_th: ทหารผ่านศึก

source: Combat Speed
th_th: ความเร็วการต่อสู้

source: Assassination
th_th: การสังหาร

source: Stealth
th_th: ซ่อนเร้น

source: Defence
th_th: ป้องกัน(ตั้งรับ)

source: Dodging
th_th: หลบหลีก

source: Weaponry
th_th: อาวุธ

source: Toughness
th_th: ความทนทาน

source: Heavy weapons
th_th: อาวุธหนัก

source: Blunt
th_th: กระบอง

source: Katanas
th_th: คาตานะ

source: Sabres
th_th: ดาบโค้ง

source: Hackers
th_th: ดาบเจาะเกาะ

source: Martial arts
th_th: ศิลปะการต่อสู้

source: XP rate:
th_th: อัตราค่าประสบการณ์:

source: Attributes
th_th: คุณสมบัติ

source: Derived statistics
th_th: สถิติที่ได้รับ

source: Next Level:
th_th: เลเวลถัดไป:

source: [Affects visible muscle definition]
th_th: [ส่งผลต่อกล้ามเนื้อที่มองเห็นได้ชัดเจน]

source: [Slightly affects muscle definition]
th_th: [ส่งผลเล็กน้อยต่อกล้ามเนื้อที่มองเห็นได้ชัดเจน]

source: [Affects physical bulk]
th_th: [ส่งผลต่อความหนาของกล้ามเนื้อ]

source: [Negatively affects visible muscle definition]
th_th: [ส่งผลเสียต่อกล้ามเนื้อที่มองเห็นได้ชัดเจน]

source: Racial XP Bonus:
th_th: ค่าประสบการณ์พิเศษสำหรับเผ่า:

source: Stats Affected:
th_th: ค่าสถานะที่ได้รับผลกระทบ:

source: Strength XP rate (walking):
th_th: ค่าประสบการณ์ความแข็งแกร่ง (ขณะเดิน)

source: Attack speed with heavy weapons:
th_th: ความเร็วในการโจมตีของอาวุธหนัก:

source: Chance to break free or resist kidnapping attempts
th_th: โอกาสในการดิ้นหนีระหว่างถูกลักพาตัว

source: Martial arts damage
th_th: ดาเมจของการต่อสู้ด้วยมือเปล่า

source: Strength XP rate (combat):
th_th: ค่าประสบการณ์ความแข็งแกร่ง (ขณะต่อสู้)

source: Ways To Train:
th_th: วิธีฝึก:

source: Carrying people or overloading inventory
th_th: ถือยูนิตต่างๆ หรือ มีสิ่งของที่เกินน้ำหนักในช่องเก็บของ

source: Using a heavier weapon
th_th: ใช้อาวุธที่หนักกว่า

source: Chance to resist stealth knock-outs
th_th: โอกาสในการป้องกันการถูกลอบทำร้าย

source: Toughness current XP rate:
th_th: อัตราค่าประสบการณ์ความทนทานในปัจจุบัน:

source: Knockout time:
th_th: เวลาน็อคเอาท์:

source: Knockout point:
th_th: จุดที่โดนน็อค:

source: Wound deterioration speed:
th_th: ความเร็วในการเสื่อมสภาพของบาดแผล:

source: Amount of damage it takes to stagger you:
th_th: ปริมาณดาเมจที่ทำให้เกิดอาการเซ:

source: Getting hurt, getting beaten up, losing battles
th_th: เจ็บตัว, เจ็บใจ, และแพ้การต่อสู้

source: Not wearing armour, taking more damage
th_th: ไม่ได้สวมใส่ชุดเกราะ, ถูกโจมตีหนักขึ้น

source: Get up and fight instead of playing dead
th_th: ลุกขึ้นสู้แทนที่จะแกล้งตาย

source: Weapon cutting damage
th_th: พลังในการตัดของอาวุธ

source: Rate of fire
th_th: อัตราการยิง

source: Reload speed
th_th: ความเร็วในการเติมลูกกระสุน

source: Attacking with light weapons
th_th: โจมตีด้วยอาวุธเบา

source: Frequency of attacks on opponent
th_th: จำนวนครั้งในการโจมตีเป้าหมาย

source: Chance of attacks not getting blocked
th_th: โอกาศในการโจมตีที่จะไม่โดนป้องกัน

source: Fighting with swords
th_th: สู้ด้วยดาบ

source: Using special training equipment
th_th: ใช้อุปกรณ์การฝึกพิเศษต่างๆ

source: Bonus when fighting opponents stronger than you
th_th: โบนัสจากการสู้เป้าหมายที่แข็งแกร่งกว่า

source: Penalty when fighting opponents weaker than you
th_th: โบนัสจากการสู้เป้าหมายที่อ่อนแอกว่า

source: Chance of blocking incoming attacks
th_th: โอกาศในการบล็อคการโจมตี

source: Blocking incoming attacks
th_th: บล็อคการโจมตี

source: Affects damage
th_th: พลังโจมตีที่ส่งผล

source: Unlocks better techniques
th_th: ปลดล๊อคเทคนิคที่สูงขึ้น

source: Frequency of unarmed attacks on opponent
th_th: จำนวนครั้งในการโจมตีเป้าหมายด้วยมือเปล่า

source: Reduces injury when striking metal
th_th: ลดอาการบาดเจ็บเมื่อโจมตีเกราะเหล็ก

source: Fighting unarmed
th_th: สู้ด้วยมือเปล่า

source: Fighting encumbered (for strength)
th_th: ต่อสู้โดยแบกของหนัก (สำหรับความแข็งแกร่ง)

source: Chance of evading attacks while unarmed
th_th: โอกาศในการหลบหลีกเมื่อสู้ด้วยมือเปล่า

source: Chance of evading attacks while stumbling
th_th: โอกาศในการหลบหลีกเมื่อกะเผลก

source: Dodge XP rate:
th_th: อัตราค่าประสบการณ์การหลบหลีก:

source: (Training hindered by encumbrance)
th_th: (การฝึกซ่อมถูกกีดขวางโดยน้ำหนัก)

source: Getting hit while stumbling
th_th: โดนโจมตีระหว่างกะเผลก

source: Max run speed:
th_th: ความเร็ววิ่งสูงสุด:

source: Current run speed:
th_th: ความเร็็ววิ่งปัจจุบัน:

source: Athletics XP bonus:
th_th: XP โบนัสการวิ่ง:

source: Running fast, with a light inventory
th_th: วิ่งเร็วด้วยสถานะ ขนของเบา

source: Max swim speed:
th_th: ความเร็วว่ายน้ำสูงสุด:

source: Current swim speed:
th_th: ความเร็วว่ายน้ำปัจจุบัน:

source: Swimming around in water
th_th: ว่ายไปรอบๆ

source: First aid skills:
th_th: ทักษะปฐมพยาบาล:

source: Healing people
th_th: รักษาคน

source: Crafting medkits
th_th: ผลิตอุปกรณ์รักษา

source: Amount of damage dealt
th_th: จำนวนพลังโจมตีที่ทำได้

source: Attacking with this specific weapon
th_th: โจมตีด้วยอาวุธเฉพาะนี้

source: Accuracy:
th_th: ความแม่นยำ:

source: Rate of fire:
th_th: อัตราการโจมตี:

source: Using harpoon and crossbow turrets
th_th: ใช้งานฉมวกและป้อมหน้าไม้

source: Using crossbows and ranged weapons
th_th: ใช้งานหน้าไม้และอาวุธระยะไกล

source: Accuracy
th_th: ความแม่นยำ

source: Shooting moving targets:
th_th: ยิงเป้าหมายที่เคลื่อนที่:

source: Using turrets and ranged weapons
th_th: ใช้งานป้อมและอาวุธระยะไกล

source: Friendly fire avoidance:
th_th: หลีกเลี่ยงการยิงพรรคพวก:

source: Accidentally shooting your friends
th_th: ยิงพรรคพวกอย่างไม่ตั้งใจ

source: Stealing items
th_th: ขโมยของ

source: Selling stolen items
th_th: ขายของที่ขโมยมา

source: Stealing things
th_th: ขโมยของ

source: Lock-picking doors & cages
th_th: สะเดาะกลอนประตูและกรง

source: Picking locks/cages
th_th: กำลังสะเดาะล็อค/กรง

source: Special training equipment
th_th: อุปกรณ์ที่ต้องมีการฝึกอย่างพิเศษ

source: Ability to remain undetected while sneaking
th_th: ความสามารถที่ทำให้ไม่ถูกพบเจอเวลาลอบเร้น

source: Avoiding discovery when in disguise
th_th: เลี่ยงการถูกพบเจอเมื่อปลอมตัว

source: Avoiding discovery when you have a bounty
th_th: เลี่ยงการถูกพบเจอเมื่อมีหมายหัว

source: Aided by:
th_th: ช่วยเหลือโดย:

source: Staying in the darkness
th_th: หลบในเงามืด

source: Special gear
th_th: อุปกรณ์พิเศษ

source: Hindered by:
th_th: ถูกขัดขวางโดย:

source: Encumbrance / heavy armour
th_th: น้ำหนักเกิน / เกราะหนัก

source: Wounded legs or torso.
th_th: มีบาดแผลที่ขาหรือกลางลำตัว.

source: Using stealth mode with enemies around
th_th: การใช้โหมด ลอบเร้นกับศัตรูโดยรอบ

source: Stealthy knock-outs:
th_th: น็อคเป้าหมายอย่างลอบเร้น:

source: Chance to successfully kidnap someone
th_th: โอกาศที่จะลักพาตัวเป้าหมายสำเร็จ

source: Chance to break free when being carried away
th_th: โอกาศที่ี่จะหลุดพ้นจากการลักพาตัว

source: Resist knock-out and kidnapping attempts
th_th: ป้องกันอาการสลบและการพยายามลักพาตัว

source: Trying stealthy knock-outs
th_th: ลองน็อคเป้าหมายอย่างลอบเร้น

source: Building things:
th_th: สร้างสิ่งของ :

source: Repairing things:
th_th: ซ่อมแซมสิ่งต่าง ๆ :

source: Building things
th_th: สร้างสิ่งของ

source: Repairing things
th_th: ซ่อมแซมสิ่งต่างๆ

source: Research rate:
th_th: อัตราการวิจัย:

source: Researching things at a research bench
th_th: ทำงานวิจัยที่โต๊ะสำหรับงานวิจัย

source: Doing science
th_th: ใช้เครื่องจักรเกี่ยวกับวิทยาศาสตร์

source: Being sciency
th_th: ทำสิ่งที่เป็นวิทยาศาสตร์

source: Mining:
th_th: ขุดเหมือง:

source: Using machinery:
th_th: ใช้เครื่องจักร:

source: Work hard
th_th: ทำงานหนัก

source: Harvesting speed:
th_th: อัตราการเก็บเกี่ยว:

source: Harvesting yield:
th_th: จำนวนที่เกี่ยวเกี่ยว:

source: Crafting weapons (speed):
th_th: ความเร็วในการสร้างอาวุุธ:

source: Weapon quality:
th_th: คุณอาวุธ:

source: Crafting weapons
th_th: ผลิตอาวุธ

source: Crafting armour (speed):
th_th: ความเร็วในการสร้างชุดเกราะ:

source: Armour quality:
th_th: คุณภาพชุดเกราะ:

source: Crafting armour and parts
th_th: สร้างชุดเกราะและชิ้นส่วน

source: Crafting crossbows (speed):
th_th: ความเร็วในการสร้างหน้าไม้:

source: Crafting crossbow bolts (speed):
th_th: ความเร็วในการสร้างลูกศรหน้าไม้:

source: Crossbow quality:
th_th: คุณภาพหน้าไม้:

source: Crafting crossbows and bolts
th_th: สร้างหน้าไม้และลูกศร

source: Your physical strength determines your ability to use heavy weapons and armour without tiring, and to carry heavy loads, including your wounded comrades. Strength affects the blunt damage you do with heavy weapons, hacking-type blades, and while unarmed. It is trained faster by using heavier weapons in battle, or by travelling around with a very heavy inventory or encumbrance.
th_th: ความแข็งแกร่งทางกายภาพของเจ้า กำหนดความสามารถในการใช้อาวุธหนัก และชุดเกราะได้โดยไม่รู้สึกเหนื่อยล้า นอกจากนี้ยังสามารถแบกสัมภาระน้ำหนักเกิน รวมถึงสหายที่ได้รับบาดเจ็บด้วย ความแข็งแกร่งมีผลต่อความเสียหายแบบทื่อโดยอาวุธหนัก, ดาบประเภทเจาะเกราะ ความเสียหายด้วยมือเปล่า. เจ้าสามารถฝึกฝนได้เร็วขึ้น โดยใช้อาวุธหนักในการต่อสู้ หรือเดินไปรอบ ๆ พร้อมกับสัมภาระที่หนักที่สุด.

source: Toughness is both physical and mental. It's how you survive out in the desert. Physically it's your ability to take a beating and survive. You will also take less damage, and will be less likely to stumble when hit by a weaker attack. Mentally it's an attitude forged from harsh experience. Do you pass out from your wounds like a sissy, or do you force yourself to struggle to your feet again? Do you panic and bleed out or can you stay calm enough to lower your heart rate and let the blood clot? -Bonuses if you are fighting while critically wounded -Once your health drops below your {1} KO point {2}your health becomes critical and you won't be able to get back up again. You will go into a coma and need healing.
th_th: ความทนทาน เป็นทั้ง กายภาพ และ จิตใจ. มันเป็นวิธีให้เจ้ารอดในทะเลทราย. พละกำลัง มันคือ ความสามารถ ของเจ้า ที่จะเอาชนะ และอยู่รอด. เจ้าจะได้รับความเสียหายน้อยลง, และจะมีโอกาสน้อยที่ ร่วง ระหว่างถูกโจมตีโดยดาเมทที่เบากว่า. จิตใจมันเป็นสิ่งที่สร้างขึ้นจากประสบการณ์ที่โหดร้าย. ส่งจากบาดแผลเจ้า เหมือนกับ คนอ่อนแอ, หรือเจ้าจะบังคับตัวเอง เพื่อพยายามแด่เท้าของเจ้าอีกครั้ง? เจ้าจะตื่นตระหนก และ เลือดออก หรือ เจ้าจะสามารถใจเย็นพอ สู่ ลดอัตราการเต้นหัวใจของเจ้ารวมทั้งปล่อยลิ่มเลือด? - หากเจ้าต่อสู้ในขณะที่บาดเจ็บรุนแรงเจ้าจะได้รับโบนัสพิเศษ - เมื่อสุขภาพของเจ้าต่ำกว่า {1} KO point {2} สุขภาพของเจ้าจะกลายเป็นสิ่งสำคัญและเจ้าจะไม่สามารถฟื้นตัวได้อีก เจ้าจะหมดสติและต้องการการรักษา.

source: Dexterity affects the speed and quality of your sword work. Your sword cuts will do more damage, your attacks and blocks will be faster. It also helps with handling and reloading ranged weapons.
th_th: ค่าความชำนาญจะมีผลต่อความเร็วและคุณภาพในการใช้งานดาบ. ดาบของเจ้าจะสร้างความเสียหายได้มากขึ้น, การโจมตีและการบล็อคจะเร็วขึ้น. อีกทั้งยังช่วยในการควบคุมและรีโหลดอาวุธระยะไกล..

source: Your perception affects your general accuracy with all ranged weapons, including your ability to hit far away or moving targets.
th_th: ค่าการรับรู้ของเจ้ามีผลต่อความแม่นยำในการโจมตีทั่วไป ของอาวุธระยะไกลทั้งหมด, รวมถึงความสามารถในการยิงศัตรูที่อยู่ไกลหรือเป้าหมายที่เคลื่อนที่.

source: Affects damage. Katanas are a common weapon, and their quality varies greatly. Most are scavenged goods with a history of owners and barely good for scrap. Masterworks are around however, and their speed and cutting power is un-rivalled by any other blade.
th_th: ผลของความเสียหาย. คาตาคานะเป็นอาวุธที่ใช้กันทั่วไป, และคุณภาพของมันก็แตกต่างกันไป. ส่วนใหญ่จะเป็นกองขยะมีประวัติเจ้าของคนเก่า ที่มีมันไว้ไม่ต่างจากพกขยะไว้. ทั้งยังมีที่เป็นผลงานชิ้นเอก แต่ว่า , ความเร็วและพลังการตัดนั้นไม่สามารถเทียบอาวุธมีคมอื่น ๆ ได้.

source: Affects damage. A sabre is a heavy blade designed for heavy slashing damage. The heavier blade makes them slower and more cumbersome but stronger for blocking with and cutting through armour.
th_th: ผลเสียหาย. ดาบโค้งคือดาบหนักที่ถูกออกแบบมาสำหรับการสร้างความเสียหาย ด้วยการฟันที่รุนแรง. ด้วยดาบที่หนักขึ้นทำให้พวกเขาช้าและยุ่งยากมากขึ้น แต่มีความแข็งแกร่งในการบล็อคและสามารถโจมตีทะลุเกราะได้.
