Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/LC_MESSAGES/main.po
Languages: th_th

source: Buy
th_th: ซื้อ

source: Strength:
th_th: ความแข็งแกร่ง:

source: Dexterity:
th_th: ความชำนาญ:

source: Toughness:
th_th: ความทนทาน.:

source: Melee Attack:
th_th: โจมตีระยะใกล้:

source: Melee Defence:
th_th: ป้องกันระยะใกล้:

source: Labouring:
th_th: ใช้แรงงาน:

source: Farming:
th_th: การเพาะปลูก:

source: Cooking:
th_th: การทำอาหาร:

source: Engineering:
th_th: การก่อสร้าง:

source: Medic:
th_th: การแพทย์:

source: Buying Animals
th_th: ซื้อสัตว์

source: Age:
th_th: อายุ:

source: Gender:
th_th: เพศ:

source: Female
th_th: ผู้หญิง

source: Male
th_th: ผู้ชาย

source: Pay Bounty
th_th: จ่่ายค่าหัว

source: Pay
th_th: จ่าย

source: Faction:
th_th: ฝ่าย:

source: Relations with {1} improved by {2}
th_th: ความสัมพันธ์ กับ {1} เพิ่มขึ้น โดย {2}

source: Relations with {1} decreased by {2}
th_th: ความสัมพันธ์ กับ {1} ลดลง โดย {2}

source: Received
th_th: ได้รับ

source: Sorry, you cannot create female characters in the demo, buy the full game!
th_th: โทษที สร้างตัวละครผู้หญิงไม่ได้ ในตัวเกมทดลอง ต้องซื้อเกมเต็ม!

source: It looks like your squad is a little full.
th_th: ดูเหมือนว่ากลุ่มจะเต็ม.

source: If you want to hire any more men, you will need to buy the full game!
th_th: ถ้าต้องการจ้างทหารเพิ่ม ต้องซื้อเกมเต็ม!

source: Free!
th_th: อิสระ!

source: Paid c.{1}k
th_th: จ่าย c.{1} k

source: Paid c.{1}
th_th: จ่าย c.{1}

source: {1} has been discovered smuggling {2}
th_th: {1} ถูกจับได้ว่ากำลังลักลอบขนของ {2}

source: you
th_th: เจ้า

source: Squads:
th_th: กลุ่ม:

source: Prosperity:
th_th: ความก้าวหน้า:

source: {1} are now hostile towards you
th_th: {1} ตอนนี้มองเป็นศัตรู

source: {1} are no longer hostile towards you
th_th: {1} ตอนนี้เลิกมองแบบศัตรูแล้ว

source: {1} are no longer your ally
th_th: {1} ไม่ใช่พันธมิตรของอีกต่อไป

source: {1} are now your allies
th_th: {1} เป็นพันธมิตรของแล้วตอนนี้

source: War breaks out between {1} and {2}
th_th: เกิดสงครามระหว่าง {1} และ {2}

source: Environment:
th_th: สภาพแวดล้อม:

source: Farmers Skill:
th_th: ทักษะเก็บเกี่ยว:

source: This is the percentage yield of the farm. A lower number means that you get less crops from a harvest. Skillful farmers are important.
th_th: นี่คือ % ของผลผลิตที่ฟารม์นี้จะทำได้ ยิ่งเลขน้อยหมายถึงว่าจะยิ่งเก็บเกี่ยวได้น้อย ฉนั้นชาวนาเก่งๆนั้นเป็นสิ่งจำเป็น.

source: WARNING! Crop yield is too low to be productive, probably the crop is not suitable for this area.
th_th: ระวัง! ผลผลิตออกผลได้แย่มาก ที่นี่ไม่ใช่ที่ที่ดีสำหรับการเพาะปลูก.

source: Crop Yield
th_th: ผลผลิตจากพืชผล

source: Normal Growth Time:
th_th: เวลาปกติในการเจริญเติบโต:

source: Environment Effect:
th_th: ปรากฎการทางสิ่งแวดล้อม:

source: Power:
th_th: พลังงาน:

source: No Water:
th_th: น้ำหมด:

source: Actual Growth Time:
th_th: เวลาที่ใช้ในการเติบโต:

source: Growth Rate
th_th: อัตราการเจริญเติบโต

source: Failed
th_th: ไม่สำเร็จ

source: Growing
th_th: เติบโต

source: Once the plants have grown 100% you can begin to harvest them. Until then all you have to do is make sure the farm has water.
th_th: เมื่อใดที่พืชเจริญเติบโต 100% เจ้าจึงจะสามารถเก็บเกี่ยวได้ สิ่งที่เจ้าสามารถทำได้ตอนนี้คือ ทำให้น้ำเพียงพอแก่การเพาะปลูก.

source: Plant Condition
th_th: สถานะของพืช

source: The health of the plants, it will start to degenerate once they are fully grown, or if they run out of water. If it reaches 0 then the dead plants will have to be cleared and re-planted.
th_th: สถานะความสดของพืชจะลดลงเรื่องๆเมื่อโตเต็มที่หรือขาดน้ำ หากถึง 0 เมื่อไหร่ ผลผลิตจะตายทันที และ ต้องทำการถอนทิ้ง เพื่อ ปลูกใหม่.

source: Number of Plants
th_th: จำนวนพืชผล

source: The number of plants remaining. This number will decrease when you harvest them, or if some pest starts eating them.
th_th: จำนวนพืชที่เหลือ ตัวเลขนี้จะลดลงเมื่อทำการเก็บเกี่ยว หรือ มีพวกปลวกแมลงมาแอบกิน.

source: Time left to harvest
th_th: เวลาเหลือสำหรับการเก็บเกี่ยว

source: Time left to harvest all plants before they go bad.
th_th: เวลาเหลือสำหรับการเก็บเกี่ยวพืชผลทั้งหมดก่อนจะเสีย.

source: Efficiency:
th_th: ประสิทธิภาพ:

source: Workers:
th_th: คนงาน:

source: No workers required until the crop is ready to harvest.
th_th: คนงานยังไม่จำเป็นจนกว่าพืชผลจะพร้อมเก็บเกี่ยว.

source: The soil here is unsuitable for growing crops. This farm is useless.
th_th: ดินที่นี่ไม่เหมาะแก่การเพาะปลูก ฟารม์นี้ไร้ประโยชน์แล้ว.

source: Needs water
th_th: ต้องการน้ำ

source: Out of water. Growth rate will be significantly reduced and your plants may die.
th_th: ขณะนี้น้ำหมด อัตราการเติบโตจะลดลงอย่างฮวบฮาบ และ พืชผลของเจ้าอาจตายได้.

source: Your crops are growing nicely. You don't have to do anything.
th_th: พืชผลมีการเจริญเติบโตที่ดี ตอนนี้ยังไม่ต้องทำอะไร.

source: The output is full. Empty out the items and put them in a storage box or something.
th_th: ผลผลิตเต็ม เอาไอเท็มไปใส่กล่องเพื่อที่จะเก็บของซะ.

source: Ready To harvest
th_th: พร้อมเก็บเกี่ยว

source: Nobody is working at this farm at the present moment, you need to hurry up and harvest them before they die.
th_th: ตอนนี้ไม่มีคนงานทำงานที่ฟารม์นี้ ต้องรีบเก็บเกี่ยวก่อนที่พืชจะเน่า.

source: Harvesting
th_th: เก็บเกี่ยว

source: Working...
th_th: ทำงาน...

source: Your crops are dead. Clear them out to start again
th_th: พืชผลของตาย กำจัดมันออกเพื่อเริ่มเพาะปลูกใหม่

source: Wall termites! - Your base became inaccessible. You need at least 1 gate in your walls.
th_th: กำลังแพงปลวกขึ้น! - ฐานของเจ้าไม่สามารถเข้าได้ เจ้าต้องทำกำแพงใหม่อย่างน้อย 1 อัน.

source: Type:
th_th: ประเภท:

source: Town:
th_th: เมือง:

source: Open to public:
th_th: เปิดเป็นสาธารณะ:

source: Public
th_th: สาธารณะ

source: Private
th_th: ส่วนตัว

source: For sale:
th_th: ส่ำหรับขาย:

source: Broken
th_th: สิ่งก่อสร้างพัง

source: This machine has broken down as a result of damage. Send one of your engineers to repair it.
th_th: เครื่องจักรนี้อยู่ในสภาพแย่มากจากผลของความเสียหาย. ส่งช่างของ 1 คนมาซ่อมแซม.

source: Under construction
th_th: กำลังก่อสร้าง

source: This machine is currently under construction.
th_th: เครื่องจักรกำลังถูกสร้าง.

source: Building is in good condition.
th_th: อาคารมีสภาพดี.

source: Reloading...
th_th: บรรจุกระสุน...

source: Turret is currently reloading.
th_th: ป้อมกำลังบรรจุกระสุน.

source: Unused
th_th: ไม่ได้ใช้งาน

source: Nobody is manning this turret.
th_th: ตอนนี้ไม่มีใครประจำการที่ป้อม.

source: Tracking
th_th: กำลังติดตาม

source: Gunner is tracking a target, about to take a shot.
th_th: พลปืนกำลังติดตามเป้าหมายเพื่อทำการยิง.

source: Ready
th_th: พร้อม

source: Turret is ready to fire.
th_th: ป้อมปราการพร้อมยิง.

source: Condition
th_th: สภาพ

source: Building Condition
th_th: เงื่อนไขในการสร้าง

source: The building is damaged.
th_th: อาคารนี้ได้รับความเสียหาย.

source: The building is in good condition.
th_th: อาคารนี้มีสภาพดี.

source: The building is under construction and at {1,num}% completion.
th_th: อาคารกำลังถูกก่อสร้าง และ จะเสร็จใน {1,num}%.

source: {1} more 'Building Materials' will be needed to complete this construction.
th_th: {1} ต้องการวัตถุดิบในการก่อสร้างมากขึ้นเพื่อที่จะทำให้สิ่งปลูกสร้างเสร็จสมบูรณ์.

source: All necessary materials are ready.
th_th: วัตถุดิบที่ต้องการ พร้อมทั้งหมดแล้ว.

source: Upgrade
th_th: เลื่อนระดับ

source: Upgrades To:
th_th: เลื่อนระดับเป็น:

source: Power
th_th: พลังงาน

source: Downgrade
th_th: ลดระดับ

source: Downgrade To:
th_th: ลดระดับเป็น:

source: PAUSE CONSTRUCTION
th_th: พักการก่อสร้าง

source: [PAUSED]
th_th: [พัก]

source: Door Condition
th_th: สภาพประตู

source: The door is damaged.
th_th: ประตูได้รับความเสียหาย.

source: The door is in good condition.
th_th: ประตูอยู่ในสภาพดี.

source: The door is broken
th_th: ประตูเสียหาย

source: The door is open
th_th: ประตูเปิด

source: The door is closed
th_th: ประตูปิด

source: Open/Close:
th_th: เปิด/ปิด:

source: It will no longer close and needs to be repaired.
th_th: มันจะไม่ปิดอีกต่อไป และ ต้องการการซ่อมแซม.

source: Locked
th_th: ล็อค

source: Unlocked
th_th: ปลดล็อค

source: lvl {1,num}
th_th: ระดับ {1,num}

source: Security:
th_th: ความปลอดภัย:

source: The door is locked and will keep out intruders.
th_th: ประตููนี้ถูกล็อค และ ผู้บุกรุกจะไม่สามารถเข้ามาได้.

source: The door is unlocked.
th_th: ประตูนี้ปลดล็อคแล้ว.

source: Empty
th_th: ว่างเปล่า

source: Training:
th_th: การฝึกฝน:

source: Cost to use:
th_th: ค่าใช้จ่าย:

source: Pay c.{1,num}
th_th: จ่าย c.{1,num)

source: Lock state:
th_th: สถานะล็อค:

source: Lock complexity:
th_th: ความซับซ้อนของกลอน:

source: Level {1,num}
th_th: ระดับ {1,num}

source: Healing bonus:
th_th: โบนัสการรักษา:

source: Max Skill Level:
th_th: ระดับทักษะสูงสุด:

source: This is the maximum skill a person can train up to using this equipment. For anyone higher it is a waste of time.
th_th: นีัคือค่าสูงสุดของอุปกรณ์นี้ที่จะสามารถฝึกความสามารถผู้ใช้ได้ สำหรับใครก็ตามที่ระดับสูงกว่านี้อย่าได้เสียเวลาใช้อุปกรณ์ชิ้นนี้.

source: Max possible efficiency:
th_th: ประสิทธิภาพที่เป็นไปได้สูงสุด:

source: Num workers:
th_th: จำนวนคนงาน:

source: Max efficiency:
th_th: ประสิทธิภาพสูงสุด:

source: This machine is fully automatic.
th_th: เครื่องจักรทำงานอัตโนมัติ.

source: The machine is fully staffed.
th_th: พนักงานคุมเครื่องจักรครบจำนวนแล้ว.

source: The machine is under-staffed.
th_th: ขาดจำนวนพนักงานคุมเครื่องจักร.

source: Power In
th_th: กำลังไฟเข้า

source: If the battery is charging this is the amount of power it is consuming.
th_th: กำลังไฟที่ต้องใช้ในการชาจแบตเตอรี่.

source: Power Out
th_th: กำลังไฟออก

source: The power output when the battery is in use and being drained.
th_th: กำลังไฟที่แบตเตอรี่จ่ายออกมาตอนใช้งาน.

source: Power Stored
th_th: พลังงานสำรอง

source: The amount of power currently stored in the battery for use in emergencies.
th_th: บริมาณพลังงานที่ถูกเก็บไว้ในแบตเตอรี่สำหรับใช้เวลาฉุกเฉิน.

source: Power Output
th_th: กำลังไฟส่งออก

source: Power is switched off.
th_th: หยุดการจ่ายไฟ.

source: Power output is running at maximum.
th_th: กำลังไฟขาออกทำงานเต็มพิกัด.

source: Currently out of fuel, so power output is zero
th_th: ไม่มีเชื้อเพลิง, เท่ากับว่ากำลังไฟขาออกเป็นศูนย์

source: Power output is running at reduced efficiency due to damage.
th_th: ประสิทธิภาพกำลังไฟขาออกลดลงเนื่องจากความเสียหาย.

source: Fuel Consumption
th_th: อัตราการใช้เชื้อเพลิง

source: Fuel is being burned at {1,num}% speed. It will be used up more slowly when less power is being used
th_th: เชื้อเพลิงถูกเผาในอัตรา {1,num}%. มันจะถูกใช้ช้าลงถ้าใช้ไฟฟ้าน้อยลง

source: No Power!
th_th: พลังงานหมด!

source: No power is getting to this machine. You need to build some generators, or fix or fuel your existing ones or something.
th_th: ไม่มีพลังงานสำหรับเครื่องกลนี้. เจ้าต้องสร้างเครื่องปั่นไฟ ไม่ก็ซ่อมแซมหรือเติมพลังงาน หรือ อื่นๆ.

source: Switched Off
th_th: ปิด

source: You have ordered for this machine to remain switched off.
th_th: ออกคำสั่งให้เครื่องจักรนี้คงสถานะปิดการใช้งาน.

source: Inactive
th_th: ไม่ทำงาน

source: Nobody is operating this machine at the moment, so it is not consuming power.
th_th: ตอนนี้ไม่มีใครคุมเครื่องจักรตอนนี้ , จึงไม่ได้ใช้พลังงาน.

source: Battery
th_th: แบตเตอรี่

source: This machine will run off of battery power if the main generators should run low or break down.
th_th: เครื่องจักรนี้จะมีวันหมดแบตเตอรี่ นอกจากเครื่องปั่นไฟหลักมีพลังงานเหลือน้อย หรือ เสียหาย.

source: This machine will NOT run off of battery power if the main generators should run low or break down.
th_th: เครื่องจักรนี้จะไม่มีวันหมดแบตเตอรี่ นอกจากเครื่องปั่นไฟหลักมีพลังงานเหลือน้อย หรือ เสียหาย.

source: This machine is switched On
th_th: เครื่องจักรนี้เปิดการใช้งานแล้ว

source: This machine is switched {1}Off
th_th: เครื่องจักรนี้ {1} ปิดการใช้งานแล้ว

source: This machine is working fine.
th_th: เครื่องจักรนี้ทำงานได้ดี.

source: This machine is working fine, but due to low power is only operating at {1}{2,num}% {3}of its full potential.
th_th: เครื่ื่องจักรนี้ทำงานได้ดี,แต่เนื่องจากพลังงานตํ่าจึงดำเนินงานได้ที่ {1}{2,num}% {3}จากความสามารถแบบเต็มกำลัง.

source: Crafting:
th_th: ประดิษฐ์:

source: Nothing Queued
th_th: ไม่มีอะไรอยู่ในคิว

source: Nothing has been ordered for crafting.
th_th: ยังไม่มีของที่ถูกสั่งให้ทำ.

source: Needs upgrading
th_th: ต้องการการอัพเกรด

source: You are trying to craft something that this craft bench cannot do. It needs upgrading to produce this item.
th_th: เจ้ากำลังสร้างของที่ Craft Bench นี้ทำไม่ได้. เจ้าต้องอัพเกรดมันก่อนถึงจะทำได้.

source: Upgradeable to:
th_th: สามารถอัพเกรดเป็น:

source: Dismantle All:
th_th: ถอดออกทั้งหมด:

source: Dismantle All
th_th: ถอดออกทั้งหมด

source: Iron Quality:
th_th: ภาพของเหล็ก :

source: Stone Richness:
th_th: ความหนาแน่นของหิน:

source: Copper Quality:
th_th: คุณภาพทองแดง:

source: Carbon Quality:
th_th: คุณภาพคาร์บอน:

source: Water Available:
th_th: ปริมาณน้ำที่มีอยู่:

source: Ground Fertility:
th_th: ความอุดมสมบูรณ์ของดิน:

source: The richness of natural {1} present in this location. Anything over 50% is considered good.
th_th: ความอุดมสมบูรณ์ของ {1} ในบริเวณนี้ . ถ้าเกิน 50% ถือว่าดี.

source: Iron under ground:
th_th: เหล็กใต้ดิน:

source: Stone under ground:
th_th: หินใต้ดิน:

source: Copper under ground:
th_th: ทองแดงใต้ดิน:

source: Carbon under ground:
th_th: คาร์บอนใต้ดิน:

source: Water under ground:
th_th: น้ำบาดาล:

source: Switched off
th_th: ปิด

source: This machine is switched off.
th_th: เครื่องจักรนี้ ปิดสวิทช์อยู่.

source: No power
th_th: พลังงานหมด

source: Production queue empty
th_th: ไม่มีคิวผลิต

source: No items have been queued up for crafting, so there is nothing to do.
th_th: ไม่มีคิวผลิต. ก็อะไรไม่ได้นะ.

source: Out of resource
th_th: ทรัพยากรหมด

source: The machine has run out of raw materials to work with. Find some more and fill it up.
th_th: เครื่องจักรนี้ใช้ทรัพยากรหมดแล้ว. หามาเพิ่มและเติม.

source: The machine output is full. Empty out the items and put them in a storage box or something.
th_th: เครื่องจักรนี้ผลิตของจนไม่มีที่วางแล้ว. ย้ายผลผลิตไปไว้ที่อื่นจะได้ทำงานต่อ.

source: This machine needs electricity to function. Build a power generator or windmill.
th_th: เครื่องจักรนี้ต้องการไฟฟ้าเพื่อทำงาน. สร้างเครื่องปั่นไฟ หรือ กังหันลม.

source: No workers
th_th: ไม่มีคนงาน

source: Nobody is working at this machine at the present moment, so nothing is getting done.
th_th: ตอนนี้ไม่มีคนทำงานที่เครื่องจักรนี้. มันก็ไม่มีงานออกมาหรอกนะ.

source: Working
th_th: กำลังทำงาน

source: Out of fuel
th_th: เชื้อเพลิงหมด

source: It has ran out of fuel. Find some more fuel and fill it up.
th_th: เชื้อเพลิงหมดแล้ว. หาเชื้อเพลิงมาเติมใหม่.

source: Fully Charged
th_th: พลังงานเต็ม

source: This battery is fully charged.
th_th: พลังงานแบตเตอรี่เต็มแล้ว.

source: This battery is flat, it needs to be charged up.
th_th: แบตเตอรี่อันนี้ไม่มีพลังงานเหลือ, จำเป็นที่ต้องชาร์จใหม่.

source: Charging
th_th: กำลังชาร์จ

source: This battery is being charged.
th_th: แบตเตอรี่กำลังชาร์จ.

source: Draining
th_th: กำลังลดลง

source: This battery is in use and being drained of its power.
th_th: แบตเตอรี่กำลังถูกใช้งานและพลังงานค่อย ๆ ถูกใช้หมดไป.

source: Stored
th_th: สำรอง

source: This battery is not in use.
th_th: แบตเตอรี่อันนี้ไม่ได้ใช้งาน.

source: No Wind
th_th: ลมสงบ

source: There is currently not enough wind to drive the machine.
th_th: กระแสลมตอนนี้ไม่พอที่จะให้พลังงานเครื่องจักร.

source: Wind
th_th: ลม

source: The current amount of wind.
th_th: ปริมาณลมในปัจจุบัน.

source: Operating wind speed is between {1,num=fix,p=2} mph and {2,num=fix,p=2} mph.
th_th: ความเร็วลมอยู่ระหว่าง {1,num=fix,p=2} mph และ {2,num=fix,p=2} mph.

source: Power output is at maximum.
th_th: การส่งพลังงานอยู่ที่ระดับสูงสุด.

source: Currently not enough wind to generate any power
th_th: ปริมาณลมไม่เพียงพอต่อการสร้างพลังงานใดๆ

source: Wind Speed
th_th: ความเร็วลม

source: The current wind speed
th_th: ความเร็วลมปัจจุบัน

source: Collecting
th_th: กำลังเก็บ

source: Rain is being collected.
th_th: กำลังเก็บน้ำฝน.

source: Not Raining
th_th: ฝนไม่ตก

source: It is not raining. Nothing to collect.
th_th: ฝนไม่ได้ตก ตอนนี้ยังไม่มีอะไรให้เก็บ.

source: Rain strength:
th_th: ความแรงของฝน :

source: Total Metals:
th_th: ทรัพยากรทั้งหมด:

source: ON
th_th: เปิด

source: OFF
th_th: ปิด

source: Active:
th_th: กำลังทำงาน:

source: Warning:
th_th: คำเตือน:

source: Switching on will incinerate the entire inventory!
th_th: การกดเปิดจะเผาสินค้าคงคลังทั้งหมด!

source: Underground water:
th_th: น้ำบาดาล:

source: {1,num} m
th_th: {1,num} เมตร

source: Height:
th_th: ความสูง​:

source: The turrets height above the last target we aimed at.
th_th: ค่าความสูงของป้อมปืน​ที่เล็งไป​ที่กลุ่ม​เป้าหมาย​ล่าสุด​.

source: Height bonus:
th_th: โบนัสของความสูง:

source: The additional penalty to range, speed and power that resulted from having a height difference of {1} below the last target.
th_th: เพิ่มเติมบทลงโทษต่อ ระยะ ความเร็ว และ พลัง เป็นผลจากความสูงที่แตกต่างจาก {1} ด้านล่างกว่าเป้าหมายเดิม.

source: The additional bonus to range, speed and power that resulted from having a height difference of {1} above the last target.
th_th: เพิ่มเติมโบนัสต่อ ระยะ ความเร็ว และ พลัง เป็นผลจากความสูงที่แตกต่างจาก {1} ด้านบนกว่าเป้าหมายเดิม.

source: Default damage:
th_th: ความเสียหายพื้นฐาน:

source: Default range:
th_th: ระยะพื้นฐาน:

source: Default aim speed:
th_th: ความเร็วในการเล็งพื้นฐาน :

source: Power supply:
th_th: พลังงานสำรอง:

source: Condition:
th_th: สภาพ:

source: Wall bonus:
th_th: โบนัสกำแพง:

source: Height advantage:
th_th: ความสูงที่ได้เปรียบ:

source: Total damage:
th_th: ความเสียหายรวม:

source: Total range:
th_th: ระยะรวม:

source: Total speed:
th_th: ความเร็วรวม:

source: Base Accuracy Deviation:
th_th: ค่าพื้นฐานการหักเหความแม่นยำ:

source: User Skill:
th_th: ใช้งานความสามารถ:

source: User Accuracy Deviation:
th_th: การหักเหความแม่นยำของผู้ใช้:

source: The amount of accuracy error, in degrees. Higher numbers are poor, 0 is perfect accuracy.
th_th: จำนวนการหักเหของความแม่นยำหน่วยเป็นองศา ตัวเลขยิ่งสูงยิ่งแย่, 0 คือ แม่นยำอย่างสมบูรณ์.

source: Deviation:
th_th: การหักเห:

source: Range:
th_th: ระยะ:

source: Aim speed:
th_th: ความเร็วการเล็ง:

source: Loaded
th_th: โหลด

source: Base Reload Speed:
th_th: ความเร็วพื้นฐานในการบรรจุ:

source: {1,num=fix,p=2}-{2,num=fix,p=2} seconds
th_th: {1,num=fix,p=2}-{2,num=fix,p=2} วินาที

source: {1,num=fix,p=2} second
th_th: {1,num=fix,p=2} วินาที

source: Don't put grass and meshes in the same foliage layer!
th_th: อย่าใส่หญ้าและตาข่ายในชั้นเดียวกัน!

source: STORAGE
th_th: ที่เก็บของ

source: {1,num} location added to the map.
th_th: ตำแหน่ง {1,num} ถูกเพิ่มลงบนแผนที่.

source: You already know all these locations, no new information can be learned.
th_th: เจ้ารู้จักสถานที่พวกนี้อยู่แล้ว ไม่มีข้อมูลใหม่ที่ต้องรู้.

source: Stealing chance:
th_th: โอกาสขโมย:

source: Illegal goods?
th_th: ของผิดกฎหมายรึเปล่า?

source: No problem!
th_th: ไม่มีปัญหา!

source: ILLEGAL GOODS!
th_th: ของผิดกฏหมาย!

source: NO!
th_th: ไม่!

source: Stolen goods?
th_th: ของขโมยมารึเปล่า?

source: Fencing chance:
th_th: โอกาสปล่อยของโจร:

source: You have a {1}% chance of getting caught selling this stolen item. Fence it anyway?
th_th: มีโอกาส {1}% ที่จะโดนจับหากขายไอเท็มที่ขโมยมานี้. ยังไงก็จะขายของที่ขโมยมาใช่ไหม?

source: Out of trading range.
th_th: เกินระยะซื้อขาย.

source: No room for that item.
th_th: ไม่มีช่องว่างสำหรับไอเท็มนี้.

source: You can't afford that.
th_th: ไม่มีเงินมากพอเพื่อของสิ่งนี้.

source: The shopkeeper can't afford that.
th_th: คนขายไม่มีเงินมากพอเพื่องของสิ่งนี้.

source: That's not for sale.
th_th: ไม่ได้มีไว้เพื่อขาย.

source: Got caught stealing.
th_th: ถูกจับได้ว่ากำลังขโมยของ.

source: Got caught selling stolen item.
th_th: ถูกจับได้ว่าขายของที่ขโมยมา.

source: Target is conscious.
th_th: เป้าหมายรู้ตัวแล้ว.

source: Can't wear that item.
th_th: ไม่สามารถสวมใส่ไอเท็มชิ้นนี้ได้.

source: Item is locked in place.
th_th: ไอเท็มในที่นี้ถูกล็อค.

source: Invalid container type.
th_th: ที่เก็บผิดประเภท.

source: Smugglers only buy illegal goods.
th_th: มีแต่พวกค้าของเถื่อนเเจ้าั้นแหละที่ซื้อของผิดกฎหมาย.

source: Attempted smuggling!
th_th: มีันพยายามขายของเถื่อน!

source: What is that a uniform? I don't want that!
th_th: ชุดนี่มันอะไรวะ ข้าไม่ได้ต้องการมัน!

source: Container cannot be placed here unless it is empty.
th_th: ที่เก็บของไม่สามารถวางตรงนี้ นอกจากตรงนี้จะว่าง.

source: Backpack
th_th: กระเป๋า

source: Weapon I
th_th: อาวุธที่ 1

source: Weapon II
th_th: อาวุธที่ 2

source: Shirt
th_th: เสื้อ

source: Head
th_th: หัว

source: Pants
th_th: กางเกง

source: Armor
th_th: เกราะ

source: Boots
th_th: รองเท้า

source: Belt
th_th: เข็มขัด

source: Inventory
th_th: ช่องเก็บของ

source: Open bag
th_th: เปิดกระเป๋า

source: Arrange
th_th: จัดการ

source: Limbs
th_th: อวัยวะ(แขน,ขา)

source: Max Capacity:
th_th: ความจุสูงสุด:

source: Full
th_th: เต็ม

source: Show research
th_th: แสดงการวิจัย

source: Input
th_th: นำเข้า

source: Output
th_th: ส่งออก

source: Queue...
th_th: คิว...

source: Arms
th_th: แขน

source: Legs
th_th: ขา

source: Money
th_th: เงิน

source: Opens the BUILD menu. Here you can place buildings and start your own outpost anywhere in the world, but you should choose a safe area and check availability of resources using the PROSPECT button. You will also need building materials to finish construction.
th_th: เปิดเมนู สร้าง เจ้าจะเลือกวางสิ่งก่อสร้าง และเริ่มสร้างด่านหน้าไว้ที่ไหนบนโลกก็ได้ แต่เจ้าควรจะหาตำแหน่งที่ปลอดภัย และใช้ปุ่ม คำสั่งตรวจหาแร่ เพื่อตรวจดูทรัพยากรที่ใช้ได้ เจ้าต้องการทรัพยากรก่อสร้างเพื่อจบงานก่อสร้าง.

source: Open character inventory
th_th: เปิดช่องเก็บของ

source: Open character status window
th_th: เปิดหน้าต่างค่าสเตตัสตัวละคร

source: MAP
th_th: แผนที่

source: Open world map
th_th: เปิดแผนที่โลก

source: Open research window
th_th: เปิดหน้าต่างงานวิจัย

source: SQD
th_th: กลุ่ม

source: Open squad management window
th_th: เปิดหน้าต่างการจัดการกลุ่ม

source: Open help window
th_th: เปิดหน้าต่างช่วยเหลือ

source: Floor {1,num}
th_th: ชั้นที่ {1,num}

source: Change the selected floor, use to move to a certain floor of a building, 0 is ground floor (also: Page Down key)
th_th: เปลี่ยนชั้นที่เลือกอยู่ ใช้เพื่อเปลี่ยนเป็นบางชั้นของอาคาร, 0 เป็นชั้นล่าง (หรือกด: Page Down key)

source: Change the selected floor, use to move to a certain floor of a building, 0 is ground floor (also: Page Up key)
th_th: เปลี่ยนชั้นที่เลือกอยู่ ใช้เพื่อเปลี่ยนเป็นบางชั้นของอาคาร, 0 เป็นชั้นล่าง (หรือกด: Page Up key)

source: PAUSED
th_th: พัก

source: Loading...
th_th: กำลังโหลด...

source: Block
th_th: ป้องกัน

source: Hold
th_th: อยู่กับที่

source: Passive
th_th: อยู่เฉยๆ

source: Jobs
th_th: งาน

source: Taunt
th_th: ยั่วยุ

source: Ranged
th_th: ระยะไกล

source: Sneak
th_th: ซ่อนเร้น

source: This will toggle the selected characters into defensive combat mode. When in defensive mode, a character will focus purely on staying alive and will gain 20 to his melee defense skill. However he will not attempt to make any attacks. This is handy for keeping your weaker characters alive when they are outclassed.
th_th: คำสั่งนี้จะทำให้ตัวละครที่เลือกเข้าสู่โหมดป้องกันตลอดเวลา. เมื่ออยู่ในโหมดป้องกัน, ตัวละครจะโฟกัสอยู่กับการเอาตัวรอดและจะได้รับค่าป้องกันการโจมตีระยะใกล้เพิ่มขึ้น 20 หน่วย. อย่างไรก็ตามถ้าในอยู่ในโหมดป้องกัน ตัวละครจะไม่โจมตีเด็ดขาด. คำสั่งนี้เหมาะกับการใช้งานเมื่ออยากให้ตัวละครที่อ่อนแอมีชีวิตรอด เมื่อต้องเจอกันศัตรูที่เก่งกว่า.
