Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Acid rain tough reaction.po
Languages: th_th

source: Acid rain! Take shelter!
th_th: ฝนกรด! หาที่กำบัง!

source: The rain, it's acid! Find cover!
th_th: ฝนนี่เป็นกรด! หาที่หลบเร็ว!

source: My skin, it's burning!... Acid rain!
th_th: ผิวข้าไหม้แล้วว! ... ฝนกรด!

source: Acid rain, find cover!
th_th: ฝนกรด! หาที่หลบเร็ว!

source: Acid rain! Not good...
th_th: ฝนกรด! นี่เริ่มไม่ดีแล้ว...

source: Ow! That burns!
th_th: โอยย! ข้าไหม้แล้ว!

source: Ouch, that stings!
th_th: โอ๊ยย เจ็บนะเฟ้ย!

source: /AAH/, feels like daggers on my skin!
th_th: /AAH/, เหมือนโดนมีดกรีดเลย!

source: /OHSHIT/!... Acid rain!
th_th: /OHSHIT/!... ฝนกรด!!

source: /IWE/ need to take cover.
th_th: /IWE/ ต้องหาที่กำบังแล้ว

source: Take cover!
th_th: หาที่กำบัง!

source: Burning rain...
th_th: ฝนที่แสบร้อน...

source: My skin... The rain is burning right through me...
th_th: ผิวข้า... ฝนนี้กัดผิวของข้า...

source: The rain here burns like fire...
th_th: ฝนที่ี่นี่แสบร้อนเหมือนไฟเลย...

source: Kch. Burning... This is no normal rain...
th_th: ชิ เนื้อไหม้แล้ว...นี่ไม่ใช่ฝนธรรมดา...

source: Rrgh. Burning rain, it's eating through my skin...
th_th: อึกก ฝนกรด, มันกัดผิวข้า...

source: This is no ordinary rain... It burns like fire.
th_th: นี่ไม่ใช่ฝนธรรมดา...มันเผาเหมือนไฟเลย

source: /IWE/ must take shelter.
th_th: /IWE/ ต้องหาที่กำบังแล้ว

source: /IWE/ need to take shelter, quickly.
th_th: /IWE/ ต้องหาที่กำบังแล้ว เร็วเข้า!

source: My skin! It's /FUCKING/ fizzing! FIZZING!
th_th: ผิวข้า! มันเริ่มพุพองแล้ว /FUCKING/!

source: /WHATTHEFUCK/ /BULLSHIT/ is this?! My skin's burning holes!
th_th: /WHATTHEFUCK/ /BULLSHIT/ นี่มัน?! เนื้อข้าเป็นรูแล้ว!!

source: /ARG/! Feels like daggers on my skin!
th_th: /ARG/! เหมือนมีดกรีดเนื้อเลย!

source: My skin, MY BEAUTIFUL SKIN!
th_th: ผิวของข้า ผิวที่งดงามของข้าาาา!

source: /AAH/, burning!... Protect my face!
th_th: /AAH/ไหม้แล้ว! ปกป้องใบหน้าข้าด้วย!

source: Acid rain! Take cover!
th_th: ฝนกรด! หาที่หลบเร็็ว!

source: Ragh!
th_th: แม่งเอ๊ย!

source: Burns!
th_th: พองหมดละ!

source: Ow!
th_th: โอววววว!
