Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Acid feet tough.po
Languages: th_th

source: My feet! I need shoes!
th_th: เท้าของข้า!! ข้าต้องการรองเท้า!!

source: My feet are burning!
th_th: เท้าของข้ากำลังไหม้เกรียม!

source: /AAH/! My feet!
th_th: /AAH/! เท้าของข้า!!

source: My feet! The pain!
th_th: เท้าข้า!! เจ็บเหลือเกิน!!

source: My feet! The pain is killing me!
th_th: เท้าข้า!! เจ็บแทบตายแล้ว!!

source: Mercy me! My feet are burning up!
th_th: ได้โปรดเถอะ!! เท้าของข้ากำลังไหม้เกรียม!!

source: Damn! My feet, they're burning!
th_th: ให้ตายเถอะ!! เท้าของข้า ไหม้หมดแล้ว!

source: /ARG/, my feet!
th_th: /AAH/!, เท้าข้า!

source: Feels like they're about to melt right off!
th_th: รู้สึกเหมือนว่ากำลังจะละลายหายไป!

source: Feels like the ground is on fire!
th_th: รู้สึกเหมือนกับพื้นกำลังติดไฟ

source: Keep walking barefoot like this and I won't have any feet left to walk on!
th_th: เดินเท้าเปล่าต่อไปแบบนี้ข้าคงไม่เหลือเท้าสักข้างไว้เดินต่อไปแน่!

source: I can't take this much longer... The ground is eating away my feet!
th_th: ข้าทนต่อไปไม่ไหว.....พื้นกำลังกัดกินเท้าข้า!

source: I can't go on like this, my feet are melting!
th_th: ข้าไปต่อสภาพนี้ไม่ได้แน่, เท้าข้ากำลังละลาย!

source: I need to get off this ground! It's melting my skin off!
th_th: ข้าต้องออกจากที่ตรงนี้! มันกำลังละลายผิวข้าออก!

source: I CAN HEAR MY SKIN FIZZING! SKIN ISN'T SUPPOSED TO FIZZ!
th_th: ข้าได้ยินเสียงซ่ามาจากผิวข้า! ผิวไม่ควรจะซ่าสิ!

source: I CAN HEAR MY FEET SIZZLING! PEOPLE AREN'T SUPPOSED TO SIZZLE!
th_th: ข้าได้ยินเสียงเท้าดังฉ่า! คนเขาไม่ควรมีเสียงร้อนฉ่านะ!

source: I need my skin! I like my skin! Get me off'a this acid hell-soil!
th_th: ข้าต้องการผิวข้า! ข้าชอบผิวข้า! เอาข้าออกไปจากดินกรดนรกนี่!

source: The ground's made of /FUCKING/ acid!
th_th: ไอ้พื้นนี่มันทำมาจากกรด /FUCKING/!

source: /FUCKING/ acid soil! At this rate I'll have no feet left!
th_th: ไอ้ดินกรด/FUCKING/! ขืนเป็นงี้เท้าข้าไม่เหลือแน่!

source: Abort! I need shoes!
th_th: หยุดที! ข้าต้องการรองเท้า!

source: This isn't good. I won't make it far on this ground...
th_th: ท่าจะไม่ดี. ข้าไปไหนไม่ได้ไกลแน่จากพื้นนี้.......

source: This acid... I don't know how much longer I can last like this...
th_th: กรดนี่... ข้าไม่รู้ว่าจะอยู่ได้อีกนานแค่ไหน...

source: Keep walking on this ground and I'll have no skin left...
th_th: เดินบนพื้นนี้ต่อไปแล้วข้าก็จะไม่มีผิวหนังเหลือ...

source: This ground ain't made for bare feet... I need shoes...
th_th: พื้นนี่ไม่ได้สร้างมาเพื่อเท้าเปล่า... ข้าจำเป็นต้องมีรองเท้า...

source: I can't keep walking on this... I need my skin on my feet...
th_th: ข้าไม่สามารถเดินบนนี้ต่อได้... ข้ายังจำเป็นต้องมีหนังเท้าอยู่...

source: This acid is eating through my feet like it's a banquet...
th_th: กรดนี่มันกินเท้าข้าอย่างกับเป็นงานเลี้ยงงั้นล่ะ...

source: Walking barefoot on acid... Great idea...
th_th: เดินเท้าเปล่าบนกรด... ฉลาดล้ำจริงๆ...

source: Who's wise idea was it to walk across acid soil barefooted...?
th_th: ใครมันช่างฉลาดล้ำขนาดเดินบนพื้นกรดด้วยเท้าเปล่ากันนะ...?

source: The ground burns the skin right off my soles!
th_th: พื้นนี่มันเผาแผ่นเท้าให้ลอกออก!

source: Pain! My feet are being burned!
th_th: เจ็บเหลือเกิน! เท้าข้ากำลังโดนเผา!

source: Burning! /IWE/ need boots!
th_th: ร้อน! /IWE/ ต้องการรองเท้า!

source: This ground... it is cooking my feet as we speak...
th_th: พื้นนี่... มันกำลังต้มเท้าของเรา...

source: Rrgh!... Bare feet aren't meant for these soils...
th_th: อ๊ากก!... เท้าเปล่ามันไม่ได้เหมาะกับพื้นนี่เลย...

source: Kch!... My feet... the pain...
th_th: อึก!... เท้าข้า... เจ็บเหลือเกิน...

source: /IWE/ need to move off this ground, quickly.
th_th: /IWE/จำเป็นต้องออกไปจากที่นี่ ให้เร็วเลย

source: /IWE/ need to find new ground, fast.
th_th: /IWE/จำเป็นต้องหาพื้นที่ใหม่ ให้เร็ว

source: /IWE/ should go no further, /MYOUR/ skin won't last the journey.
th_th: /IWE/ ไม่ควรไปต่อ ผิวหนัง /MYOUR/ ไม่รอดไปถึงปลายทางแน่

source: /OHSHIT/, my feet! They're on fire!
th_th: /OHSHIT/, เท้าข้า! มันกำลังลุกไหม้!

source: /WHATTHEFUCK/ is up with this place!? The ground's on fire!
th_th: ที่นี่มัน /WHATTHEFUCK/ !? พื้นมันลุกไหม้!

source: /AAH/, that stings like bitch!... Are you /FUCKING/ kiddin' me, nature? Acid soil!?
th_th: /AAH/ เจ็บสัสหมา!... /FUCKING/ นี่ล้อเล่นรึเปล่าเนี่ยเจ้าธรรมชาติ? ดินกรดเนี่ยนะ?

source: /OHSHIT/, my feet! They're burning!
th_th: /OHSHIT/ เท้าข้า! มันกำลังลุกไหม้!

source: /OHSHIT/, my feet! They're melting!
th_th: /OHSHIT/ เท้าข้า! มันกำลังละลาย!

source: /AAH/! My feet! The ground's made of /FUCKING/ acid!
th_th: /AAH/! เท้าข้า! พื้นนี่มันสร้างมาจากกรด /FUCKING/

source: *Heave* *Heave*... My feet! My feet! It burns!
th_th: *แฮ่ก* *แฮ่ก* ...เท้าข้า! เท้าข้า! มันไหม้!

source: *Sniff* *Sniff*... /OI/, what's cookin'?
th_th: *กระซิก* *กระซิก*... /OI/ อะไรกำลังสุกวะ?

source: M... ME! My feet are being cooked! I need shoes! Get me some /FUCKING/ shoes!
th_th: ข...ข้า! เท้าข้ากำลังจะสุกแล้ว! ข้าต้องการรองเท้า! /FUCKING/ เอารองเท้ามา!
