Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Ally talk to moll .po
Languages: th_th

source: Whew, /YOURNAME/, you really did a number on Stack!
th_th: ว้าว /YOURNAME/ เจ้าเก็บยอดไปได้เยอะเลยนี่!

source: And it looks like we weren't the only ones waiting to attack the Holy Nation. They've got their hands full fending off the Shek from the south after the defences were left open... A perfect distraction while we attack Okran's Shield, don't you think? Taking out Valtena will hit their military numbers even more so that we can finally take back Blister Hill...
th_th: ดูเหมือนว่าพวกเราจะไม่ใช่พวกเดียวที่จ้องจะโจมตี Holy Nation นะ แค่ที่พวกมันต้องรับมือพวก Shek ทางทิศใต้หลังจากที่แนวป้องกันโดนถล่มก็คงเต็มกลืนแล้ว... เป็นตัวเบี่ยงเบนความสนใจที่ดีเลยระหว่างที่เราจะบุกเข้าไปโจมตี Okran's Shield เจ้าว่ามั้ย? จัดการ Valtena ก่อนจะทำให้พวกมันเสียขวัญ เราจะได้ยึด Blister Hill คืนได้ง่ายขึ้น...

source: When you're ready to take down Valtena, talk to my ninjas, /YOURNAME/.
th_th: ถ้าเจ้าพร้อมจะไปจัดการ Valtena เมื่อไหร่ คุยกับนินจาของข้าได้เลยนะ /YOURNAME/.

source: Whew, /YOURNAME/, you really did a number on Okran's Shield!
th_th: วู้ว /YOURNAME/ เจ้าสอยพวก Okran's Shield ไปได้เยอะเลยนี่!

source: While the military are still regrouping and licking their wounds, this is our chance to stir things up. Next we take out their southern defensive position: Stack.
th_th: นี่เป็นโอกาสที่เราจะก่อความวุ่นวายระหว่างที่กองทัพของพวกมันกำลังจัดทัพและรักษาผู้บาดเจ็บอยู่นะ เราควรตั้งแนวตั้งรับทางทิศใต้ให้เข้มแข็ง.

source: When you're ready to take down Seta, talk to my ninjas, /YOURNAME/.
th_th: ถ้าเจ้าพร้อมจะไปจัดการ Seta เมื่อไหร่ คุยกับนินจาของข้าได้เลยนะ /YOURNAME/.

source: The inquisitors are officially out of the Holy Nation!
th_th: ข่าวยืนยันเป็นทางการว่าพวกเจ้าหน้าที่ไต่สวนระดับสูงไม่ได้อยู่ใน Holy Nation!

source: This is it, /YOURNAME/, the Phoenix' oppression is finally over and he's quaking in his holy boots... We're coming for him. We're ready to take back Blister Hill.
th_th: ใช่เลย /YOURNAME/ การกดขี่ของ Pheonix กำลังจะจบสิ้นลง มันคงกำลังตัวสั่นงั่ก ๆ อยู่แหงเลย... เราจะไปจัดการมัน ได้เวลายึด Blister Hill คืนแล้ว.

source: When you're ready to attack the Phoenix, talk to my ninjas, /YOURNAME/.
th_th: ถ้าเจ้าพร้อมจะไปจัดการ Phoenix เมื่อไหร่ คุยกับนินจาของข้าได้เลยนะ /YOURNAME/.

source: The Valleys of Okran belong to the people now... Thanks to you, /YOURNAME/...
th_th: Valley of Okran กลับมาเป็นของประชาชนแล้ว...ต้องขอบคุณเจ้ามาก ๆ เลย /YOURNAME/...

source: And me, of course... *snort*
th_th: แน่นอน ต้องขอบคุณข้าด้วย... *หึหึ*

source: The reign of the Holy Nation had to end some day. I'm just glad you and I could be the ones to do it...
th_th: ระบอบการปกครองของ Holy Nation ต้องจบลงในวันหนึ่ง ข้ายินดีมากที่เจ้ากับข้าคือคนที่ปิดฉากมันลงได้...

source: Rot in the abyss, Phoenix.
th_th: เน่าตายในนรกไปเถอะ Phoenix.

source: The people of Blister Hill couldn't handle the downfall of their 'invincible' god lord. I guess you've seen the ruins, /YOURNAME/?
th_th: ประชาชนของ Blister Hill ยังรับไม่ได้กับความพ่ายแพ้ของ 'พระเจ้าผู้ไร้เทียมทาน' เจ้าคงเห็นซากปรักหักพังพวกนั้นแล้วใช่มั้ย /YOURNAME/?

source: But we can't take the capital for ourselves just yet. It's too dangerous, the high inquisitors' armies still patrol Okran's Pride in heavy force. Seta and Valtena are distracted by the invading Shek but they're still holding up the fort without the Phoenix...
th_th: แต่พวกเรายังบุกยึดเมืองหลวงไม่ได้ อันตรายเกินไป กองทัพของเจ้าหน้าที่ไต่สวนระดับสูงยังเดินยุ่บยั่บอยู่ใน Okran's Pride Seta กับ Valtena ถูกหันเหความสนใจเพราะกองทัพ Shek ที่บุกเข้าโจมตี แต่พวกเขาก็ยังคงรักษาป้อมไว้ได้แม้จะไม่มี Phoenix ก็ตามที...

source: But we can't take it for ourselves just yet. It's too dangerous, the high inquisitors' armies still patrol Okran's Pride in heavy force. Valtena is holding up the fort without the Phoenix. He's distracted by the invading Shek, but the battlefield is raging on...
th_th: แต่พวกเรายังบุกไม่ได้ อันตรายเกินไป กองทัพของเจ้าหน้าที่ไต่สวนระดับสูงยังเดินยุ่บยั่บอยู่ใน Okran's Pride Valtena ยังคงรักษาป้อมไว้ได้แม้จะไม่มี Phoenix เขาถูกหันเหความสนใจเพราะกองทัพ Shek ที่บุกเข้าโจมตี สมรภูมิยังดุเดือดอยู่...

source: But we can't take it for ourselves just yet. It's too dangerous, the high inquisitors' armies still patrol Okran's Pride in heavy force. Seta is holding up the fort without the Phoenix. He's distracted by the invading Shek, but the battlefield is raging on...
th_th: แต่พวกเรายังบุกไม่ได้ อันตรายเกินไป กองทัพของเจ้าหน้าที่ไต่สวนระดับสูงยังเดินยุ่บยั่บอยู่ใน Okran's Pride Seta ยังคงรักษาป้อมไว้ได้แม้จะไม่มี Phoenix เขาถูกหันเหความสนใจเพราะกองทัพ Shek ที่บุกเข้าโจมตี สมรภูมิยังดุเดือดอยู่...
