Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/almost woke up.po
Languages: th_th

source: Hmm? What?
th_th: ฮืมม? อะไรเหรอ?

source: Ah!
th_th: อาห์!

source: Hmmm....
th_th: อืม.....

source: What is...
th_th: อะไรวะ...

source: ...more drink....
th_th: ...อีกแก้ว...

source: I'm not a /INSULT/...
th_th: ข้าไม่ใช่ /INSULT/...

source: Teddy? Teddy....
th_th: Teddyหรอ Teddy....

source: Ah?.. Ah...
th_th: อ๊ะ?... อา...

source: Mmm... num...
th_th: อือ... อืม...

source: *SNORE*
th_th: *ครอกฟี้*
