Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Anti slaver sees enemy faction player.po
Languages: th_th

source: For every slave that's ever suffered at the hands of people like you...
th_th: นี่สำหรับทาสทุกคนที่ต้องทุกข์ทรมานด้วยน้ำมือของคนอย่างพวกเจ้า...

source: More Empire boot lickers...
th_th: มีไอ้พวกประจบประแจงจักรวรรดิมาเพิ่มอีกแล้ว...

source: /FUCKING/ slavers...
th_th: /FUCKING/ ไอ้พวกขายทาส...

source: I smell a /FUCKING/ slaver...
th_th: ข้าได้กลิ่นพ่อค้าทาส /FUCKING/

source: Fuck the slavers...
th_th: ไปตายซะไอ้พวกค้าทาส...

source: Know what I hate more than the stinking gutters?... Slavers.
th_th: รู้มั้ยว่าข้าเกลียดอะไรมากกว่ากองขยะเหม็นโฉ่? ...พ่อค้าทาสไง.

source: Feeling safe under the Empire's protection, pawn?
th_th: อยู่กับพวกจักรวรรดิแล้วรูู้้สึกปลอดภัยเหรอ ไอ้ลิ่วล้อ?

source: Stinking slavers...
th_th: พ่อค้าทาสเหม็นหึ่ง...

source: Slavery will end... and it will end with people like you...
th_th: ระบบทาสต้องยุติ...และมันจะยุติไปพร้อม ๆ กับคนแบบพวกเจ้า...

source: Chew on THIS!
th_th: เอานี่ไปเคี้ยวซะ!

source: Choke on THIS!
th_th: สำลักไอ้นี่ซะ!

source: Choke on my fist!
th_th: สำลักหมัดข้าซะ!

source: Taste the fist of freedom, slaver!
th_th: ลิ้มรสหมัดแห่งอิสรภาพซะ ไอ้พ่อค้าทาส!

source: Call it what you want, Okranite. Rebirth is slavery...
th_th: เจ้าจะเรียกมันว่าอะไรก็เรียกเถอะ ชาว Okranite Rebirth คือระบบทาสชัด ๆ...

source: Open your eyes, god-lover. Rebirth and slavery are the same...
th_th: จงเงยหน้าและเปิดตาพินิจดู ผู้รักพระเจ้าทั้งหลาย Rebirth กับระบบทาสมันก็เรื่องเดียวกันนั่นแหละน่า...

source: Slavery in the name of god is still slavery, Okranite...
th_th: ระบบทาสเพื่อพระเจ้า มันก็ยังเป็นระบบทาสนะโว้ย ชาว Okranite...

source: And slavery ends with the Holy Nation!
th_th: และระบบทาสจะจบสิ้นไปพร้อมกับ Holy Nation!

source: And Anti Slavers don't LIKE slavers!
th_th: และเรา กลุ่มต่อต้านการค้าทาส ไม่ชอบพ่อค้าทาสเฟ้ยยย!

source: And, as an Anti Slaver, you're gonna eat my fist!
th_th: และ ในฐานะที่ข้าเป็น กลุ่มต่อต้านการค้าทาส เจ้าจงลิ้มรสหมัดของข้าซะ!

source: And all slavers can go fuck 'emselves!
th_th: พวกพ่อค้าทาสจงไปตายห่านซะให้หมดนั่นแหละ!

source: For Tinfist!
th_th: เพื่อ Tinfist!

source: This one's for Tinfist!
th_th: ใช่ เจ้าอาจจะเอาชนะ Tinfist ได้...

source: We won't forget.
th_th: พวกเราจะไม่มีวันลืม.

source: This one's for you, Tinfist!
th_th: นี่เพื่อท่าน. Tinfist!

source: This one's for Old Grey!
th_th: นี่เพื่อ ผู้เฒ่า Grey!

source: This one's for you, Grey!
th_th: นี่เพื่อท่าน. Grey!

source: This one's for Big Bo!
th_th: นี่เพื่อ Big Bo!

source: Be at peace, Bo.
th_th: ไปสู่สุคติเถิด Bo.

source: This one's for you, Bo!
th_th: นี่เพื่อท่าน Bo!

source: Be at peace, Jaegar.
th_th: ไปสู่สุคติเถิด Jaegar!.

source: This one's for you, Jaegar!
th_th: นี่เพื่อท่าน Jaegar!

source: Beating a ninja into the sand is an impressive feat, /YOURNAME/...
th_th: น่าทึ่งมากที่เจ้าเอาชนะนินจาจนมันนอนจมกองทรายได้ /YOURNAME/...

source: Takes skill to beat down a ninja, /YOURNAME/, I'll give you that...
th_th: การล้มนินจานี่ต้องใช้ฝีมือมากนะ /YOURNAME/ ข้าขอชื่นชมเจ้า...

source: You kicked my ass last time, /YOURNAME/. I'm impressed...
th_th: ครั้งที่แล้วที่เจ้าชนะข้าได้เนี่ย /YOURNAME/ ข้าประทับใจมาก...

source: I'm still seeing stars from last time, /YOURNAME/...
th_th: ข้ายังเห็นดาวอยู่เลยนะ /YOURNAME/

source: I'm still feeling the bruises from our last encounter, /YOURNAME/...
th_th: ข้ายัังรู้สึกถึงแผลฟกช้ำจากการต่อสู้กับเจ้าคราวก่อนอยู่เลย /YOURNAME/...

source: Really did a number on my insides last time, /YOURNAME/...
th_th: คราวก่อนเจ้าทำข้าช้ำในจริงจังเลยนะ /YOURNAME/...

source: You make for a good challenge.
th_th: เจ้าเป็นคู่ประมือที่เจ๋งมาก.

source: You make for a fun fight.
th_th: เจ้าเป็็นคู่ต่อสู้ที่ทำให้ข้าสนุกมาก.

source: You're one hell of an opponent to have.
th_th: เจ้าเป็นคู่มือที่สุดยอดเลยล่ะ.

source: ... But you're still an asshole.
th_th: ...แต่เจ้าก็ยังเป็นไอ้ตูดหมึกอยู่ดีอ่ะ.

source: ... But I still don't like you.
th_th: ...แต่ข้าก็ยังไม่ชอบหน้าเจ้าว่ะ.

source: ... But you're still a shit eater.
th_th: ...แต่เจ้าก็็ยังเป็นไอ้พวกน่ารังเกียจอยู่ดี.

source: Still alive?
th_th: ยังไม่ตายอีกเรอะ?

source: Still walking after our last fight?
th_th: หลังจากสู้กับข้าคราวที่แล้ว เจ้ายังเดินไหวอีกเรอะ?

source: Looks I didn't finish the job last time, eh?
th_th: ครั้งที่แล้วเหมือนข้าจะทำงานไม่สำเร็จสินะ. ?

source: You're a tough nut to crack...
th_th: เจ้านี่อึดแท้...

source: You're a stubborn asshole, I'll give you that...
th_th: เจ้ามันไอ้ตูดหมึกหัวดื้อ ข้ายอมรับเลย...

source: *sigh*... Why are all the assholes so bad at dying?
th_th: *เฮ้อ*... ทำไมไอ้ตูดหมึกพวกนี้มันตายยากนักหว่า?

source: Guess I'll need to use some extra muscle this time!
th_th: เหมือนข้าต้องออกแรงมากขึ้นอีกหน่อยแล้วล่ะ!

source: Sometimes it just takes some extra elbow grease!
th_th: บางครั้งมันก็ต้องมียืดเส้นยืดสายกันหน่อย!

source: This time you won't be standing up again so easy!
th_th: ครั้งนี้เจ้าคงลุกขึ้นยากหน่อยนะ!
