Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Anti slaver sees wounded ally .po
Languages: th_th

source: Watch over /HIM/...
th_th: ดูแล/HIM/ ด้วย...

source: Hang back and keep an eye on /HIM/.
th_th: รอหน่อยแล้วคอยจับตาดู/HIM/ด้วย.

source: We're not leaving /HIM/ like this...
th_th: เราจะไม่ปล่อย/HIM/ไว้แบบนี้...

source: What have you got yourself into this time, /YOURNAME/?
th_th: คราวนี้เจ้าไปทำเรื่องอะไรมาล่ะ /YOURNAME/?

source: Tsk tsk. Need to take better care of yourself, /YOURNAME/.
th_th: จุ๊ จุ๊ เจ้าต้องดูแลตัวเองให้มากกว่านี้นะ /YOURNAME/ .

source: If /IWE/ leave /HIM/ here alone /HEIS/ gutter lunch.
th_th: ถ้า/IWE/ทิ้ง /HIM/ไว้คนเดียวที่นี่ /HEIS/กลายเป็นมื้อกลางวันของคนในนี้แน่.

source: Look like you could use some help, /YOURNAME/...
th_th: เหมือนเจ้าต้องการความช่วยเหลือนะ /YOURNAME/ ...

source: Need a hand, /YOURNAME/?
th_th: อยากให้ช่วยมั้ย /YOURNAME/?

source: Ouch, you look a mess, /YOURNAME/...
th_th: โอ๊ะ เจ้าดูย่ำแย่ใช้ได้เลยอ่ะ /YOURNAME/...

source: Look like you could use some help, comrade/S/...
th_th: เหมือนว่าเจ้าจะต้องการความช่วยเหลือนะ สหาย?

source: Need a hand, comrade/S/?
th_th: อยากให้ช่วยมั้ย สหาย?

source: Got yourself beat up bad, eh, comrade?
th_th: เจ้าเจ็บตัวใช่ย่อยเลยนี่นา ใช่มั้ย สหาย?

source: We'll stick together a while 'til you're feeling better, eh...
th_th: พวกเราจะอยู่ด้วยซักพัก จนกว่าเจ้าจะรู้สึกดีขึ้นนะ...

source: We'll stick around 'til you ain't looking like death, eh.
th_th: พวกเราจะอยู่ด้วยซักพัก จนกว่าเจ้าจะดูไม่เหมือนคนตายแบบนี้นะ.

source: Stick with /MEUS/ a while, eh.
th_th: อยู่ใกล้ๆ/MEUS/ ไปซักพักนะ.

source: Go it alone like this and you're gutter food.
th_th: ถ้าเจ้ายังสดไปคนเดียว เจ้าได้กลายเป็นอาหารหมูแน่.

source: Go it alone like this and you're scrap metal.
th_th: ถ้าเจ้ายังสดไปคนเดียว เจ้าได้กลายเป็นเศษเหล็กแหง.

source: Your head okay, comrade?
th_th: หัวเจ้ายังไหวอยู่ไหม สหาย?

source: Your arm okay, comrade?
th_th: แขนเจ้ายังไหวอยู่ไหม สหาย?

source: Your leg okay, comrade?
th_th: ขาเจ้ายังไหวอยู่ไหม สหาย?
