Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Anti slaver revenge.po
Languages: th_th

source: Careful!
th_th: ระวัง!

source: On your toes!
th_th: มีสติด้วย!

source: They took down Tinfist, they can take down any one of us...
th_th: พวกมันล้ม Tinfist ได้ มันก็ล้มพวกเราทุกคนได้...

source: But we won't let Tinfist's death be for nothing...
th_th: แต่เราจะไม่ยอมให้ความตายของ Tinfist สูญเปล่า...

source: Tinfist was our only hope... the world's only hope.
th_th: Tinfist เป็นความหวังเดียวของเรา...ความหวังเดียวบนโลกใบนี้.

source: Tinfist was a brave leader in the war for freedom...
th_th: Tinfist เป็นผู้นำที่กล้าหาญในสงครามเพื่ออิสรภาพ...

source: Tinfist was a hero. Tinfist always will be a hero...
th_th: Tinfist เป็นวีรบุรุษ Tinfist จะเป็นวีรบุรุษตลอดไป...

source: But the Anti Slavers won't stop fighting.
th_th: แต่ กลุ่มต่อต้านการค้าทาส จะไม่มีวันหยุดต่อสู้.

source: But the Anti Slavers will never give up.
th_th: แต่ กลุ่มต่อต้านการค้าทาส จะไม่มีวันยอมแพ้.

source: Sure, maybe you defeated Tinfist...
th_th: ใช่ เจ้าอาจจะเอาชนะ Tinfist ได้...

source: So, feeling cocky that you took down Tinfist...
th_th: อ้อ รู้สึกมั่นอกมั่นใจเพราะสามารถล้ม Tinfist ได้สินะ...

source: But can you take on his students?
th_th: แต่เจ้าจะล้มลูกศิษย์ของเขาได้หรือเปล่าล่ะ?

source: But you forgot to finish off his students!
th_th: แต่เจ้าลืมว่ายังมีลูกศิษย์ของเขาอยู่!

source: But you forgot about the rest of us!
th_th: แต่เจ้าลืมว่่ายังมีพวกเราทั้งหมดอยู่!

source: But the Anti Slavers aren't dead yet!
th_th: แต่ กลุ่มต่อต้านการค้าทาส ยังไม่ตายนะเฟ้ย!

source: Vengeance for freedom's warrior!
th_th: แก้แค้นให้วีรชนแห่งอิสรภาพ!

source: Vengeance is ours!
th_th: เราจะแก้แค้น!

source: For the Anti Slavers!
th_th: เพื่อ Anti Slavers!

source: Retribution is alive and real, asshole/S/!
th_th: กรรมตามสนองมีจริงนะเฟร้ยยย ไอ้ตูดหมึก/S/!

source: Time to die, asshole/S/!
th_th: ถึงเวลาตายของเจ้าแล้ว ไอ้ตูดหมึก/S/!

source: It's time to eat fist, asshole/S/!
th_th: เอาหมัดไปกิน ไอ้ตูดหมึก/S/!

source: Choke on fist, asshole/S/!
th_th: สำลักหมัดไปซะ ไอ้ตูดหมึก/S/!

source: Eat my fist, slaver/S/!
th_th: โดนหมัดข้านี่ ไอ้ตูดหมึก/S/!

source: The retribution is real, slaver scum!
th_th: กรรมตามสนองพวกแกแล้ว พ่อค้าทาสสารเลว!
