Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Anti slaver get up fight.po
Languages: th_th

source: Eat knuckle!
th_th: เอาหมัดไปกิน!

source: Heh, call that a weapon?
th_th: หือ เจ้าเรียกนั่นว่าอาวุธเรอะ?

source: Eat boot!
th_th: แดกตีนซะ!

source: Time to knock some heads...
th_th: ได้เวลาฟาดกบาลคนแล้ว...

source: Time to kick some skull...
th_th: ได้้เวลาเตะกบาลคนแล้ว...

source: Round two!
th_th: ต่อรอบสองกันเลย!

source: Call that a beatdown? I'll show you a real beatdown!
th_th: อยากเจอของจริงใช่มั้ย? ข้าจะให้เจ้าได้เห็นของจริง!

source: Heh... call that a weapon, slaver?
th_th: หือ... เจ้าเรียกนั่นว่าอาวุธเรอะ คนค้าทาส?

source: Let's knock some slaver heads...
th_th: ไปฟาดกบาลพ่อค้าทาสกัน...

source: Let's kick some slaver skull...
th_th: ไปเตะกบาลพ่อค้าทาสกัน...

source: Round two...
th_th: ต่อรอบสองกันเลย!

source: How about you eat my boot, slaver...
th_th: แดกตีนข้ามั้ย พ่อค้าทาส...
