Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Anti slavers cheer.po
Languages: th_th

source: Long live /YOURNAME/.
th_th: /YOURNAME/ ขอให้อายุยืนยาวล่ะ.

source: *clap clap clap*
th_th: *ปรบมือ แปะ ๆ ๆ*

source: Hurrah, /YOURNAME/!
th_th: ฮูเร่ /YOURNAME/.

source: Hurrah!
th_th: ฮูเร่!

source: Kudos.
th_th: สรรเสริญ.

source: Kudos, /YOURNAME/.
th_th: สรรเสริญ /YOURNAME/.

source: *thump thump thump*
th_th: *กระทืบเท้า ปึง ปึง*

source: Honored, /YOURNAME/.
th_th: เกียรติยศแด่ /YOURNAME/

source: Thank you, /YOURNAME/.
th_th: ขอบคุณมาก /YOURNAME/.

source: The world will thank you, /YOURNAME/. Whether they know it yet or not.
th_th: โลกใบนี้จะขอบคุณเจ้า /YOURNAME/ ไม่ว่าพวกเขาจะรู้แล้วหรือยังไม่รู้ก็ตาม.
