Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Anti slaver enemy announce.po
Languages: th_th

source: Harm one of our own and you deserve no mercy...
th_th: ทำร้ายคนของเราคนหนึ่ง แล้วเจ้าจะไม่ได้รับความเมตตาใด ๆ...

source: Harm our brethren and we'll show you no mercy...
th_th: ทำร้ายพี่น้องของเราคนหนึ่ง แล้วเจ้าจะไม่ได้รับความเมตตาใด ๆ...

source: For what you did to our comrade, you don't get the privilege of mercy...
th_th: สิ่งที่เจ้าทำกับพวกพ้องของเรา เจ้าจะไม่ได้รับโอกาสเช่นความเมตตา...

source: For Bo!
th_th: เพื่อ Bo!

source: Rot in the dust, /SCUM/!
th_th: จงเน่าไปซะ. /SCUM/!

source: This one's for Bo!
th_th: นี่ทำเพื่อ Bo!

source: An eye for an eye, /SCUM/!
th_th: ตาต่อตาฟันต่อฟัน /SCUM/!

source: For Jaegar!
th_th: เพื่ื่อ Jaegar!

source: This one's for Jaegar!
th_th: นี่ี่เพื่อ Jaegar!

source: For Grey!
th_th: เพื่อ Grey!

source: This one's for Grey!
th_th: นี่เพื่อ Grey!

source: For freedom!
th_th: เพื่ออิสรภาพ!

source: Time to learn what happens when you make enemies with the Anti Slavers, /SCUM/!
th_th: ถึงเวลาที่เจ้าจะได้รู้แล้วว่าอะไรจะเกิดขึ้น เมื่อเจ้าเป็นศัตรูกับกลุ่มต่อต้านการค้าทาส /SCUM/!
