Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/armour king see neutral.po
Languages: th_th

source: Greetings new customer!
th_th: สวัสดีลูกค้าหน้าใหม่!

source: Welcome to Armour King! The greatest armour shop in the world.
th_th: ยินดีต้อนรับสู่ Armour King! ร้านขายเกราะที่เยี่ยมที่สุดในโลก.

source: Armour King has the best selection in the remnants of the world
th_th: Armour King นั้นมีเกราะที่เลิศล้ำที่สุดที่จะเหลืออยู่บนโลกนี้เลยล่ะ

source: My armour is the greatest.
th_th: เกราะของข้านั้นถือเป็นที่สุด.

source: I am Armour King
th_th: ข้าคือ Armour King

source: This shop is called "Armour King", because the armour is the best.
th_th: ร้านนี้ถูกเรียกว่า "Armour King" เพราะเกราะที่นี่นั้นดีที่สุด.

source: Tell your friends that Armour King has the best armour.
th_th: เอาไปบอกเพื่อนๆ เจ้าด้วยล่ะว่า Armour King มีเกราะที่ดีที่สุด.

source: Forgive me for following you, but you look like a thief.
th_th: ขอโทษที่เดินตามเจ้านะ แต่เจ้านี้อย่างกับโจรแน่ะ.

source: I must keep my eye on you so that you are not tempted to steal such amazing armour. Ha ha.
th_th: ข้าต้องจับตาดูเจ้าไว้ เจ้าจะได้ไม่ถูกเกราะสุดเจ๋งนี้ล่อลวงจนขโมยมันน่ะ. ฮ่าฮ่า.

source: You cannot buy better armour anywhere in the world.
th_th: เจ้าไม่มีทางหาซื้อเกราะที่ไหนบนโลกที่ดีกว่านี้ได้แล้ว.

source: I have checked. It took me 67 years.
th_th: ข้าเช็คดูแล้ว. ใช้เวลาไป 67 ปีเชียวล่ะ.

source: I can't blame you if you try to steal my armour, because it is the best.
th_th: ข้าไม่โทษหรอกนะถ้าเจ้าพยายามจะขโมยเกราะข้า เพราะมันของโคตรดีไงล่ะ.

source: You are probably tempted to steal things, I would feel the same in your position.
th_th: เจ้าคงโดนมันยั่วให้ขโมยแน่เลย ถ้าข้าเป็นเจ้าข้าก็คงรู้สึกเหมือนกัน.

source: If you feel the urge to steal, that's okay, it's a natural feeling when presented with such great armour.
th_th: ถ้าเจ้ารู้สึกราวกับโดนกระตุ้นให้ขโมยข้าก็เข้าใจ. เป็นเรื่องปกติอยู่แล้วเมื่ออยู่ต่อหน้าเกราะชั้นยอดอย่างนี้.

source: But I will have to kill you.
th_th: แต่ข้าคงต้องฆ่าเจ้า.

source: I will end you though.
th_th: ไมว่ายังไงข้าก็จะฆ่าเจ้า.

source: Don't though.
th_th: ไม่มีข้อแม้.

source: Now maybe you are thinking, "I should kill Armour King so I can take all his great armour"
th_th: ตอนนี้เจ้ากำลังคิดว่า. "ข้าควรฆ่า Armour King เท่านี้ข้าก็จะได้ครอบครองเกราะชั้นยอดทั้งหมด"

source: I don't recommend this action however.
th_th: ข้าไม่แนะนำให้ทำเช่นนั้นไม่ว่าจะยังไงนะ.

source: You cannot. I am deadly.
th_th: เจ้าทำไม่ได้หรอก ข้านี้ตัวพ่อเลยนะ.

source: You will fail at this.
th_th: สิ่งมีชีวิตเยี่ยงเจ้านั้น ทั้งอ่อนนุ่มและเปราะบางต่อการโดนแทงด้วยวัตถุมีคมนัก.

source: Humans are weak against stabbing
th_th: พวกมนุษย์นั้นอ่อนแอต่อการโดนแทง

source: Some advice: Your soft skins are easily pierced by sharp objects.
th_th: ขอแนะนำเล็กน้อย: ผิวนุ่มๆ ของเจ้าง่ายต่อการโดนของมีคมแทงนัก.

source: Overcome your weakness with armour from the Armour King
th_th: เอาชนะความอ่อนแอของเจ้าด้วยชุดเกราะจาก Armor King สิ

source: Armour King has the solution.
th_th: Armour King มีทางแก้.

source: Armour King! Armour King! Saving Lives! With Armour-ing!
th_th: Armour King! Armour King! ช่วยให้เจ้ารอด! ปลอดภัยด้วยเกราะชั้นเลิศ!

source: Do not mind the Thralls!
th_th: อย่าได้ใส่ใจพวกข้ารับใช้เลย!

source: I retrieved them from the Ashlands
th_th: ข้าเก็บกู้พวกมันมาจาก Ashlands

source: But do not fear! I modified them myself to make them only murderous to armour thieves!
th_th: แต่อย่าได้กลัวไป! ข้าดัดแปลงมันด้วยตนเองเพื่อให้พวกมันสังหารเฉพาะพวกโจรขโมยเกราะ!

source: They are much stronger than normal thralls, but don't let that scare you!
th_th: ถึงพวกมันแข็งแกร่งกว่าข้ารับใช้ทั่วไป แต่อย่าไปกลัวมันเลย!

source: Unless you are a thief...
th_th: ยกเว้นเสียแต่เจ้าจะเป็นโจร...

source: Even though the Thralls have no heads, they are good at spotting thievery! Oh yes!
th_th: ถึงหัวพวกข้ารับใช้จะหลุดไป พวกมันก็ยังเก่งเรื่องตรวจจับการขโมยอยู่ดี! โอ้ ใช่!

source: I gave them special audio sensors. In their hands. That is how they know a thief you see.
th_th: และแน่นอนข้าก็อัพเกรดเกราะให้ด้วย เป็นเกราะที่เจ๋งที่สุดบนโลกนี้!
