Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/armour king talk to.po
Languages: th_th

source: Welcome customer! Would you like to buy the best armour in the world?
th_th: ยินดีต้อนรับคุณลูกค้า! ท่านสนใจซื้อเกราะที่ดีที่สุดบนโลกนี้ไหม?

source: Show me your armour then.
th_th: ขอดูเกราะหน่อย.

source: Can I ask you some questions?
th_th: ขอข้าถามอะไรซักอย่างได้ไหม?

source: Ask me anything, I am an expert in armour
th_th: ถามข้ามาได้เลย ข้าเชี่ยวชาญเรื่องเกราะนัก

source: Ask me your questions about armour
th_th: สงสัยเรื่องเกราะอะไรก็ถามข้ามาเลย

source: I know all about armour
th_th: ข้ารู้เรื่องของเกราะทุกอย่าง

source: What would you like to know?
th_th: เจ้าอยากรู้เรื่องอะไรล่ะ?

source: Another armour question?
th_th: มีคำถามเรื่องเกราะอีกไหม?

source: How did you get here?
th_th: ไปได้มันมาจากไหน?

source: How did you come to set up a shop here?
th_th: ทำไมเจ้ามาเปิดร้านในที่แบบนี้?

source: I started up this shop in the Second Empire town of Catch. It was a thriving market town, growing very strongly, a great place to start anew and craft the greatest armours in the remnants of the world.
th_th: ข้าเริ่มตั้งร้านใน Second Empire town แห่ง Catch มันเป็นเมืองการค้าที่เจริญรุ่งเรืองเติบโตอย่างมั่นคงแข็งแรงเป็นสถานที่ที่เหมาะสำหรับการเริ่มต้นใหม่และสร้างเกราะที่ยิ่งใหญ่ที่สุดในโลกอันเป็นชิ้นๆ นี้.

source: How long ago was that?
th_th: นานเท่าไหร่แล้วเนี่ย?

source: I am proud to say this shop has been up and running for 937 years!
th_th: ข้าภูมิใจมากที่จะพูดว่าร้านนี้เปิดกิจการมา 937 ปีแล้ว!

source: What happened to the town?
th_th: มันเกิดอะไรขึ้นกับเมืองนี้?

source: The Second Empire ran its course. Once everyone was gone, it fell into disrepair.
th_th: Second Empire เคยรุ่งเรือง แต่เมื่อทุกคนหายไปมันก็ตกอยู่ในสภาพทรุดโทรม.

source: But not Armour King! I maintain it well.
th_th: แต่ไม่ใช่กับ Armour King! ข้ายังเปิดกิจการได้อยู่.

source: But how did it end up in this river?
th_th: แต่ทำไมมันถึงกลายมาเป็นแม่น้ำอย่างงี้ล่ะ?

source: *silence*
th_th: *เงียบ*

source: How did the Second Empire end?
th_th: The Second Empire ล่มสลายได้ยังไง?

source: It just sort of rotted and fell apart. A mental disease. Very strange. Not at all like the first empire.
th_th: จู่ ๆ มันก็เสื่อมลงและแตกสลาย เหมือนโรคทางจิตเวช น่าแปลกเหลือเกิน ไม่เหมือนกับตอน first empire เลยแม้แต่น้อย.

source: The First Empire! What happened to that? How did the First Empire end?
th_th: First Empire! เกิดอะไรขึ้นกับมันเหรอ? First Empire ล่มสลายได้ยังไง?

source: Why are you HERE? In a ruin in a river?
th_th: ทำไมนายมาอยู่นี่? ในซากปรักหักพังกลางน้ำเนี่ย?

source: To sell the greatest armour in the remnants of the world.
th_th: ก็เพื่อขายเกราะที่ดีเยี่ยมที่สุดบนโลกที่เป็นชิ้นๆ ใบนี้ล่ะสิ.

source: I mean specifically, in this extremely remote and hidden location? It's a ruin.
th_th: ข้าหมายถึงทำไมต้องเป็นที่ที่ห่างไกลและหลบซ่อนเป็นพิเศษแบบนี้ด้วย? นี่มันซากตึกชัดๆ.

source: The world is a ruin, people dwell and start anew in the ruins and remnants of fallen civilisations. I fail to see any difference in my own behavior.
th_th: โลกนี้คือซากปรักหักพัง. ผู้คนอาศัยอยู่และเริ่มต้นใหม่อีกครั้งในซากปรักหักพังและเศษซากอารยธรรมที่ล่มสลายอยู่แล้วนี่. ข้าไม่เห็นว่าข้าทำต่างจากผู้อื่นตรงไหน.

source: How old are you?
th_th: เจ้าอายุเท่าไหร่แล้ว

source: That's not a polite question to ask a Skeleton
th_th: นั่นเป็นคำถามที่หยาบคายต่อ Skeleton นะ

source: That's a personal question for a Skeleton.
th_th: นี่มันถามเรื่องส่วนตัว Skeleton นะ.

source: Next question...
th_th: คำถามต่อไปล่ะ...

source: That's all.
th_th: หมดแล้ว.
