Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/arrival- cannibal plains.po
Languages: th_th

source: I always thought this place was just a damn story...
th_th: ข้าเชื่อมาตลอดว่าที่นี่เป็นแค่เรื่องเล่าโง่ ๆ...

source: I never thought I'd see this...
th_th: ข้าไม่คิดเลยว่าจะได้เห็นนี่...

source: Oh no, this can't be real...
th_th: โอ้ ไม่นะ นี่มันไม่จริง...

source: We can't really be here.... No way...
th_th: เราอยู่ที่นี่ไม่ได้นะ...ไม่จริงน่า...

source: I never wanted to see this place
th_th: ข้าไม่เคยอยากเห็นที่นี่เลย...

source: Endless cannibals as far as the /GODDAMN/ horizon!
th_th: มนุษย์กินคนจำนวนมหาศาลจนสุดลูกหูลูกตาเลย /GODDAMN/!

source: /FUCKING/ home of the cannibals!
th_th: /FUCKING/ ถิ่นของพวกมนุษย์กินคน!

source: It's the /GODDAMN/ Cannibal Plains!
th_th: ที่นี่คือ Cannibal Plains /GODDAMN/!

source: Man eaters! Stick you in their /GODDAMN/ cages until dinner time!
th_th: ไอ้พวกกินคน มันจะเอาเจ้าไปยัดใส่กรง/GODDAMN/ของมัน จนกว่าจะถึงเวลาอาหารเย็น!

source: They catch you and put you in their /GODDAMN/ cages for dinner time!
th_th: พวกมันจับเจ้าแล้วโยนเจ้าใส่กรง/GODDAMN/ของมัน จนกว่าจะถึงเวลาอาหารเย็น!

source: They eat PEOPLE!
th_th: พวกมันกินมนุษย์!

source: They're not so bad once you get used to them...
th_th: ถ้าเจ้าชินกับพวกมันแล้ว มันก็ไม่แย่เท่าไหร่นะ...

source: There's worse things to encounter than cannibals
th_th: มีเรื่องที่แย่กว่าการที่เจ้าเจอมนุษย์กินคนอีกนะ

source: I don't see what all the fuss is about
th_th: ข้าไม่รู้ว่านี่มันมีปัญหาอะไรนักหนานะ

source: I don't know why people are always so scared of cannibals
th_th: ข้าไม่รู้ว่าทำไมคนถึงได้กลัวมนุษย์กินคนกันนักนะ

source: THAT'S BECAUSE YOU'RE MADE OUT OF /FUCKING/ STEEL!
th_th: นั่นเพราะว่าเจ้าล่ำบึ้กถึกเหมือนเหล็ก/FUCKING/ ยังไงเล่า!

source: YOU'RE MADE OUT OF /FUCKING/ METAL!
th_th: นั่นเพราะว่าตัวเจ้าทำมาจากเหล็ก/FUCKING/ นั่นน่ะสิ!

source: Lots of things eat humans: spiders, beakthings, wolves...
th_th: มีอะไรตั้งเยอะนะที่กินมนุษย์นะ ทั้งแมงมุมเอย beakthing เอย หมาป่าเอย...

source: Do cannibals eat Hivers too?
th_th: พวกมนุษย์กินคน กินชาว Hive มั้ยอ่ะ?

source: Do they eat Hivers?
th_th: พวกเขากินชาวHive มั้ย?

source: Probably, yeah
th_th: เหมือนจะใช่นะ

source: I don't think so...
th_th: ข้าว่าไม่นะ...

source: Maybe, I'm not sure...
th_th: อาจจะนะ ข้าไม่แน่ใจเท่าไหร่...

source: For sure
th_th: จริง ๆ

source: I'm pretty sure they do
th_th: ข้าค่อนข้างมันใจว่าพวกเขากินนะ

source: Nah...
th_th: อ่า...

source: No way. Too skinny and crunchy.
th_th: ไม่มีทาง พวกนั้นผอมไปแถมยังกรอบไปอีกต่างหาก

source: SHUT UP GODDAMNIT!
th_th: หุบปากเดี๋ยวนี้นะ เวรเอ๊ยยยย!

source: Shut up damn you!
th_th: หุบปากนะ ไอ้เวรเอ๊ย!

source: You're enjoying this aren't you!?
th_th: นี่เจ้ากำลังสนุกอยู่ใช่มั้ยเนี่ย!?

source: No, I'm pretty sure it's the Cannonball Plains
th_th: ไม่นะ ข้าค่อนข้างมั่นใจว่ามันคือ Cannonball Plains

source: You guys are panicking over nothing, it's just the Cannonball Plains
th_th: พวกเจ้าขี้ขึ้นสมองอะไรกันน่ะ ที่นี่มันแค่ Cannonball Plains นะ

source: I hate all of you
th_th: ข้าเกลียดพวกเจ้า ทุกคนเลย

source: I give up
th_th: ข้ายอมแพ้แล้ว

source: Ah, the Cannonball Plains. Sounds like a fun place.
th_th: อา Cannonball Plains ฟังดูเหมือนเป็นที่ที่น่าสนุกนะ

source: Are you being serious?
th_th: นี่เจ้าจริงจังเรอะ?

source: Are you making a joke?
th_th: เจ้าล้อเล่นใช่มั้ยเนี่ย?

source: The... the what?
th_th: อ่า...อะไรนะ?

source: The Cannonball Plains! Named after an ancient sport game I believe.
th_th: ข้าคิดว่า Cannonball Plains ตั้งตามชื่อกีฬาแบบโบราณนะ .

source: It's the CANNIBAL PLAINS you /IDIOT/!
th_th: ที่นี่คือ CANNIBAL PLAINS ไอ้/IDIOT/!
