Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Arrogant worlds end adventurer.po
Languages: th_th

source: You there, looking for work? I'm leaving on an expedition at dawn tomorrow, I'll need a strong back to carry my equipment. You'll get 3000 Cats upfront and you'll be fed well during your service, how about it?
th_th: เจ้าที่อยู่ตรงนั้นน่ะ หางานอยู่รึ? ข้าจะออกเดินทางสำรวจเช้ามืดวันพรุ่งนี้แหนะ เลยต้องการแรงงานที่แข็งแรงมาแบกของหน่อย ข้าจะจ่าย 3000 cats ล่วงหน้า แล้วก็เลี้ยงอาหารเจ้าตลอดการจ้างงานเลย สนใจมั้ย?

source: I was about to ask you the same thing...
th_th: ข้าก็จะถามเจ้าแบบนั้นเหมือนกัน...

source: Hah! You, an adventurer!? An amateur like you wouldn't last ten minutes navigating uncharted lands! The winged beak ogres would eat you alive! And that's if the cannibals didn't make you run home pissing your pants first, hah!
th_th: ฮ่า! เจ้าเป็นนักผจญภัยเรอะ!? พวกมือสมัครเล่นแบบเจ้าง่อยกระรอกภายใน 10 นาทีหลังเดินทางเข้าไปในดินแดนที่ยังไม่มีใครรู้จักแหง ๆ! พวก winged beak ogres จะกินเจ้าทั้งเป็น! ถ้าพวกมนุษย์กินคนไม่ไล่ตามจนเจ้าฉี่ราดเผ่นกลับบ้านซะก่อนน่ะนะ!

source: Beak ogres? Already killed twenty of 'em. What of it.
th_th: Beak ogres เหรอ? ข้าจัดการไป 20 กว่าตัวแล้ว มันทำไมเหรอ.

source: That's nothing! I've seen and slaughtered fifty of them in my time. Lie harder next time, amateur...
th_th: นั่นเรื่องจิ๊บ ๆ! ตลอดชีวิตของข้า ข้าสอยมันมา 50 กว่าตัวแล้ว ครั้งหน้าโกหกให้เนียนหน่อยนะ เจ้ามือสมัครเล่น...

source: Call me an amateur when you kill your first flame behemoth, sweetie (Walk away)
th_th: ไว้เจ้าจัดการ flame behemoth ตัวแรกให้ได้ก่อน ค่อยเรียกข้าว่ามือสมัครเล่นนะ หนูน้อย (เดินจากไป)

source: Flame behe...? Uh, right, yeah, killed ten of them already.
th_th: Flame behe...? เอ่อ ข้าจัดการไปเป็น 10 ตัวแล้วนะ.

source: To hell with this. I've got more important things to do.
th_th: เรื่องโง่เง่าอะไรกันนี่ ข้ามีเรื่องสำคัญกว่าที่ต้องจัดการนะ.

source: Dogshit. You couldn't even slaughter a swamp raptor with that rusty sword.
th_th: ไอ้ขี้หมาเอ๊ย ดาบสนิมเขรอะเล่มนี้เชือดนกล่าเนื้อใน swamp ไม่ได้ด้วยซ้ำ.

source: Any adventurer would know that a worn sword is the sign of good use! Look, unless you're here to work as my pack gar, I've no interest in wasting my breath on amateurs...
th_th: เหล่านักผจญภัยรู้เสมอล่ะ ว่าดาบโทรม ๆ คือดาบที่ใช้งานได้ดี! เฮ้ ถ้าเจ้าไม่ได้จะสมัครเป็นเบ๊แบกของของข้าละก็ ข้าไม่มีเวลามาคุยกับพวกมือสมัครเล่นหรอกนะ...

source: Bar keep! Bring me another rum, I'm out.
th_th: คนคุมบาร์! เหล้ารัมข้าหมดแล้ว เอามาเพิ่มด้วย.

source: Winged beak ogres? You're full of dogshit.
th_th: Winged beak ogres เหรอ? เจ้านี่ไร้สาระเป็นบ้าเลย.

source: Travel far enough and you'll see them alright. Look like gutters but bigger, and with wings too. Trick is to pull your shit together, see, they're blind but they smell fear. Surviving an encounter with one of those is the true test of a tech hunter with balls of iron...
th_th: ถ้าเดินทางไปไกลระดับหนึ่ง เจ้าจะเห็นพวกมันเองแหละ เหมือนรางน้ำ แต่ใหญ่กว่า มันมีปีกด้วย เจ้าต้องมีสติหน่อยเพราะพวกมันตาบอด แต่จมูกไวกับกลิ่นความกลัวมาก ถ้าเจ้ารอดมาจากการเผชิญหน้านั้นได้คือการพิสูจน์ว่าเจ้าเป็น tech hunter ที่กล้าหาญ...

source: Interesting, where can I find these?
th_th: น่าสนใจแฮะ ข้าจะเจอพวกมันได้ที่ไหน?

source: To the north west, a black valley filled with ruined cities. It's at least a month's journey though, and the path is infested with bandits, cannibals and every kind of wild beast imaginable. You'd be lucky just to make it there in one piece, take my advice and go back home, /OUTLANDER/.
th_th: ไปทางตะวันตกเฉียงเหนือ หุบเขาทมิฬที่เต็มไปด้วยซากเมืองร้าง คงใช้เวลาเดินทางอย่างน้อยเดือนหนึ่งได้ แถมตลอดทางก็มีแต่โจร มนุษย์กินคน แล้วก็พวกสัตว์ประหลาดทุกอย่างที่เจ้าจะสามารถจินตนาการได้เต็มไปหมด ถ้าเจ้าไปถึงที่นั่นโดยยังมีสภาพสมบูรณ์ได้ก็ถือว่าโชคดีมากแล้ว เชื่อข้าเถอะ กลับบ้านไปซะ /OUTLANDER/

source: Ha, right, whatever you say. Maybe lay off the sauce for a while, eh?
th_th: ฮ่า เอาที่เจ้าสบายใจเลย เจ้าน่าจะหยุดกินเหล้าซักพักนะ ว่ามั้ย?

source: Look, unless you're here to work as my pack gar, I've no interest in wasting my breath on amateurs...
th_th: ถ้าเจ้าไม่ได้จะสมัครเป็นเบ๊แบกของของข้าละก็ ข้าไม่มีเวลามาคุยกับพวกมือสมัครเล่นหรอกนะ...

source: I'm leaving. I don't have time for your nonsense stories.
th_th: ข้าไปล่ะ ไม่มีเวลามาฟังเรื่องไร้สาระของเจ้าแล้ว.

source: I don't have time for this...
th_th: ข้าไม่มีเวลาจริง ๆ นะ

source: Hah, thinks /HEIS/ an adventurer...
th_th: ฮ่า /HEIS/ คิดว่าตัวเองเป็นนักผจญภัยล่ะ...

source: What?! That's my line!
th_th: เฮ้ นั่นมันคำพูดของข้านะ!

source: Do I look like a goddamn pack gar to you?
th_th: ข้าดูเหมือนเบ๊แบกของของเจ้าตรงไหนหา?

source: Well, you certainly don't look like an adventurer, so why else would you be at World's End? An amateur like you wouldn't last ten minutes navigating uncharted lands! The winged beak ogres would eat you alive, and that's if the cannibals didn't make you run home pissing your pants first, hah!
th_th: อืม เจ้าดูไม่เหมือนนักผจญภัยเลยนะ เจ้าจะไปที่ World's End ทำไมหรือ? เจ้าคงง่อยกระรอกภายใน 10 นาทีหลังเดินทางเข้าไปในดินแดนที่ยังไม่มีใครรู้จักแหง ๆ! พวก winged beak ogres จะกินเจ้าทั้งเป็น! ถ้าพวกมนุษย์กินคนไม่ไล่ตามจนเจ้าฉี่ราดเผ่นกลับบ้านซะก่อนน่ะนะ!

source: Psh, fine, be like that!
th_th: ฮึ ตามใจ เอาที่เจ้าสบายใจเลย!
