Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Assassin noble.po
Languages: th_th

source: AAHH!
th_th: อ๊าา!

source: OUCH!
th_th: ชะอุ๊ยยยย!

source: OWWW!
th_th: โอ๊ยย!

source: NGHHH!
th_th: ฮื่ออออ!

source: RRRGH!
th_th: อึกกก!

source: AGHH!
th_th: อ๊ากกก!

source: I'll make your life hell, /PEASANT/!
th_th: ข้าจะทำให้ชีวิตเจ้าเหมือนตกนรก, ไอ้/PEASANT/!

source: YOU'LL RUE THIS DAY, DREG!
th_th: เจ้าจะต้องเสียใจในวันนี้. เจ้าเศษสวะ

source: NO-ONE CROSSES THE NOBLES AND GETS AWAY WITH IT!
th_th: ไม่มีไครหือกับขุนนางแล้วรอดไปได้!

source: A NOBLE NEVER FORGETS!
th_th: พวกเราขุนนางจะไม่มีวันลืม!

source: I'LL HAVE YOU HUNTED DOWN!
th_th: ข้าจะตามล่าเจ้า!
