Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Attack.po
Languages: th_th

source: Bleed /HIM/ dry!
th_th: เอาให้/HIM/เลือดหมดตัว!

source: Make 'em scream!
th_th: เอาให้มันกรีดร้อง!

source: Stab 'em in the eyes!
th_th: แทงลูกตาพวกมัน!

source: Carve their throats out!
th_th: เชือดคอพวกมัน!

source: Slice their guts open!
th_th: คว้านท้องพวกมัน!

source: Rip 'em inside out!
th_th: เอาให้ไส้ทะลัก!

source: Smash 'em up!
th_th: ขยี้พวกมัน!

source: Smash 'em open!
th_th: บดขยี้พวกมันให้สิ้น!

source: Make 'em mush!
th_th: เล่นแม่งให้เละ!

source: Make 'em gush! I wanna see LOTS'VE red!
th_th: เอาให้เละ! กูอยากเห็นสีแดง!

source: Slit 'em open! Slaughter 'em!
th_th: กรีดมัน! เชือดมัน!

source: Skin them alive! Bring me their skalps!
th_th: ลอกหนังมันทั้งเป็น! เอากะโหลกมันมาให้ข้า!

source: Stab 'im in the eyes!
th_th: ควักลูกตามันมา!

source: Carve /HIS/ throat out!
th_th: เชือดคอ/HIS/!

source: Slice /HIS/ guts open!
th_th: คว้านท้อง/HIS/ออกมา!

source: Rip /HIM/ inside out!
th_th: เอาให้ไส้/HIM/แม่งทะลัก!

source: Smash /HIM/ up!
th_th: ขยี้/HIM/!

source: Smash /HIM/ open!
th_th: บดขยี้/HIM/ให้สิ้น!

source: Make /HIM/ mush!
th_th: เล่น/HIM/ให้เละ!
