Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Attacked for bounty.po
Languages: th_th

source: An Empire puppet comes for my bounty, hrm?
th_th: หุ่นเชิดของ Empire มาล่าข้าหัวข้ารึ ฮืม?

source: An Empire stooge comes after my bounty, hrm?
th_th: สมุนของ Empire มาล่าข้าหัวข้ารึ ฮืม?

source: Another Empire lackey comes for my bounty, hrm?
th_th: สมุนของ Empire ตัวอื่นที่อยากได้ค่าหัวข้ารึ ฮืม?

source: Another Empire pawn comes after my bounty, hrm?
th_th: ตัวหมากของ Empire ตัวอื่นที่อยากได้ค่าหัวข้ารึ ฮืม?

source: Another Empire sucker wants my bounty, hrm?
th_th: ไอ้พวกเลียตีน Empire ตัวอื่นที่อยากได้ค่าหัวข้ารึ ฮืม?

source: I'll rip your bones from you flesh first
th_th: ก่อนอื่นข้าจะฉีกกระดูกเจ้าออกจากร่างเสีย

source: I'll rip your limbs from your body first
th_th: ก่อนอื่นข้าจะฉีกแขนขาเจ้าออกจากร่างเสีย

source: I'll tear your eyes from their sockets first
th_th: ก่อนอื่นข้าจะควักลูกตาเจ้าออกจากเบ้าเสีย

source: I'll pull your spine from your flesh first
th_th: ก่อนอื่นข้าจะดึงกระดูกสันหลังเจ้าออกจากร่างเสีย

source: I'll unravel you from your guts first
th_th: ก่อนอื่นข้าจะฉีกไส้เจ้าออกเป็นชิ้นๆ เสีย

source: Come closer!
th_th: ดาหน้าเข้ามา!

source: Don't be shy, come closer!
th_th: อย่าได้อายไป เข้ามาสิวะ!

source: Come on then, don't be shy!
th_th: เข้ามาซี่ อย่าอายไปเลย!
