Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Attacked by player.po
Languages: th_th

source: What the...!
th_th: อะไรว่ะ...!

source: What IS this?!
th_th: อะไรวะเนี่ย?!

source: /IDIOT/! You think you can beat me?
th_th: /IDIOT/! แกคิดว่าจะเอาชนะข้าได้งั้นเรอะ?

source: /TCH/! Damn /PUNK/!
th_th: TCH/! บ้าจริง /PUNK/!

source: I OWN you, /PUNK/! You should never have messed with /MEUS/!
th_th: ข้าติดหนี้เจ้าแล้ว, /PUNK/! เจ้าไม่ควรเข้ามายุ่งกับ /MEUS/!

source: I will CRUSH you, /PUNK/!
th_th: ข้าจะขยี้เจ้า, /PUNK/!

source: You dumb /IDIOT/! You can't beat me!
th_th: ไอโง่ /IDIOT/! เจ้าเอาชนะข้าไม่ได้หรอก!

source: What are you stupid? I'll smash you!
th_th: เจ้ามันโง่รึเปล่า? ข้าจะอัดเจ้า!

source: You're going to regret this!
th_th: เจ้าจะต้องเสียใจกับเรื่องนี้!

source: That was a dumb move, /PUNK/
th_th: ช่างเป็นการเคลื่อนไหวที่โง่เง่า

source: You're not going to get away with this
th_th: เจ้าไม่สามารถหนีจากสิ่งที่ทำได้แน่

source: You'll go down for this
th_th: เจ้าจะร่วงไปนอนเพราะสิ่งที่ทำ

source: You won't get away with this
th_th: เจ้าหนีสิ่งที่ทำไปไม่ได้หรอก

source: I won't let you get away!
th_th: ข้าไม่ให้เจ้าหนีไปได้แน่!
