Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Attacking on sight.po
Languages: th_th

source: Who are you?!
th_th: เจ้าเป็นใคร?!

source: You've come to the wrong place, at the wrong time
th_th: เจ้ามาผิดที่ ผิดเวลา

source: You should never have come here
th_th: เจ้าไม่ควรมาที่นี่เลย

source: I HATE people invading my space
th_th: ข้าเกลียดคนบุกรุกถิ่นข้า

source: You come for my bounty, little worm?
th_th: เจ้ามาล่าค่าหัวข้า ใช่ไหมเจ้าหนอนตัวจ้อย?

source: Come to get a piece of my bounty, little worm?
th_th: คิดจะมาล่าหัวข้าสินะ เจ้าหนอนตัวจ้อย?

source: /QUICKLAUGH/, just you try it, boy
th_th: /QUICKLAUGH/ งั้นก็ลองดูสิ ไอ้หนู

source: /QUICKLAUGH/ I'd like to see you try it, boy
th_th: /QUICKLAUGH/ ข้าอยากเห็นความพยายามของเจ้าจริง เจ้าหนู

source: /QUICKLAUGH/, aw how cute
th_th: /QUICKLAUGH/ อา ช่างน่ารักเสียนี่กระไร

source: /QUICKLAUGH/, just you try it
th_th: /QUICKLAUGH/ มาลองดูเสียสิ

source: /QUICKLAUGH/, I'd like to see you try it
th_th: /QUICKLAUGH/ ข้าอยากเห็นความพยายามของเจ้า

source: /QUICKLAUGH/, aw how precious
th_th: /QUICKLAUGH/ อา ช่่างล้ำค่ายิ่ง

source: You again, little worm?
th_th: เจ้าอีกแล้วรึ เจ้าหนอนตัวจ้อย

source: Go on, I'm not going to beat you again. Stomping on ants isn't any fun
th_th: เอาเลย ข้าไม่อัดเจ้าอีกหรอก กระทืบมดไปก็ไม่สนุกอะไร

source: You again? Bwahaha, come back for more?
th_th: เจ้าอีกแล้วรึ? ก๊ากฮ่าฮ่าฮ่า กลับมาโดนเพิ่มรึไง?
