Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Attacked by target hiver.po
Languages: th_th

source: Ngahh!
th_th: ย้าาาา!

source: They betray us!
th_th: มันทรยศพวกเรา!

source: NGOOO!
th_th: ม่ายยยย!

source: You hurt us!
th_th: เจ้าทำร้ายพวกเรา!

source: You cut us!
th_th: เจ้าฟันพวกเรา!

source: Raze the enemy!
th_th: ทำลายล้างศัตรู!

source: Enemies of the Queen! Raze them!
th_th: ศัตรูของราชินี! บดขยี้พวกมัน!

source: Enemies of the Queen! Kill!
th_th: ศัตรูของราชินี! ฆ่ามัน!

source: Preserve the Hive!
th_th: ปกป้องรักษา Hive !

source: Defend the Queen!
th_th: ปกป้ององค์ราชินี!

source: Secure the Hive!
th_th: ช่วยเหลือ Hive!
