Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bad Relations Empire -70.po
Languages: th_th

source: You!!!
th_th: เจ้า!!!

source: It's /HIM/! Sound the alarm!
th_th: นั่น /HIM/! เปิดสัญญาณเตือน!

source: Get over here, it's /HIM/!
th_th: มาทางนี้ นั่น /HIM/!

source: Assemble for attack!
th_th: ยกกำลังเข้าโจมตี!

source: Rally for attack!
th_th: รวมพลเข้าโจมตี!

source: Prepare for attack!
th_th: เตรียมพร้อมโจมตี!

source: Regroup! It's /HIM/!
th_th: กลับมารวมกลุ่ม! นั่น /HIM/!

source: Kill /HIM/! No-one lives!
th_th: ฆ่า /HIM/! อย่าให้รอดไปได้!

source: Kill /HIM/! No-one escapes!
th_th: ฆ่า /HIM/! อย่าให้หนีไปได้!

source: It-it's /HIM/!
th_th: นั่น-มัน /HIM/!

source: ... Ggh! /PLAYERNAME/!
th_th: ... อ้าก! /PLAYERNAME/!

source: Retreat!
th_th: ถอยทัพ!

source: Gut /HIM/
th_th: ควักไส้ /HIM/

source: Tear /HIM/ apart
th_th: ฉีก /HIM/ ให้เป็นชิ้นๆ

source: Hurt /HIM/
th_th: ฟาด /HIM/

source: Punish /HIM/
th_th: ลงทัณฑ์ /HIM/

source: Make /HIM/ bleed
th_th: เอาให้ /HIM/ เลือดกลบปาก

source: Crush /HIM/
th_th: บดขยี้ /HIM/

source: Break /HIM/
th_th: ทำลาย /HIM/

source: Anti slaver/S/!
th_th: กลุ่มต่อต้านการค้าทาส/S/!

source: Over there! Anti slaver/S/!
th_th: ทางนี้! กลุ่มต่อต้านการค้าทาส/S/!
