Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bag search (Shek).po
Languages: th_th

source: Smuggling checks. Open your bags, /FLATSKIN/.
th_th: ตรวจลักลอบขนของผิดกฎหมาย เปิดกระเป๋าซะ /FLATSKIN/

source: (Show /HIM/ your gear)
th_th: (เปิดสัมภาระให้ /HIM/ดู)

source: You may pass.
th_th: เจ้าผ่านได้

source: Acceptable. Go.
th_th: ยอมรับได้ เอ้าไป

source: Wait... What's this...
th_th: เดี๋ยว... นี่มัน...

source: Hm. I found something...
th_th: ฮืม ข้าเจอบางอย่าง...

source: ... Hm. What's this...
th_th: ...ฮืม นี่มัน...

source: It's a-
th_th: นั่นมัน-

source: It's jus-
th_th: มันก็แค่-

source: How did-
th_th: ได้ไง-

source: Where did-
th_th: อยู่ตรงไหน-

source: You're mist-
th_th: เจ้าเข้าใจผิด-

source: I can ex-
th_th: ข้าอธิบายได้-

source: Look, I can-
th_th: ฟังนะ ข้าอธิ-

source: Trickery.
th_th: ปลิ้นปล้อนนัก

source: Dishonor.
th_th: ไร้เกียรติ

source: Deviousness.
th_th: ทุจริต.

source: Smuggling... Cowardice.
th_th: ลักลอบนำเข้า ... ขี้ขลาด.

source: Sly /FLATSKIN/.
th_th: /FLATSKIN/ ฉ้อฉล.

source: Destroy /HIM/. Crossing the Shek Kingdom will be /HIS/ doom.
th_th: บดขยี้ /HIM/. การข้ามอาณาจักร Shek จักเป็นความวิบัติของ /HIS/.

source: A dishonor on Kral's soil. Break /HIM/.
th_th: ทำเรื่องเสื่อมเสียเกียรติในแดนแห่ง Kral ทำลาย /HIM/

source: Bring the /CRAVEN/ doom.
th_th: จงนำความวิบัติสู่ /CRAVEN/

source: Make /HIM/ pay the price. Blood for Kral!
th_th: ให้ /HIM/ ได้ชดใช้ หลั่งเลือดเพื่อ Kral!

source: Let the blood flow. No mercy for sneaking /CRAVEN/s.
th_th: ให้เลือดสาดกระเซ็น ไม่มีความปราณีแด่พวก /CRAVEN/ ที่ลับๆล่อๆ

source: Wrong move, /FLATSKIN/. No mercy for sneaking /CRAVEN/s.
th_th: เจ้าก้าวพลาดแล้ว /FLATSKIN/ ไม่มีความปราณีแด่พวก /CRAVEN/ ที่ลับๆล่อๆ

source: Your cowardice will be your doom, /FLATSKIN/.
th_th: ความขี้ขลาดจักเป็นความวิบัติของเจ้า /FLATSKIN/

source: Hold-
th_th: เดี๋ยว-

source: Just a-
th_th: แปป-

source: Can I ask you a question first?
th_th: ขอถามอะไรซักคำก่อนได้ไหม?

source: Wait, can I ask you something?
th_th: เดี๋ยว ขอถามอะไรอย่างสิ?

source: Somebody's in a bad mood...
th_th: มีคนอารมณ์เสียว่ะ...

source: Somebody woke up on the wrong side of the bed...
th_th: ดูเหมือนจะมีคนนอนตกหมอนนะเนี่ย...

source: Somebody's feeling grouchy today...
th_th: วันนี้ท่าจะมีคนอารมณ์ไม่ดีแหะ...

source: Looks like somebody's in a crabby mood...
th_th: ดูเหมือนจะมีคนอารมณ์บ่จอยอยู่...

source: [Ominous snarls]
th_th: [ขู่คำรามอย่างดุร้าย]

source: Bags.
th_th: กระเป๋า

source: ... Yes sir, sorry sir (Show /HIM/ your gear)
th_th: ...ขอรับ ขอโทษขอรับท่าน (เปิดสัมภาระให้ /HIM/ดู)

source: ... Friends? (Bribe 2000 Cats)
th_th: ...ไงสหาย? (สินบน 2000 cats)

source: /IDIOCY/. First you talk too much. Now this? The vilest of crimes.
th_th: /IDIOCY/ ทีแรกเจ้าก็พูดซะเยอะ ทีนี้อะไร? อาชญากรรมแสนชั่วช้ารึ

source: /IDIOCY/. First with the bothersome chatter, now this? The most shameful of crimes.
th_th: /IDIOCY/ ทีแรกก็คุยสัพเพเหระน่ารำคาญ ทีนี้อะไร? อาชญากรรมที่น่าละอายที่สุดงั้นรึ

source: You know I can't let you check my gear... (Grab sword).
th_th: รู้ไรป่าว ข้าให้เจ้าตรวจกระเป๋าไม่ได้ว่ะ... (จับดาบ)

source: Well, I guess you leave me no choice... (Grab sword)
th_th: ได้ ท่าจะไม่มีทางเลือกล่ะนะ... (จับดาบ)

source: Won't back down, eh? Well, nosey gate guards get cut... (Grab sword)
th_th: จะไม่ถอยงั้นสิ ฮืม? ก็ได้ คงต้องฟันยามเฝ้าประตูที่น่ารำคาญแล้วสิ...(จับดาบ)

source: I thought that maybe we could come to an arrangement...
th_th: ข้าว่าบางทีเราอาจตกลงกันได้นะ....

source: I thought we might be able to work something out, a deal...
th_th: ข้าคิดว่าเราอาจทำงานอะไรอย่างได้นะ มาตกลงกัน...

source: We cannot. But if you ARE hiding anything in your gear, I'll be sure to punish you myself, just for being a deplorable /WORM/.
th_th: พวกข้าทำไม่ได้ แต่หากเจ้ากำลังหลบซ่อนของในกระเป๋าล่ะก็ ข้ามั่นใจได้ว่าจะได้ลงโทษเจ้าด้วยตนเองเลย ก็แค่เพื่อกลายเป็นสิ่งน่าสังเวชเท่านั้นเอง /WORM/

source: We cannot. But I'll be sure to check extra thoroughly now. Gratitude for the heads up, hm.
th_th: พวกข้าทำไม่ได้ แต่ข้ามั่นใจได้แล้วว่าควรเช็คให้ละเอียดเป็นพิเศษ เป็นการตอบแทนที่แจ้งล่วงหน้าไง ฮืม.

source: Then you leave me no choice (Attack)
th_th: ดูท่าจะไม่เหลือทางเลือกนะ (ต่อสู้)

source: You should have taken the bribe (Attack)
th_th: ความหัวแข็งนี่แหละที่ทำให้เจ้าต้องตาย (ต่อสู้)

source: Hm hm. And so /HE/ fight/S/. Unexpected.
th_th: ฮืม ฮืม งั้น/HE/ จะสู้/S/ งั้นสิ คาดไม่ถึงเลยนะ

source: This is more like it, a /FLATSKIN/ that fights...
th_th: ค่อยเข้าท่าหน่อย /FLATSKIN/ นี่จะสู้...

source: Hm hm. Just as my day was starting to become stale...
th_th: ฮืม ฮืม ดูท่าวันนี้จะเป็นวันที่น่าเบื่อของข้าซะแล้วสิ...

source: Leave this one to me.
th_th: ให้ข้าจัดการมันเอง

source: This one must be looking to die.
th_th: ไอ้นี่มันต้องอยากตายแน่ๆ

source: Got spine.
th_th: มันกล้าแฮะ

source: Wrong move.
th_th: เดินเกมผิดแล้ว

source: I'll make this quick.
th_th: จะจบให้ไวเลย

source: Then show me what you've got.
th_th: ขอดูทีสิว่าจะแน่แค่ไหน

source: Let's see what you've got.
th_th: ดูสิว่าจะแน่แค่ไหน

source: Then fight me, /FLATSKIN/. Face your doom.
th_th: งั้นสู้กับข้า จงเผชิญหน้าความวิบัติของเจ้าเสีย /FLATSKIN/

source: Then fight me, /FLATSKIN/.
th_th: งั้นสู้กับข้า /FLATSKIN/

source: This will be your doom, /FLATSKIN/.
th_th: นี่จักเป็นความวิบัติของเจ้า /FLATSKIN/

source: Today will be your doom, /FLATSKIN/.
th_th: วันนี้จักเป็นความวิบัติของเจ้า /FLATSKIN/

source: Oh... (Show /HIM/ your gear)
th_th: โอ้... (เปิดสัมภาระให้ /HIM/ดู)

source: You don't want to check my bags... (Bribe 2000 Cats)
th_th: เจ้าไม่อยากเช็คกระเป๋าข้าหรอก... (สินบน 2000 cats)

source: How about we forget the checks for today... (Bribe 2000 Cats)
th_th: เอาเป็นว่าวันนี้เราลืมเช็คเป็นไง... (สินบน 2000 cats)

source: Bribery? The worst of crimes. You seem to mistake me for a materialistic human, /FLATSKIN/. The greedy don't survive in Shek land.
th_th: สินบนรึ? อาชญากรรมสุดชั่วร้ายเลวทราม ดูท่าเจ้าจะมองข้าผิดไปว่าเป็นพวกวัตถุนิยมนะมนุษย์เอ๋ย /FLATSKIN/ ความโลภอยู่ไม่รอดในแดน Shek หรอก

source: Greed. The most cowardly of crimes. You seem to confuse me for a fickle human, /FLATSKIN/. We don't tolerate your kind in these lands.
th_th: ความโลภ อาชญากรรมแสนขี้ขลาด เจ้าดูจะสับสนว่าข้าเป็นพวกกลับกลอกนะมนุษย์เอ๋ย /FLATSKIN/ พวกเข้ามิอาจทนคนเยี่ยงเจ้าในแดนนี้ได้

source: Your Cats won't protect you on Kral's soil, /CRAVEN/.
th_th: Cats ของเจ้าจะไม่ปกป้องเจ้าในผืนดินแห่ง Kral /CRAVEN/

source: Punish /HIM/. See how /HIS/ money protects /HIM/ against the sword.
th_th: ฮึ่ม เสียมารยาท เหตุใดต้องเปลื้องผ้าเผ่าเดียวกันด้วย /BROTHER/?

source: Think me, a Shek Warrior, a smuggler? Humility.
th_th: คิดสิ ข้าเป็นนักรบ Shek, ลักลอบขนของรึ? น้อบน้อมกันหน่อย

source: Hmph. You're an outsider, no Shek Warrior. Open them.
th_th: ฮึ่ม เจ้าเป็นคนนอก มิใช่นักรบ Shek เปิดซะ

source: Hmph. An outsider is what you are. Nothing more. Open.
th_th: ฮึ่ม เจ้าเป็นคนนอก ไม่มากไปกว่านั้น ทีนี้เปิด

source: Hmph. You're an outsider, no Shek Warrior. Pockets. Open them.
th_th: ฮึ่ม เจ้าเป็นคนนอก มิใช่นักรบ Shek. เปิดกระเป๋าซะ.

source: An outsider is what you are. Nothing more. Disrobe.
th_th: เจ้าเป็นคนนอก ไม่มากไปกว่านั้น ถอดซะ

source: It's an insult! How dare you accuse ME...
th_th: ช่างเสียมารยาท บังอาจกล่าวหาข้ารึ...

source: Don't you even know who I am? It's an insult!
th_th: ไม่รู้รึว่าข้าคือใคร? นี่มันเสียมารยาท

source: Scowl all you want, I'm a big deal, you know. You don't want to cross me...
th_th: ทำหน้าบึ้งเท่าที่อยากเลย ข้าน่ะคนใหญ่คนโตนะรู้ไหม เจ้าไม่อยากปีนเกลียวข้าหรอก...

source: Such trickery does not run in the mighty Shek blood.
th_th: ลูกไม้พรรค์นี้ใช้ไม่ได้กับสายเลือด Shek อันยิ่งใหญ่หรอก.

source: I'll die at the sword than be stripped as a foreign smuggler!
th_th: ข้ายอมตายด้วยคมดาบมากกว่าถูกปล้นในฐานะนักค้าของเถื่อน!

source: We should be united, as kin. Not accusing our own.
th_th: เราควรกลมเกลียวกัน ดั่งญาติพี่น้อง มิใช่มากล่าวหากันเองเช่นนี้.

source: Mmh. I won't treat a warrior a /CRAVEN/.
th_th: อืม ข้าจะไม่ปฏิบัติต่อนักรบเหมือนว่าเขาเป็น/CRAVEN/

source: Mmh. I won't treat a warrior a sneak.
th_th: อืม ข้าจะไม่ปฏิบัติต่อนักรบเหมือนว่าเขาเป็นงูพิษ

source: Agreed. I won't treat a warrior a cheater.
th_th: ตกลง ข้าจะไม่ปฏิบัติต่อนักรบเหมือนว่าเขาเป็นพวกขี้โกง

source: Granted. I won't treat a warrior a weasel.
th_th: ยอมให้ได้ ข้าจะไม่ปฏิบัติต่อนักรบเหมือนว่าเขาเป็นคนขลาด

source: I'm a proud swordsman, not a sneaking coward...
th_th: ข้าคือนักดาบมีชื่อ หาใช่คนขี้ขลาดลับๆล่อๆไม่...

source: A dishonor. You betray me, /BROTHER/.
th_th: ไร้เกียรติ เจ้าทรยศข้า /BROTHER/

source: Wipe that scowl off your face, my /BROTHER/. You know I'm innocent.
th_th: เลิกหน้าบึ้งถมึงทึงได้แล้ว /BROTHER/ข้า เจ้าก็รู้ว่าข้าบริสุทธิ์.

source: Why so moody, /BROTHER/? You know you're in the wrong here.
th_th: ทำไมต้องอารมณ์เสียด้วย /BROTHER/? เจ้าก็รู้ว่าเจ้าทำผิดน่ะ.

source: Don't huff, /BROTHER/. Come on, let me through...
th_th: อย่าโกรธสิ /BROTHER/ เอาน่า ให้ข้าผ่านเถอะ...

source: Tongue flapper. You try to fool me. Open your bags. Now.
th_th: เจ้าคนปลิ้นปล้อน เจ้าพยายามจะหลอกข้า เปิดกระเป๋า เดี๋ยวนี้.

source: The tongue flapper tries to fool me. Open your bags. Now.
th_th: เจ้าคนปลิ้นปล้อนพยายามจะหลอกข้า เปิดกระเป๋า เดี๋ยวนี้

source: You talk too much, /FLATSKIN/. Open your bags, now.
th_th: เจ้าพูดมากไปแล้ว /FLATSKIN/ เปิดกระเป๋า เดี๋ยวนี้

source: Such senseless chatter. You bore me to tears, /FLATSKIN/. Hurry up and open your bags.
th_th: พูดอะไรไร้สาระ เจ้าทำข้าเบื่อมาก /FLATSKIN/ รีบเปิดกระเป๋าเร็วเข้าซะ.

source: /IDIOCY/... You refuse checks, you go to prison.
th_th: /IDIOCY/... เจ้าปฏิเสธที่จะเช็ค งั้นก็เข้าคุก

source: Hmph. No?... Then you get sent to the cages.
th_th: ฮืม ไม่รึ...? งั้นส่งมันเข้าคุก

source: No?... Then the stubborn /FLATSKIN/ will sleep in a prison cage tonight.
th_th: ไม่รึ...? งั้นเจ้า /FLATSKIN/ หัวแข็งคงต้องนอนกรงแล้วล่ะคืนนี้

source: No patience for criminals.
th_th: ไม่มีขันติสำหรับอาชญากร

source: Tongue flapper. You try to fool me. Show your gear. Now.
th_th: เจ้าคนปลิ้นปล้อน เจ้าพยายามจะหลอกข้า เปิดกระเป๋า เดี๋ยวนี้

source: The tongue flapper tries to fool me. Show your gear. Now.
th_th: เจ้าคนปลิ้นปล้อนพยายามจะหลอกข้า เปิดกระเป๋า เดี๋ยวนี้

source: You talk too much, /FLATSKIN/. Show your gear, now.
th_th: เจ้าพูดมากไปแล้ว /FLATSKIN/ เปิดกระเป๋า เดี๋ยวนี้

source: Such senseless chatter. You bore me to tears, /FLATSKIN/. Hurry up and empty your pockets.
th_th: พูดอะไรไร้สาระ เจ้าทำข้าเบื่อมาก /FLATSKIN/ รีบเปิดกระเป๋าเร็วเข้าซะ.

source: Er, I have personal things on me. I'd rather not...
th_th: เอ่อมันมีของส่วนตัว ข้าไม่อยาก...

source: Actually, I'll just leave instead...
th_th: วันนี้ไม่ใช่วันดี ข้าไม่มีเวลาหรอกนะ...

source: Actually I don't really have time...
th_th: ที่จริงแล้วข้าไม่มีเวลากับมันหรอก...

source: Once more. Bags.
th_th: ข้าจะพูดอีกครั้งนะ เปิดกระเป๋า.

source: Once more. Your gear.
th_th: ข้าจะพูดอีกครั้งนะ แสดงอุปกรณ์ของเจ้าเสีย.

source: Smuggling checks. Shed your gear, /FLATSKIN/.
th_th: ตรวจของผิดกฎหมาย ปลดอุปกรณ์เจ้าซะ /FLATSKIN/

source: Smuggling checks. Remove your gear, /FLATSKIN/.
th_th: ตรวจของผิดกฎหมาย ถอดอุปกรณ์เจ้าซะ /FLATSKIN/

source: Smuggling checks. Remove your effects, /FLATSKIN/.
th_th: ตรวจของผิดกฎหมาย ถอดข้าวของเครื่องใช้เจ้าซะ /FLATSKIN/
