Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Band of bones loss trigger announce .po
Languages: th_th

source: Hmph. Defeated... and by an outsider.
th_th: ฮึ่ม พ่ายแพ้...ให้แก่คนนอก

source: Hmph. A Shek does not surrender to defeat so easily.
th_th: ฮึ่ม ชาว Shek ไม่ยอมก้มหัวให้ความพ่ายแพ้ง่าย ๆ หรอก

source: You defeated us before...
th_th: เจ้าเคยเอาชนะพวกเรามาก่อน...

source: We will not lose again.
th_th: พวกเราจะไม่แพ้อีกเป็นครั้งที่สอง

source: We will not fall this time.
th_th: คราวนี้พวกเราจะไม่แพ้

source: Today, we will be the ones who stand.
th_th: วันนี้ พวกเราจะเป็นผู้ที่ยืนหยัดอยู่ได้

source: Give us a good fight!
th_th: จงต่อสู้ให้เต็มฝีมือ!

source: Make it a good fight!
th_th: ทำให้มันเป็นการต่อสู้ที่ยอดเยี่ยม!

source: There will be blood!
th_th: จะมีการหลั่งเลือด!

source: Blood will flow!
th_th: โลหิตจะหลั่งไหล!
