Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bandit hold up 1.po
Languages: th_th

source: /OI/, you /BOY/!
th_th: /OI/, เจ้า/BOY/!

source: Get over here!
th_th: ไสหัวมาตรงนี้เลยนะ!

source: Come 'ere!
th_th: มานี่!

source: Hold still!
th_th: อยู่นิ่งๆ!!

source: Hold it!
th_th: นิ่งไว้!

source: Don't move!
th_th: อย่าขยับ!

source: Don't even think about runnin'!
th_th: อย่าได้คิดจะวิ่งหนีเชียว!

source: You dare try 'n run from me!
th_th: เจ้ากล้าวิ่งหนีข้าเรอะ!

source: I said no /FUCKING/ runnin'!
th_th: ข้าบอกว่า อย่าวิ่ง /FUCKING/!

source: You wanna get /FUCKEDUP/!? Quit runnin'!
th_th: เจ้าอยากโดน/FUCKEDUP/เรอะ!? บอกว่าให้หยุดวิ่งไง!

source: /GODDAMN/ morons...
th_th: /GODDAMN/ พวกงี่เง่าเอ๊ย...

source: /GODDAMN/ cretins...
th_th: /GODDAMN/ พวกโง่เง่าเอ๊ย...

source: /GODDAMN/ chumps...
th_th: /GODDAMN/ พวกเต่าตุ่นเอ๊ย...

source: /GODDAMN/ /INSULT/s
th_th: /GODDAMN/ /INSULT/

source: Make 'em bleed!
th_th: ชะโลมเลือดพวกมันเลย!

source: Kill 'em! Go for the eyes!
th_th: ฆ่ามัน! เล็งตรงลูกตา!

source: Cut 'em down!
th_th: ล้มพวกมันเลย!

source: Teach 'em how it's done!
th_th: สั่งสอนให้พวกมันรู้ว่าอะไรเป็นอะไรหน่อย!

source: Teach 'em a lesson!
th_th: สอนบทเรียนพวกมันเลย!

source: Mess 'em up!
th_th: อัดพวกมันให้ยับ!

source: Gutless /IDIOT/...
th_th: ไอ้/IDIOT/ขี้ขลาด...

source: You want me to /SLITYOURTHROAT/, /IDIOT/?!
th_th: เจ้าอยากให้ข้า/SLITYOURTHROAT/ใช่มั้ย ไอ้/IDIOT/?!

source: Quit runnin' or I'll /SLITYOURTHROAT/!
th_th: หยุดวิ่งซะที ไม่งั้นข้าจะ/SLITYOURTHROAT/!

source: Here...
th_th: ตรงนี้...

source: /OI/, /RUNT/s!
th_th: /OI/ ไอ้/RUNT/!

source: /OI/, /BASTARD/s!
th_th: /OI/ ไอ้/BASTARD/!

source: /OI/, you lot!
th_th: /OI/ พวกเจ้าตรงนั้นน่ะ!
