Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bandit mugging one liner.po
Languages: th_th

source: /QUICKLAUGH/, this is too easy!
th_th: /QUICKLAUGH/ ง่ายดายซะจริง!

source: Fresh victims!
th_th: เหยื่อรายใหม่!

source: Fresh meat!
th_th: เนื้อชิ้นใหม่!

source: /QUICKLAUGH/... Ain't no city for you lot out here... Just bandits!
th_th: /QUICKLAUGH/...ข้างนอกนี่ไม่มีเมืองคอยคุ้มหัวพวกแกหรอก มีแต่โจรเท่านั้น!

source: Must be a long way from home out here, eh, guys?
th_th: ออกจากบ้านมาไกลละสิ พวกนายน่ะ

source: Strays from the city, eh?
th_th: ออกจากเมืองมาแล้วสินะ,ฮะ?

source: Ain't no-one to protect you out here, /RUNT/s!
th_th: ไม่มีไครคอยช่วยพวกแกหรอก ข้างนอกนี่น่ะ,/RUNT/s!

source: You must be askin' for trouble, travellin' through MY territory!
th_th: เจ้าต้องพยายามหาเรื่องใส่ตัวแน่เลยที่มาเดินในถิ่นของข้า!

source: Charge! Cut /HIM/ down and see if /HEHAS/ got any good loot!
th_th: ลุย! ฆ่า/HIM/ แล้วดูซิว่า/HEHAS/มีอะไรมั่ง

source: Take /HIM/ out, we'll check /HIM/ for loot after!
th_th: ฆ่า/HIM/ซะ แล้วค่อยค้น/HIM/เอาของทีหลัง

source: Take /HIM/ out, /HE/ might have some decent loot on /HIM/!
th_th: ฆ่่า/HIM/ซะ,/HE/จะต้องมีของในตัว/HIM/เยอะแน่ๆ

source: Swiping the loot from /THISGUY/ should be cinch!
th_th: รูดของออกจาก/THISGUY/จะต้องเป็นเรื่องง่ายแน่ๆ

source: Kill /EM/ and strip /EM/!
th_th: ฆ่า /EM/ แล้วถอดเสื้อผ้า /EM/ ซะ!

source: Check /EM/ over for valuables!
th_th: ค้น/EM/ดูซิว่ามีอะไรมีค่าบ้าง!

source: An' just as were runnin' out of supplies too!
th_th: เสบียงพวกเราหมดพอดีเลยว่ะ

source: Who are these /IDIOT/s?
th_th: พวกนี้คือใคร พวก/IDIOT/เรอะ?

source: Well looky here! An' what are YOU doin' all the way out here in the outlands, eh?
th_th: เฮ้ยดูนั่น! เฮ้ย'พวกแกออกมาทำอะไรตั้งไกลทีนี่วะ ฮะ?

source: Who are you? This is MY territory!
th_th: มึงเป็นใครวะ? นี่มันถิ่นกู!

source: Looks like some /RUNT/s to take my rage out on!
th_th: ดููเหมือนจะมีพวก/RUNT/ทำกูของขึ้นว่ะ!

source: /QUICKLAUGH/! These sad /RUNT/s are just asking for a beating!
th_th: /QUICKLAUGH/! พวก/RUNT/น่าสงสารที่อยากโดนกระทืบโว้ย!

source: /QUICKLAUGH/! These nobodies are just asking for a beating!
th_th: /QUICKLAUGH/! พวกไร้ตัวตนที่อยากโดนกระทืบโว้ย!

source: Looks like we got us some trainin' dummies to beat on!
th_th: ดูท่าเราจะมีกระสอบทรายให้ซ้อมท่าแล้วว่ะ!

source: This oughtta make some good sword trainin' for us, /QUICKLAUGH/!
th_th: นี่จะเป็นเป้าซ้อมดาบชั้นยอดให้เราล่ะ /QUICKLAUGH/!

source: A fresh victim!
th_th: เหยื่อรายใหม่ว่ะ!

source: A lone traveller, eh?
th_th: นักเดินทางคนเดียวงั้นหรอ?

source: Travellin' all on your lonesome, eh?
th_th: ออกเดินทางคนเดียวเรอะ ห๊า?

source: Travellin' without any company? You make this too easy for us!
th_th: ไม่มีเพื่อนร่วมทางเรอะเนี่ย? แบบนี้ก็สบายเราขึ้นเยอะ!

source: /QUICKLAUGH/, this is a dangerous place for lone travellers...
th_th: /QUICKLAUGH/ ที่นี่มันอันตรายสำหรับนักเดินทางตัวคนเดียวนะ...

source: A stray from the city, eh?
th_th: เร่ร่อนจากเมืองมาเรอะ ห๊า?

source: /QUICKLAUGH/... Ain't no city for you out here, /INSULT/...
th_th: /QUICKLAUGH/...ไม่มีเมืองให้เจ้าข้างนอกนี่หรอกโว้ย /INSULT/...

source: You must be a long way from home out here, eh, /INSULT/?
th_th: เจ้าคงจากบ้านมาไกลนักสิท่า ห๊า/INSULT/?

source: Ain't no-one to protect you out here, /RUNT/!
th_th: ข้างนอกนี่ไม่มีใครปกป้องเจ้าได้หรอกโว้ย /RUNT/!

source: You must be askin' for trouble, travellin' alone all the way out here!
th_th: เจ้าคงอยากโดนดีนักสินะ ออกเดินทางคนเดียวอย่างงี้เนี่ย!

source: Traders! Get 'em!
th_th: พวกคนขายของ! เล่นมันเลย!

source: Merchants! Get 'em!
th_th: พวกพ่อค้า! เล่นมันเลย!

source: Traders! Gut 'em!
th_th: พวกคนขายของ! ขยี้มัน!

source: Traders! Kill 'em!
th_th: พวกคนขายของ! ฆ่ามัน!

source: A trade caravan?! Crush 'em!
th_th: คาราวานพ่อค้า?! บดขยี้มัน!

source: Merchants! Gut 'em!
th_th: พวกพ่อค้า! ขยี้มัน!

source: Merchants! Kill 'em!
th_th: พวกพ่อค้า! ฆ่ามัน!

source: Merchants! Bleed 'em dry!
th_th: พวกคนขายของ! กรีดเลือดมันให้หมด!

source: Traders... This is the motherload, boys, /CHARGE/!
th_th: พวกคนขายของ! ได้เวลากดตังแล้วเด็กๆ /CHARGE/!

source: Merchants... This is the motherload, boys, /CHARGE/!
th_th: พวกพ่อค้า! ได้เวลากดตังแล้วเด็กๆ /CHARGE/!

source: A caravan!... /CHARGE/! Loot 'em dry!
th_th: คาราวาน!... /CHARGE/! ปล้นให้หมดตูดเลย!

source: /THISGUY/ should have some juicy loot on /HIM/! /CHARGE/!
th_th: /THISGUY/ ของ/HIM/ท่าจะดีพอตัว! /CHARGE/!

source: Merchants?!... Load up, boys! Take everything you can carry!
th_th: พวกคนขายของ?!... เด็กๆ เตรียมพร้อม! เอาทุกอย่างเท่าที่ขนไหวเว้ย!

source: A trade caravan!... Load up, boys! Take everything you can carry!
th_th: คาราวานพ่อค้า!... เด็กๆ เตรียมพร้อม! เอาทุกอย่างเท่าที่ขนไหวเว้ย!

source: Load up, boys! Take everything you can carry!
th_th: เด็กๆ เตรียมพร้อม! เอาทุกอย่างเท่าที่ขนไหวเว้ย!

source: This oughtta get us some good loots! Get 'em!
th_th: ไอ้นี่ท่าจะมีของดีให้ปล้น เล่นมันเลย!

source: Load up, boys! This lot oughtta have some decent loot!
th_th: เด็กๆ เตรียมพร้อม! อันนี้ท่าจะมีของดีเว้ย!

source: Clear 'em out! These fat cats'll get us some good loot!
th_th: ถล่มให้เละ! ไอ้นี่ท่าจะมีของดีให้ปล้นเว้ย!
