Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bandit loot everything.po
Languages: th_th

source: Cha-ching!
th_th: ชะ-ชิ้ง!

source: Boosh! Hit the jackpot here!
th_th: เหยด! ได้แจ็คพอตว่ะ!

source: Ka-ching!
th_th: กะ-ชิ้ง!

source: Goodies!
th_th: เจ๋ง!

source: Loot!
th_th: ปล้นโว้ย!

source: So much loot!
th_th: ปล้นไปเยอะๆ!

source: /DANG/, jackpot!
th_th: /DANG/ แจ็คพอต!

source: Look at all this junk!
th_th: ดูขยะพวกนี้สิวะ!

source: Mah, I'll just take the whole lot
th_th: เอาน่า ข้าก็แค่ต้องเอาไปหมด

source: Meh, just swipe the lot
th_th: เฮ้อ ก็แค่ต้องเอาไปให้หมด

source: Fuck it. I'll just have the lot of it
th_th: ระยำเอ้ย ข้ามีสิ่งนี้เต็มไปหมด

source: I don't even want it. But I'm gonna take the whole lot
th_th: ข้าก็ไม่ได้อยากได้หรอกนะ แต่คงต้องเอาไปหมดนี่ละนะ

source: I'm gonna strip /THISGUY/ clean
th_th: ข้าจะปอกลอก/THISGUY/ให้สะอาดเอี่ยมเลย

source: This stuff is shit. But I'ma gonna take it all anyway
th_th: มีแต่ของขยะ แต่ข้าคงต้องเอาไปให้หมดล่ะนะ

source: I'ma gonna take ALL your shit. /QUICKLAUGH/!
th_th: ข้าจะเอาขยะของเจ้าไปให้หมดเลย /QUICKLAUGH/!
