Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Band of Bones attack shout.po
Languages: th_th

source: Think yourself superior because of those horns, warrior?
th_th: เจ้าคิดว่าเจ้าเจ๋งมากเพราะว่ามีเขาคู่นั้นเหรอ, นักรบ?

source: Another exiled warrior? Or another challenger to beat to the /DIRT/?
th_th: นักรบที่ถูกเนรเทศอีกคนเหรอ? หรือว่าเป็นผู้ท้าชิงอีกคนที่จะมาล้ม /DIRT/?

source: Hmph. Big horns mean big battle skills, correct, warrior?
th_th: อืมม เขายิ่งใหญ่แปลว่ายิ่งเจ๋งใช่มั้ย นักรบ?

source: You may have the horns, but do you have the battle skills, warrior?
th_th: เจ้ามีเขา แต่เจ้าจะมีทักษะสู้รบด้วยหรือเปล่านะ นักรบ?

source: Let's see what you can really do with that sword!
th_th: มาดูกันว่าเจ้าใช้ดาบนั่นได้ดีขนาดไหน!

source: Show me what you're really capable of... Fight me!
th_th: แสดงให้ข้าเห็นสิว่าเจ้าทำอะไรได้บ้าง...ต่อสู้กับข้าซะ!

source: Then raise your sword! Show me what you're really made of!
th_th: ยกดาบของเจ้าขึ้น! แสดงให้ข้าเห็นฝีมือของเจ้าหน่อยเป็นไง!

source: Think yourself worthy of that blade, /FLATSKIN/?
th_th: เจ้าคิดว่าตัวเองคู่ควรกับดาบเล่มนั้นหรือ /FLATSKIN/?

source: Travelling the outlands without escort, hm? Confidence.
th_th: หืม เดินทางไปนอกด่านโดยไม่มีผู้พิทักษ์? เจ้ามั่นใจมากเลยนะนี่

source: Hrm! A /FLATSKIN/ with a blade. Amusing.
th_th: ฮืมม /FLATSKIN/ ที่ใช้ดาบ น่าสนใจนี่
