Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/bandit fight picking repeat target.po
Languages: th_th

source: You again!
th_th: เจ้าอีกแล้วเรอะ!

source: Hey it's that /INSULT/ again.
th_th: เฮ้ ไอ้/INSULT/ มาอีกแล้วว่ะ

source: /OI/ /INSULT/ is back!
th_th: /OI/ ไอ้/INSULT/ กลับมาอีกแล้ว!

source: HA! Guys, look! It's that /INSULT/! /HE/'s back from the dead!
th_th: อะฮ่า! ดูสิพวก! ไอ้/INSULT/นั่นว่ะ! /HE/กลับมาจากนรกแล้วเว้ย!

source: Hey /HE/'s back from the dead!
th_th: เฮ้ /HE/กลับมาจากความตายแล้วเว้ย!

source: Well well well!
th_th: แหม แหม แหม!

source: We didn't kill /HIM/ right!
th_th: เหมือนพวกเราจะจัดการกับ/HIM/เบาไปหน่อยนะ

source: You chumbos didn't kill /HIM/ properly!
th_th: พวกเอ็งจัดการ/HIM/ไม่เรียบร้อยนี่หว่า!

source: Look who it is!
th_th: ดูสิ นั่นใครมา?

source: What are we going to do with you, chumbo?
th_th: พวกเราควรจัดการกับเจ้ายังไงดีหา ไอ้หนุ่ม?

source: Do you wanna get /FUCKEDUP/ again?
th_th: เจ้าอยากโดน/FUCKEDUP/อีกรอบใช่มั้ยฮะ?

source: I think you have too much blood inside you!
th_th: ข้าคิดว่าเจ้าจะห้าวเป้งเกินไปหน่อยนะ!

source: What you gonna do?
th_th: เจ้าจะทำยังไงต่อไป?

source: What you gonna do about it?
th_th: เจ้าจะจัดการเรื่องนี้ยังไง?

source: You gonna fight us?
th_th: เจ้าจะสู้กับพวกข้าเรอะ?

source: Shit didn't go so well for you last time, did it?
th_th: เหมือนคราวที่แล้วเจ้าจะเจ็บตัวน้อยไปหน่อยสินะ?

source: Things went badly for you last time, eh?
th_th: เจ้าซวยไม่น้อยเลยนี่ คราวที่แล้วน่ะ?

source: We're gonna get you later!
th_th: คราวหน้า เอ็งเสร็จพวกข้าแน่!

source: Shall we /FUCK/ /HIM/ up, boss?
th_th: ให้พวกเรา/FUCK/ /HIM/ มั้ยหัวหน้า?

source: Lets get 'em!
th_th: ไปจัดการพวกมันกัน!

source: Yeah, /FUCK/ /HIM/ up good!
th_th: ช่าย /FUCK//HIM/หนัก ๆ ไปเลย!

source: Nah, wait 'till /HE/ leaves town.
th_th: อย่าเพิ่ง รอให้/HIM/ออกจากเมืองไปก่อน

source: We'll get /HIM/ later.
th_th: เราจะจัดการ/HIM/ทีหลัง

source: Hey those /INSULT/s are back!
th_th: เฮ้ ไอ้พวก/INSULT/ กลับมาแล้ว!

source: Those /INSULT/s are back again.
th_th: ไอ้พวก/INSULT/ กลับมาอีกแล้ว

source: Back for more?
th_th: กลับมาเจ็บตัวอีกเรอะ?

source: I thought we killed these /INSULT/s?
th_th: ข้าคิดว่าเราจัดการไอ้พวก/INSULT/นี่ไปแล้วซะอีก?

source: /OHSHIT/, it's /HIM/!
th_th: /OHSHIT/ นั่นมัน/HIM/!

source: /OHSHIT/ it's /HIM/ again!
th_th: /OHSHIT/ นั่นมัน/HIM/อีกแล้ว!

source: Ah! What do we do?
th_th: อ๊าา! ทำยังไงดี?

source: Sshh! Sshh!
th_th: ชู่ว! ชู่ว!

source: Just act natural.
th_th: ทำตัวปกติเข้าไว้.

source: Don't draw attention.
th_th: อย่าดึงดูดความสนใจ.

source: Be quiet! Act normal!
th_th: เงียบ ๆ ไว้! ทำตัวตามปกติ!

source: You again! /ATTACK/!
th_th: เจ้าอีกแล้ว! /ATTACK/มัน!
