Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/bandit fight picking new target in wilds.po
Languages: th_th

source: /OI/! Look at that guy!
th_th: /OI/! ดูไอ้หมอนั่นเดะ!

source: You scared? You scared, /BOY/?
th_th: เจ้ากลัวเหรอ? เจ้ากลัวอยู่ใช่ไหม /BOY/?

source: You afraid of me?
th_th: เจ้ากลัวข้างั้นรึ?

source: RRAAARRR!!!
th_th: อร๊ากกกก!!!

source: HAHA HA!
th_th: ฮ่า ฮ่า ฮ่า!

source: Mind if we follow you?
th_th: เจ้าคงไม่ถือใช่มั้ยถ้าข้าจะตามเจ้าไป?

source: Can we come with you?
th_th: ข้าไปกับเจ้าได้ไหม?

source: We're coming with you, /INSULT/.
th_th: พวกเราจะไปกับเจ้า /INSULT/.

source: You /INSULT/s need protection around here. It's not safe.
th_th: เจ้า/INSULT/ ต้องได้รับการคุ้มครองขณะที่อยู่ที่นี่ มันไม่ปลอดภัย.

source: We should look after you. You look weak.
th_th: เราควรดูแลเจ้า เจ้าดูอ่อนด๋อยมากเลย.

source: We should band together for safety!
th_th: เราควรเกาะกลุ่มกันไว้เพื่อความปลอดภัย!

source: Give us some coin.
th_th: ส่งเงินมาให้พวกเราสักหน่อยสิ.

source: Do you have any money?
th_th: เจ้ามีเงินบ้างไหม?

source: Show us your money. We'll keep it safe.
th_th: เอาเงินเจ้าให้เราดู เราจะดูแลมันให้ปลอดภัยเอง.

source: How much are you going to pay us?
th_th: เจ้าจะจ่ายให้เราเท่าไหร่ล่ะ?

source: We can't do it for free, of course.
th_th: ขอให้รู้ไว้นะว่าเราไม่ทำงานฟรี ๆ.

source: How much money have you got?
th_th: เจ้ามีเงินอยู่กับตัวเท่าไหร่ล่ะ?

source: We can keep your valuables safe.
th_th: เราสามารถคุ้มครองของมีค่าให้เจ้าได้.

source: /FUCKING/ pay us!
th_th: /FUCKING/ จ่ายมาเร็ว ๆ เข้า!

source: Pay us!
th_th: จ่ายเงินมาให้พวกข้า!

source: Give me some /FUCKING/ money!
th_th: ส่งเงิิน/FUCKING/มาให้ข้า!

source: Yeah! /FUCKING/ pay us, /INSULT/!
th_th: นั่นแหล่ะ! /FUCKING/ จ่ายเงินมา /INSULT/!

source: /THREAT/! You /FUCKING/ /INSULT/! You /BASTARD/!
th_th: /THREAT/! เจ้ามันไอ้/FUCKING//INSULT/! ไอ้/BASTARD/!

source: I'm talking to you, /INSULT/!
th_th: ข้ากำลังพูดกับเจ้าอยู่ ไอ้/INSULT/!

source: Come back you /COWARD/!
th_th: กลับมานี่เดี๋ยวนี้เลย ไอ้/COWARD/!

source: Why are you running away?
th_th: เจ้าจะเปิดแน่บไปทำไมล่ะนั่น?

source: Stop being a /COWARD/!
th_th: หยุดทำตัว/COWARD/ซะที!

source: Don't be a /COWARD/!
th_th: อย่าทำตัว/COWARD/ได้มั้ย!

source: We just want to talk!
th_th: พวกเราแค่อยากพูดด้วยโว้ย!

source: Why are you running?
th_th: เจ้าจะวิ่งเพื่อ?

source: Uh oh, cops.
th_th: อ่าฮะ พวกตำรวจ.

source: You can't hide forever, /INSULT/!
th_th: เจ้าไม่สามารถหลบซ่อนได้ตลอดไปหรอก /INSULT/!

source: I /FUCKING/ give up.
th_th: /FUCKING/ ข้ายอมแพ้แล้ว

source: Screw this.
th_th: ช่างหัวมัน

source: Fuck it!
th_th: ช่างหัวแม่งแล้ว!

source: Ah for fuck's sake.
th_th: อ้า แม่งเอ๊ย!

source: Gutless /BASTARD/!
th_th: ไอ้/BASTARD/ตาขาว!

source: /OI/! Come here!
th_th: /OI/! มานี่ซิ!

source: We're gonna have words!
th_th: เราต้องคุยกันหน่อยแล้ว!

source: What are you looking at?
th_th: เจ้ามองหาอะไรอยู่หรือ?

source: Think you are strong?
th_th: เจ้าคิดว่าตนเองแข็งแกร่งมากสินะ?

source: Raaarrrgggghhh!!!!
th_th: ย้ากกกกกกก!!!!

source: /OI/! OI!
th_th: /OI/! เฮ้!

source: Oi oi oi!
th_th: เฮ่ เฮ่ เฮ้ย!

source: What you doing, /INSULT/?
th_th: เจ้าทำอะไรอยู่ ไอ้/INSULT/?

source: Hey, /INSULT/.
th_th: เฮ่ ไอ้/INSULT/.

source: Hey.
th_th: เฮ้.

source: Oi.
th_th: เฮ่.

source: Where you going?
th_th: เจ้าจะไปไหน?

source: What are you doing, /INSULT/?
th_th: เจ้ากำลังทำอะไร ไอ้/INSULT/?

source: Where you going, /INSULT/?
th_th: เจ้าจะไปไหน ไอ้/INSULT/?

source: Hey. /INSULT/.
th_th: เฮ้ /INSULT/.

source: Where you /INSULT/s going?
th_th: ไอ้/INSULT/ เจ้าจะไปไหน?

source: Hey. /YOU/.
th_th: เฮ้ /YOU/

source: /INSULT/? Are you /FUCKING/ listening?
th_th: /INSULT/? /FUCKING/ เจ้าฟังอยู่หรือเปล่าเนี่ย?

source: Hey, /INSULT/?
th_th: เฮ้ /INSULT/?
