Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bandits marked for death.po
Languages: th_th

source: NO! NOO! They're coming for me!!!
th_th: ไม่! ม่ายย! พวกมันจะมาเอาตัวข้าไปแล้ว!!!

source: HELP ME! HELP MEEEEE!
th_th: ช่วยด้วย! ช่วยข้าด้วยยย!

source: OH GOD! THEY'RE COMING FOR ME!
th_th: โอ้พระเจ้า! พวกมันมาหาแล้ว!

source: HELP! NO! Stay away from me, STAY AWAY!
th_th: ช่วยด้วย! ไม่นะ! อย่ามาหาข้า อย่าเข้ามาใกล้ข้า!

source: No! This can't be happening to me! NOOOO!
th_th: ไม่! มันควรเกิดเรื่องแบบนี้กับข้า! ม่ายย!

source: Someone! Somebody help me! NO, NO NO NO!
th_th: ใครก็ได้! ใครก็ได้ช่วยข้าด้วย! ไม่ ไม่นะ ไม่ ไม่!

source: Somebody do something! O..oh no!! HELP!
th_th: ใครก็ได้ ทำอะไรซักอย่างที! โอ๊ะ..โอ้ ไม่! ช่วยด้วย!

source: No! Not me.... NOT ME!!!!
th_th: ไม่นะ! ไม่ใช่ข้าสิ...ไม่ใช่ข้า!!!!

source: Not like this! No, don't do this to me, no!
th_th: ไม่เอางี้สิ! ไม่ อย่าทำอย่างงี้กับข้า ไม่นะ!

source: /AAH/! Damn /BASTARD/s! Dammit!!
th_th: /AAH/! ไอ้พวก/BASTARD/เวรตะไล! ไอ้พวกระยำเอ้ย!!

source: Damn you all to hell! /CRAPPY/ cannibal /RAT/ /BASTARD/s!
th_th: ขอให้พวกมึงตกนรกหมกไหม้! /CRAPPY/ ไอ้พวกกินคน/RAT/ /BASTARD/!

source: /AAH/! I fucking hate cannibals!!!
th_th: /AAH/! ข้าเกลียดพวกกินคนนัก!!!

source: Goddamn it!
th_th: เวรตะไลเอ้ย!

source: Dammit, no!!! Go away!
th_th: ไอ้เวร ไม่นะ!!! ออกไปให้พ้น!

source: No, /FUCKOFF/! Leave me alone!
th_th: ไม่นะ, /FUCKOFF/! อย่ามายุ่งกับข้า!

source: They're coming for me... No, /FUCKOFF/!
th_th: พวกมันกำลังมาหาข้า... ไม่นะ /FUCKOFF/!

source: What? NO! This can't be happening!
th_th: อะไรกัน? ไม่! มันไม่ควรเป็นอย่างงี้!

source: This can't be! No! Not me, not now!!!
th_th: เป็นไปไม่ได้! ไม่! ไม่ใช่ข้า ไม่ใช่ตอนนี้!!!

source: No! Go away! Shoo! NOOOOO! NO!
th_th: ไม่! ไปให้พ้น! ชิ่ว! ม่ายยยย! ไม่นะ!

source: Oh /FUCK/! No! NOOOOO!
th_th: โอ้ /FUCK/! ไม่นะ! ม่ายยยยย!

source: Damn dirty fucking cannibals!
th_th: ไอ้พวกกินคนสวะหมาเอ้ย!

source: Just you try it! JUST TRY ME! /LAUGH/!
th_th: จะเอาเหรอ! จะวัดกับข้าเรอะ! /LAUGH/!

source: They're coming for me... THEY CAN'T HANDLE ME!!! /CRAPPY/ animals!
th_th: พวกมันจะเล่นข้า...พวกแกรับมือข้าไม่ได้หรอก!!! ไอ้พวกสัตว์/CRAPPY/!

source: /FUCKOFF/! You can't handle THIS, /FUCKING/ puny cannibal /BASTARD/s!
th_th: /FUCKOFF/!มึงสู้กูไม่ได้หรอก, /FUCKING/ไอ้มนุษกินคน/BASTARD/s!

source: Oh yeah? /FUCKING/ try me! YOU CAN'T HANDLE ME!
th_th: อ้อเหรอ?/FUCKING/มึงเจอกู!มึงสู้กูไม่ได้หรอก!

source: So it's like that is it? /FUCKING/ /BASTARD/ animals! Come near me and I'll 'av your /BODYPARTS/!
th_th: อ้อ จะเอาอย่างงั้นใช่มั้ย?/FUCKING/ /BASTARD/ไอ้สัตว์!เข้ามาสิกูจะตัด/BODYPARTS/มึง!

source: No, /FUCKOFF/! Eat someone else! I taste like shit!
th_th: ไม่,/FUCKOFF/!ไปกินคนอื่น!กูไม่อร่อยหรอก!

source: /AAH/ /FUCKOFF/! Eat that /IDIOT/ over there, not ME!
th_th: /AAH/ /FUCKOFF/!ไปกินไอ้/IDIOT/โน่นไป,ไม่ใช่กู

source: Don't eat me! What about THEM over there? They look way meatier!
th_th: อย่ากินกู ไปกินไอ้พวกโน้น มันมีเนื้อเยอะกว่า

source: /FUCKOFF/! I swear I haven't bathed in a month, you don't wanna eat me!
th_th: /FUCKOFF/!กูไม่ได้อาบน้ำมมาเป็นเดือนแล้ว มึงไม่อยากกินกูหรอก

source: No, /FUCKOFF/! Eat someone else! I'm all bone, I swear!
th_th: ไม่/FUCKOFF/!ไปกินคนอื่น!กูมีแต่กระดูก เชื่อสิ
