Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bandits take over town.po
Languages: th_th

source: Time for a feast!
th_th: ได้เวลาฉลองกันแล้ว!

source: Let's drink!
th_th: มาดื่มกัน!

source: We're movin' in, boys
th_th: เราจะย้ายเข้าไป, พรรคพวก

source: Get those rottin' carcasses out of here
th_th: เอาไอ้ศพเน่า ๆ นี่ออกไป

source: Nice 'lil outpost we got here, eh...
th_th: เตะมันออกไป

source: Boot 'em out!
th_th: โยนมันออกไป!

source: Throw 'em out the gates!
th_th: โยนพวกมันออกไปนอกประตู!

source: Kick 'em out the gates!
th_th: เตะพวกมันออกไปนอกประตู!

source: They're intrudin' in our new home...
th_th: มันบุกรุกบ้านไหม่ของเรา

source: They're stinkin' up our new home...
th_th: มันทำลายบ้านไหม่เรา
