Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Band of bones raid announce.po
Languages: th_th

source: Welcome to the outlands, settlers, the /LAND/ of the godless.
th_th: ชาวบ้านเอ๋ย ยินดีต้อนรับสู่ outlands /LAND/ที่ไม่มีพระเจ้า.

source: You've strayed far from the big cities, far from your god, settlers...
th_th: ชาวบ้านเอ๋ย เจ้าเดินทางออกห่างเมืองใหญ่มาไกลโขเลยนี่ ห่างไกลจากพระเจ้าของเจ้าด้วย..

source: Only demons reside here...
th_th: ที่นี่มีแต่ปีศาจอาศัยอยู่...

source: All that's left out here are horned demons...
th_th: ที่ี่นี่มีแต่พวก horned demons อาศัยอยู่...

source: And they hunger for war.
th_th: และพวกเขากระหายในสงครามอย่างยิ่ง.

source: And they're thirsty for blood.
th_th: และพวกเขาหิวกระหายโลหิตเป็นอย่างมาก.

source: And they feed on the weak.
th_th: และพวกเขาบริโภคผู้ที่อ่อนแอกว่าเป็นอาหาร.

source: Hm hm hm.
th_th: ฮืม ฮืม ฮืม.

source: Raise your blades.
th_th: ยกดาบของเจ้าขึ้นมา.

source: Just as we were growing bored...
th_th: พวกเรากำลังเบื่ออยู่พอดี...

source: Just as we were yearning for a good fight...
th_th: พวกเรากำลังครั่นเนื้อครั่นตัวอยากต่อสู้อยู่พอดี...

source: What do we find out here but your tidy town, ripe for plucking it's fruits.
th_th: พวกเราเจอแต่เมืองเล็ก ๆ เรียบร้อยของเจ้า น่าบดขยี้เหลือเกิน.

source: The Stenn desert sends it's love.
th_th: ด้วยรักจากทะเลทราย Stenn นะ.

source: It was a hungry trek. Your stores will be battle's reward.
th_th: เป็นการเดินทางที่หิวโหยเลยทีเดียว คลังของเจ้าจะเป็นของรางวัลในการต่อสู้ครั้งนี้.
