Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bandit rescue attemp.po
Languages: th_th

source: C'mon, faster
th_th: มานี่เร็ว

source: Do it, /MAN2/! Unlock me
th_th: ทำซะ, /MAN2/! ปลดล็อคให้ข้า

source: Come on, come on!
th_th: เร็วเข้า, เร็วเข้า

source: /TCH/ I could pick a lock better with my eyes closed!
th_th: /TCH/ ข้าหลับตายังทำได้ดีกว่าเจ้าเลย!

source: Damn it, hurry!
th_th: แม่งเอย! เร็วๆหน่อย

source: Good /MAN2/, that's it...
th_th: เยี่ยมมาก /MAN2/, อย่างนั้นแหละ...

source: /FUCK/, yes! Please help me!
th_th: /FUCK/, ใช่แล้ว! ได้โปรดช่วยข้า!

source: You gotta unlock me!
th_th: เจ้าต้องปลดล็อคให้ข้า

source: Please! Get me outta here!
th_th: ได้โปรดเอาข้าออกไปจากที่นี้ที!

source: Smash it! Smash the lock!
th_th: ทุบมัน! พังมันเลย!

source: Yes! Help me! I'll pay you.. anything! Get me out!
th_th: ใช่ ช่วยข้าด้วย! ข้าจะจ่ายเงินให้ท่าน .. อะไรก็ได้! เอาข้าออกไป!

source: Yeah yeah, c'mon unlock me!
th_th: ใช่ ใช่, เร็วเข้าปลดล็อคให้ข้า!

source: That's it! Thank you thank you! Don't leave me here!
th_th: นั่นแหละ! ขอบคุณนะ ขอบคุณ! อย่าทิ้งข้าไว้ที่นี่!

source: That's it, that's it! Help me out!
th_th: นั่นแหละ, นั่นแหละ! ช่วยข้าออกไป!

source: Jackpot! Yes! Get me out of here, please!
th_th: โอ้ว นั่นแหละ! ใช่! พาข้าออกไปจากที่นี่!

source: /FUCKING/ idiot! Hurry up!
th_th: / FUCKING / งี่เง่าเอ้ย! เร็วเข้าสิวะ!

source: You're so /FUCKING/ slow!
th_th: เจ้านี่มันโคตรช้าเลยว่ะ!

source: If you don't unlock me, I'll cut your face
th_th: หากเจ้าไม่ปลดล็อคให้ข้า ข้าจะกรีดหน้าเจ้าซะ

source: /FUCKING/ get me out already!
th_th: /FUCKING/ เอาข้าออกไป!

source: ARGHH YOU'RE SO SLOW!
th_th: อ้าคคคค เจ้านี่โคตรช้า!

source: Yeah yeah yeah, get me out, get me out!
th_th: ใช่ ใช่ ใช่, พาข้าออกไป, พาข้าออกไป!

source: Yes! C'mon, c'mon, let me out!
th_th: ใช่! เร็วเข้า, เร็วเข้า, พาข้าออกไป!

source: Why are YOU helping me?
th_th: ท่านช่วยข้าทำไม?

source: You're letting me out?
th_th: ท่านจะปล่อยข้าเหรอ?

source: You're helping me?
th_th: ท่านจะช่วยข้าเหรอ?

source: ... you?
th_th: ... เจ้า?

source: Why the fuck are YOU helping me
th_th: ทำไมเจ้าถึงช่วยข้าวะ

source: Don't need help from a piece of shit like YOU
th_th: ไม่ต้องการการช่วยเหลือจากเศษสวะเช่นจ้า

source: I'm gonna kill you when I get out of here
th_th: ข้าจะฆ่าเจ้าเมื่อข้าออกไปจากที่นี่

source: Bad move, /INSULT/, bad move
th_th: เจ้าพลาดแล้ว, /INSULT/, โง่วะ

source: Sick son of a bitch, why are YOU helping me
th_th: ไอ้ลูกหมาป่วย ทำไมเจ้าถึงช่วยข้า

source: Wh- what you doin'?!
th_th: ทำไมแกถึงช่วยข้าวะ

source: H- hey! No! Don't do that!
th_th: ฮะ- เฮ้! ไม่นะ! อย่าทำอย่างนั้น!

source: Stop! No...
th_th: หยุดนะ! ไม่...

source: Go away... Th- the master will see!
th_th: ไปให้พ้น... ดะ- เดี๋ยวเจ้านายจะเห็น!

source: Leave me alone... Th- the master will punish me!
th_th: ปล่อยข้าอยู่คนเดียว... ดะ-เดี๋ยวเจ้านายจะลงโทษข้า!

source: Th- the master will see!
th_th: ดะ-เด๋วเจ้านายจะเห็นเอานะ!

source: H- huh?!
th_th: หะ- ห๋า?!

source: No... no...
th_th: ไม่... ไม่...

source: Do it! I'll pay you gold! Lots of gold...
th_th: ลุยเลย! ข้าจะจ่ายทองให้ท่าน! ทองคำมากมาย ...

source: I'll reward you for this, /MAN2/. Keep tryin'
th_th: ข้าจะให้รางวัลเจ้าสำหรับสิ่งนี้ / MAN2 / พยายามต่อไป
