Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bar patrons random faction comment on world state.po
Languages: th_th

source: Did you hear about captain Eyegore? I can't believe it...
th_th: ได้ยินเรื่องกับปตัน Eyegore รึเปล่า? ข้าไม่อยากเชื่อ...

source: Eyegore? Nah, Eyegore ain't dying that easy. Guy's a demon.
th_th: Eyegore? ห๋า Eyegore ไม่ตายง่ายๆ หรอก หมอนั่นน่ะปีศาจนะ.

source: Demon eat demon...
th_th: ปีศาจแดกปีศาจไง...

source: *Slurp*
th_th: *กินเสียงดัง*

source: ... You tryin' to be a wise 'un? That don't even make sense! 'Demon eat demon'...
th_th: ...จะอวดภูมิเรอะ? ไม่เห็นเมคเซนส์เลย! 'ปีศาจแดกปีศาจ'เนี่ย...

source: Slurpin' on your sake like yer some kinda wiseman skelly...
th_th: กินสาเกเสียงดังทำให้ดูเป็นนักปราญช์ขึ้นมารึไง skelly....

source: All champions fall eventually... *slurp*
th_th: พวกนักรบทุกคนก็ย่อมร่วงหล่นในที่สุดแหละ...*กร๊วบๆ*

source: ... Ya know, skeletons don't drink sake.
th_th: ...รู้ไรปะ, พวก skeleton ไม่ดื่มสาเกกันหรอกนะ

source: Whatever. Eyegore ain't dead, I tell ya. I'll put 1000 Cats on it.
th_th: ยังไงซะ Eyegore จะไม่ตายข้าบอกเลย ข้าเดิมพันฝั่งนี้ 1000 Cats..

source: How about that Empire Captain, eh...
th_th: แล้วกัปตันจักรวรรดินั่นล่ะเป็นไง, เอ๋...

source: Can you believe the Bugmaster's finally dead?
th_th: เจ้าเชื่อรึเปล่าว่าในที่สุด Bugmaster ก็ตายแล้วน่ะ?

source: Hundreds of years of that guy being an ass...
th_th: ร้อยกว่าปีที่ไอ้เวรนั่นมันกร่างสินะ...

source: And now poof! Gone. Just like that.
th_th: แล้วตอนนี้ก็ ฟูบ! หายไป เหมือนแบบนี้.

source: Well, now the Phoenix is gone...
th_th: เยี่ยม ตอนนี้ฟินิกซ์ก็ไม่อยู่อีกแล้ว...

source: Maybe I can actually take a damn walk in the northern plains?
th_th: บางทีข้าอาจสามารถไปเดินทอดน่องแถว northern plains ได้จริงแล้วสิ?

source: God-loving greenlanders, hoggin' all the grassland...
th_th: พวก greenlander ที่พระเจ้ารัก ย่ำไปในแดนทุ่งหญ้า...

source: Good riddance to 'im.
th_th: การกำจัดมันไปเป็นเรื่องดีจริงๆ

source: Damn shame about Tinfist.
th_th: น่าเสียดาย Tinfist จริง ๆ

source: Damn shame.
th_th: น่าเสียดาย.

source: Only a matter of time before the slavers start crossin' borders into the swamps...
th_th: คงอีกไม่นาน ก่อนที่พวกพ่อค้าทาสจะข้ามพรมแดนไปยัง swamps...

source: Let 'em try!
th_th: ก็ให้พวกมันลองดู!

source: The swampers ain't pushovers like those desert crawlers.
th_th: swampers ไม่ใช่ขี้ไก่เหมือนพวก desert crawlers นะเฟ้ย

source: That rain storm we had...
th_th: เราเจอพายุฝนซะแล้ว...

source: I swear it was the skies mourning Tinfist...
th_th: ข้าว่าท้องฟ้ากำลังไว้อาลัยให้ Tinfist นะ...

source: Ancient old hero of the world, gone forever...
th_th: นักรบโบราณของโลกนี้ จากไปตลอดกาล...

source: Time's are dark. Dark, dark, dark...
th_th: เวลาช่างมืดมน. มืดมิด, มืดดับ. มืดบอด...

source: Did you hear what they found in the Bugmaster's lair?
th_th: เจ้าเคยได้ยินรึเปล่าว่าพวกเขาเจออะไรในรังของ Bugmaster?

source: A chest full of teeth! HUMAN teeth!
th_th: กล่องที่เต็มไปด้วยฟัน! ฟันของมนุษย์!

source: So.. the person that caught him replaced his treasure with TEETH?
th_th: บางที... ไอ้คนที่จับหมอนั่นเอาฟันไปแทนที่สมบัติของเขาล่ะ?

source: Well, it was the only chest in his tower and the treasure was gone. Go figure...
th_th: แหม มีกล่องอยู่บนหอคอยของเขาอันเดียวกับสมบัติที่หายไป ลองคิดดูสิ...

source: Kch... Takes a psycho to kill a psycho I suppose...
th_th: ชิ... เอาไอ้โรคจิตไปฆ่าโรคจิตซะล่ะมั้ง...

source: So, how about the fat Cat emperor, eh?
th_th: อืม แล้วจะเอายังไงกับไอ้จักรพรรดิตุ้ยนุ้ยนั่นล่ะ?

source: Whew, yeah, desert's in a hot mess right now, eh...
th_th: วิ้ว ใช่เลย ทะเลทรายกำลังลุกเป็นไฟเลยตอนนี้ เฮ่อ...

source: I can just picture the nobles waddlin' 'round in a panic like headless raptors...
th_th: ข้าจินตนาการภาพพวกขุนนางวิ่งเป็นหนูติดจั่นได้เลยนะเนี่ย...

source: Long dead the emperor!
th_th: ขอให้จักรพรรดิไปตายซะ!

source: 'Bout time somebody stuck it to Longen...
th_th: ควรมีใครสักคนมาสั่งสอย Longen ได้แล้ว...

source: Act like an asshole, die like an asshole.
th_th: ทำตัวอย่างกับไอ้โง่ และตายเหมือนกับไอ้โง่.

source: Long dead the Longen!
th_th: ขอให้้ Longen ไปตายซะ!

source: Apparently the Skin Eater was just some poor guy held hostage by a bunch of skeleton cultists...
th_th: เห็นได้ชัดว่าพวก Skin Eater ก็เป็นเพียงแค่คนน่าสงสารที่โดนพวก Skeleton คลั่งลัทธิจับเป็นตัวประกันน่ะนะ...

source: Did you hear about their suits?
th_th: เจ้าเคยได้ยินเกี่ยวกับชุดที่มันสวมใส่หรือเปล่า?

source: Made of human skin!
th_th: ทำมาจากผิวหนังของมนุษย์!

source: I'm talking straight up CHUNKS of people stitched together...
th_th: ขอพูดตรง ๆ เลยนะ มันคือผิวผนังของคนมากมายที่ถูกเย็บต่อกันเป็นแผ่นใหญ่...

source: And that, my friends, is why I never travel south...
th_th: และนั่นแหละ เพื่อนข้า ว่าทำไมข้าถึงไม่เคยไปทางใต้เลย...

source: No thank YOU very much.
th_th: ไม่ล่ะ ขอบคุณมาก.

source: Now that Simion's dust, the sands should be a little safer at least...
th_th: ตอนนี้ต้องเจอพวก Simion's Dust เหมือนว่าถ้าไปทางทรายจะปลอดภัยกว่านะ...

source: A perfect example of why Cat-less dregs breed nothing but trouble.
th_th: เป็นตัวอย่างที่เห็นได้ชัดว่าพวกสิ้นไร้ไม้ตอกเป็นอะไรไปไม่ได้เลย ยกเว้นแต่ตัวปัญหา

source: Bloody farmers.
th_th: ไอ้ชาวนารากหญ้า.

source: The slavers should finally be able to do their jobs in peace now that Tinfist is gone...
th_th: ตอนนี้ Tinfist หายไปแล้ว ในที่สุดพวกพ่อค้าทาสคงทำการค้าได้สงบขึ้น...

source: No working man deserves to be terrorised the way they are.
th_th: ไม่มีคนที่ลงแรงทำงานคนไหนสมควรถูกก่อกวนทำร้ายแบบนี้

source: So I was trading in the hives the other week...
th_th: ข้าไปทำการค้าขายที่ Hive มาเมื่อหลายสัปดาห์ก่อน...

source: An' I noticed... that brown stuff them lot build huts out of...
th_th: แล้วข้าก็สังเกตเห็น...อะไรไม่รู้สีน้ำตาลที่พวกเข้าใช้สร้างกระท่อม...

source: It ain't stone and it ain't wood neither...
th_th: ไม่ใช่หิน แล้วก็ไม่ใช่ไม้ด้วย...

source: Nah, I guess it ain't... Never really thought about it before...
th_th: อืม ข้าก็ว่างั้นนะ...ไม่เคยมองในแง่นี้มาก่อนเลย...

source: I mean, why don't we have buildings made of that stuff outside of the hives, eh?
th_th: ข้าหมายความว่าทำไมเรา ไม่มีอาคารที่ทำจากสิ่งนั้น นอก hives อ่ะ?

source: Could be the red sand. Maybe if you dig deep enough around Vain...
th_th: อาจเป็นหาดทรายสีแดง บางทีถ้าแกขุดลึกลงไปรอบ ๆ Vain ...

source: I dunno. It don't look like it came outta the ground to me...
th_th: ข้าไม่รู้แฮะ ข้าว่าเหมือนมันไม่ได้มาจากพื้นดินนะ...

source: ... What are you saying?
th_th: ... เจ้ากำลังพูดเรื่องอะไร?

source: Twomoon drank too much rum last week, threw his guts up all over the bar...
th_th: เมื่ออาทิตย์ที่แล้ว Twomoon ก๊งรัมมากไปหน่อย เขาเลยอ้วกแตกเละเทะไปทั่วบาร์เลย...

source: What I'm sayin' is...
th_th: ที่ข้ากำลังพูดอยู่ก็คือ...

source: That stuff inside Twomoon, it looked real similar...
th_th: ของที่อยู่ในตัว Twomoon นี่ดูคุ้น ๆ ตานะ...

source: ... I don't under-... Wait... No...
th_th: ... ข้าไม่เข้าใ-...เดี๋ยวก่อน...ไม่...

source: Just sayin'.
th_th: ก็แค่พูดออกมา

source: Noooooo...!?
th_th: ม่ายยยยยย...!?

source: Heard about that ninja in the desert?
th_th: เคยได้ยินเกี่ยวกับนินจาในทะเลทรายไหม?

source: The noble killer?
th_th: นักฆ่าขุนนางหรอ?

source: Yeah. They say Luquin's back from the dead...
th_th: ใช่ มีคนบอกว่า Luquin กลับมาจากความตาย...

source: And he's picking off the nobles one by one. Just like all those years ago.
th_th: แล้วเขาก็เริ่มเก็บขุนนางไปทีละคน เหมือนสมัยก่อนนู้น

source: Got all the nobles quakin' in their boots.
th_th: ทำเอาขุนนางทั้งหมดถึงกับสั่นกลัว

source: I thought Luquin was alive in prison?
th_th: ข้าคิดว่า Luquin น่าจะยังมีชีวิตอยู่ในคุกมั้ง?

source: I'd be surprised if he survived fifteen years of torture in the Vault.
th_th: ข้าคงจะแปลกใจถ้าเขารอดมาได้จากการทรมานนับสิบห้าปีในห้องนิรภัยน่ะ

source: True.
th_th: ถูกต้อง

source: Headin' out of the city?
th_th: กำลังเดินทางออกจากเมืองหรอ?

source: Well, I was gonna go to Heng but not anymore...
th_th: เอาล่ะ ข้าจะเดินทางไปที่ Heng แต่ว่ามันคงไม่ใช่อีกแล้วล่ะ...

source: Not with all the peasant uprisings in the desert.
th_th: ตอนนี้พวกชาวบ้านกำลังลุกฮือขึ้นในทะเลทราย

source: The nobles are losin' control. Serves 'em right, I say.
th_th: พวกขุนนางสูยเสียการควบคุมไปแล้ว สมน้ำหน้าแล้วล่ะ

source: Yeah...
th_th: ใช่...

source: All because of some crazy ninja...
th_th: เพียงเพราะว่านินจาเพี้ยน ๆ คนหนึ่ง...

source: Yeahhhh, cheers to ninjas!
th_th: ช่ายยยย พวกนินจาจงเจริญ!

source: To ninjas!
th_th: แด่นินจา!

source: Heard about Seta?
th_th: เคยได้ยินอะไรเกี่ยว Seta บ้างไหม?

source: Course I heard about Seta! I ain't livin' in a cave...
th_th: ก็ต้องเคยได้ยินเรื่อง Seta อยู่แล้วสิ! ข้าไม่ใช่คนถ้ำนะเว้ย...

source: Holy Nation's going to shit now he's gone...
th_th: Holy Nation กำลังจะได้ขี้แตกเดี๋ยวนี้แหละ เจ้านั่นมันตายไปแล้ว...

source: Okranites are freakin' out, Shek are gettin' stabby...
th_th: พวก Okranite ได้ประสาทแดกแน่ Shek ได้บุกต่อแหง...

source: Haha. Yeah...
th_th: ฮ่าๆ ใช่...

source: Not a good mix.
th_th: เข้ากันไม่ค่อยดีเลย

source: One o' those high inquisitors got murdered, can you believe it?
th_th: หนึ่งในเจ้าหน้าที่สอบสวนโดนฆ่า เจ้าเชื่อมันไหม?

source: No!?
th_th: ไม่!?

source: Yeah, heard it from the goat trader. Okran's Shield has gone to shit...
th_th: ใช่สิ ข้าได้ยินมาจากพ่อค้าแพะ เกราะแห่ง Okran พังเป็นขี้แล้ว...

source: No way?!
th_th: ไม่มีทาง?!

source: Yeah, they say all the Okranites are freaking the fuck out...
th_th: ใช่ พวกนั้นบอกว่าพวก Okranite ได้ชิบหายหมดแน่...

source: Wouldn't wanna be that side of the world right now...
th_th: ไม่คิดจะเปลี่ยนสีเป็นอีกฝั่งซะตอนนี้เหรอ....

source: No sir...
th_th: ไม่ครับ...

source: You may have taken down the Bugmaster but what about the legendary Old King Cat-Lon?
th_th: เจ้าอาจจะล้ม Bugmaster ได้ แต่ถ้าเป็น King Cat-Lon ล่ะ?

source: Are you really picking a fight with THE /GUY/ who killed the Bugmaster?
th_th: นี่เจ้าคิดจะหาเรื่อง/GUY/ที่ฆ่า Bugmaster ได้รึไง?

source: But Old King Cat-Lon was the strongest and he was alive before everything...
th_th: แต่ Old King Cat-Lon นั้นแข็งแกร่งที่สุดและเขายังมีชีวิตอยู่มาก่อนทุกสิ่งด้วย...

source: Where do ya think them coins came from in your pockets, eh?
th_th: คิดไหมว่าเหรียญของพวกมันในกระเป๋าเจ้าน่ะมาจากไหน ฮืม?

source: Where do ya think them coins came from?
th_th: คิดไหมว่าเหรียญของพวกมันน่ะมาจากไหน?

source: And are you ranting about coins AGAIN now?
th_th: และเจ้ากำลังคุยโวเรื่องเหรียญอีกรอบแล้วงั้นสิ?

source: Have another bowl of gohan, you're drunk.
th_th: ขอข้าวอีกถ้วยสิ เจ้ามันเมาแล้ว
