Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bar thug swamp.po
Languages: th_th

source: A new /GUY/, eh? Thinks /HEIS/ some sorta badass with a sword, eh?
th_th: /GUY/หน้าใหม่รึ ฮืม? คิดว่า/HEIS/พกดาบแล้วจะดูเจ๋งเหรอ ฮืม?

source: Feeling inadequate, are we? Now a real /MEMAN/ with a real sword's in town...
th_th: รู้สึกไร้ค่าล่ะสิพวกเจ้า ตอนที่/MEMAN/พกดาบเข้ามาในเมือง

source: Dog shit! I'll show you who's inadekit!
th_th: ไอ้ขี้หมา!ข้าจะแสดงให้เจ้าเห็นว่าไครที่ไร้ค่า

source: Hm hm hm. Try me.
th_th: หืมม หืม หืม มาลองกับข้าสักยกมา

source: Oi! I saw that! You fucking twitched yer nose at me! /WTF/!
th_th: เฮ้ย! ข้าเห็นนะเว้ย! แกกล้าเขม่นใส่ข้างั้นหรอวะ! /เชี่ยไรวะ/!

source: Yeah? So what if I did? Whatcha gonna do about it?
th_th: ฮะ?ถ้าข้าทำแล้วเจ้าจะทำไม?

source: I'll sort you out!
th_th: ข้าจะจัดเอ็งให้หนักเลย!

source: What're you drinkin'? Grog?... Grog's for girls. What're you, a girl now?
th_th: เจ้าดื่มอะไรของเจ้าน่ะ? เหล้ารัมผสมนํ้าหรอ? ... เหล้ารัมผสมนํ้าน่ะ มันสำหรับเด็กผู้หญิง เจ้าเป็นอะไร เด็กผู้หญิงหรอ?

source: *smash* Then you don't need a girl drink.
th_th: *เพล้ง*งั้นเจ้าก็ไม่ต้องแดกไอ้เหล้าเด็กผู้หญิงนี่หรอก

source: My /GODDAMN/ grog! I'll gut you like a dog!
th_th: เฮ้้ย/GODDAMN/เหล้าของข้า!ข้าจะกระทืบเจ้าเหมือนหมา

source: /OI/, /INSULT/. Yer in my spot.
th_th: /OI/, /INSULT/.เจ้านั่งที่ข้าอยู่.

source: You hearin' okay, /INSULT/? I said yer in my spot!
th_th: เจ้าได้ยินรึเปล่าวะ,/INSULT/?ข้าบอกว่านี่ที่ข้า

source: So move me then.
th_th: งั้นก็ทำให้ข้าขยับสิ

source: What's that yer drinkin'? Grog?... Grog's for girls. What're you, a girl now?
th_th: เจ้าดื่มอะไรของเจ้าน่ะ? เหล้ารัมผสมนํ้าหรอ? ... เหล้ารัมผสมนํ้าน่ะ มันสำหรับเด็กผู้หญิง เจ้าเป็นอะไร เด็กผู้หญิงหรอ?

source: You're /GODDAMN/ right I'm a girl! You sayin' I look like a /GODDAMN/ fella?!
th_th: เออ เจ้าพูดถูกแล้วว่าข้าเป็นผู้หญิง ไอ้/GODDAMN/! เจ้าพูดว่าข้าดูเหมือนเพื่อนเล่น/GODDAMN/ของเจ้างั้นเรอะ?!

source: You're a girl?!... Tidy yourself up a bit, darlin', I prefer somethin' prettier to look at.
th_th: เจ้าเป็นสตรีเหรอ?!...ดูแลตัวเองหน่อยแม่หนู ข้าชอบมองของสวย ๆ งาม ๆ กว่านี้นะ

source: Then maybe you need your eyes checked! Here, allow me!
th_th: งั้้นเจ้าก็คงต้องตรวจตาหน่อยแล้วหล่ะ มา เดี๋ยวตรวจให้

source: Call that a sword? I've seen scarier lookin' sticks!
th_th: เจ้าเรียกนั่นว่าดาบเหรอ ข้าเคยเห็นกิ่งไม้ที่น่ากลัวกว่าดาบเจ้าอีก

source: Glenn, he knows all about Black-blood, you know. His cousin had a run-in with 'im...
th_th: Glenn,เขารู้ทุกอย่างเกี่ยวกลับไอ้พวกเลือดดำนั่น,รู้มั้ย.ญาติของเขาเคยเจอพวกมัน

source: Kills you real slowly, he does. Takes what's lefta you and flays you alive, eats your skin...
th_th: มันจะฆ่าเจ้าอย่างช้าๆ,นั่นล่ะ.เอาของของเจ้าไป แล้วแล่เจ้าทั้งเป็น,แล้วก็กินหนังของเจ้า

source: They found Glenn's cousin completely stripped: Eyeballs, lips, everything.
th_th: พวกเขาพบลูกพี่ลูกน้องของ Glenn โดนเฉือนไปหมดเลย ทั้งลูกตา ริมฝีปาก ทั้งหมดเลย

source: Alright already... enough details. No more talk of Black-blood, okay?
th_th: เอาหล่ะพอแล้ว...ไม่ต้องอธิบายแล้ว ไม่ต้องพูดถึงไอ้พวกเลือดดำแล้ว โอเคมั้ย?

source: It's bad luck... I got enough of that already.
th_th: ข้าน่ะโชคร้าย....ข้าได้ยินมันมาเยอะแล้วหล่ะ

source: Heard the Phoenix got assassinated...
th_th: ได้ยินมาว่า Phoenix โดนลอบฆ่าไปแล้วแน่ะ...

source: Who?
th_th: ใครล่ะนั่น?

source: The Phoenix.
th_th: The Phoenix ไง.

source: Don't know 'im.
th_th: ไม่ยักกะรู้จัก

source: Seriously? Reincarnated messenger of Okran...
th_th: จริงปะเนี่ย? ผู้ส่งสารจากองค์ Okran ที่มาจุติใหม่ไง...

source: Ruler of the North... mass genocide of skeletons...
th_th: ผู้ปกครองแดนเหนือ... มุ่งมั่นฆ่าล้างชาว skeleton...

source: Oh, oh, that guy, yeah... tragic.
th_th: อ๋อ โอ้ หมอนั่นเอง ใช่...อนาถใจนัก.

source: Uh... not really. It means freedom for the north, it's the opposite to tragic...
th_th: อือ..ไม่เชิง มันหมายถึงอิสรภาพแด่แดนเหนือ ตรงกันข้ามกับเรื่องเศร้าเลยนะ...

source: Oh, yeah, yeah, that's what I meant.
th_th: โอ้ใช่ ใช่ นั่นแหละที่ข้าหมายถึงล่ะ..

source: ... You've been in the swamps too long.
th_th: ...เจ้าก็อยู่ที่หนองน้ำมานานนี่เนอะ.

source: Ain't many bugs around these days, eh?
th_th: ก็มีเรื่องบ้าๆเกิดขึ้นได้ทุกวันใช่ม้า?
