Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Battle cries shek.po
Languages: th_th

source: For Kral
th_th: แด่ Kral

source: Blood for Kral
th_th: เลือดเเด่ Kral

source: For honour
th_th: เพื่อเกียรติยศ

source: For Kral's honour
th_th: เพื่อเกียรติยศของ Kral

source: Only the weak fear death
th_th: มีเเต่คนอ่อนเเอที่กลัวความตาย

source: Fear is for the weak
th_th: ความกลัวมีไว้สำหรับคนอ่อนเเอ

source: No fear
th_th: ไร้ความกลัว

source: Don't try and run. You're already dead.
th_th: ไม่ต้องหนี เจ้าน่ะได้ตายไปเเล้ว.

source: This will be quick and clean
th_th: นี่จะรวดเร็วเเละหมดจด

source: This shouldn't take too long
th_th: ไม่นานนักหรอก

source: I'll make this quick
th_th: ข้าจะทำให้มันจบอย่างรวดเร็วเอง

source: This will be over soon
th_th: เเป๊ปเดียวก็จบเเล้ว

source: I'll give you an honourable death
th_th: ข้าจะให้เจ้าตายอย่างมีเกียรติ

source: You'll have an honourable death
th_th: เจ้าจะตายอย่างมีเกียรติ

source: You'll die with honour
th_th: เจ้าจะตายไปพร้อมกับเกียรติ

source: You'll die a courageous death!
th_th: เจ้าจะตายอย่่างกล้าหาญ

source: Time for battle!
th_th: ได้เวลาสู้เเล้ว

source: Let the battle commence!
th_th: มาเริ่มการต่อสู้กันเลย!

source: A battle!
th_th: เข้ามา!

source: Now we fight
th_th: บัดนี้เราสู้

source: Bring on the battle
th_th: เข้ามาเลย

source: Hit me with everything you've got!
th_th: สู้กับข้าด้วยทุกสิ่งที่เจ้ามี!

source: Come at me!
th_th: เข้ามา!

source: Charge!
th_th: บุกเข้าไป!

source: I sentence you to death!
th_th: ข้าจะพิพากษาเจ้าเอง

source: Death awaits you
th_th: ความตายรอเจ้าอยู่

source: Doom!
th_th: ชะตาขาดแล้ว!

source: Let's do this
th_th: มาเริ่มกันเลยเถอะ

source: Come, fight me!
th_th: เข้ามาเลย!

source: Leave this to me
th_th: ทิ้งนี่ไว้กับข้า

source: Leave /HIM/ to me
th_th: ให้ข้าจัดการ/HIM/เอง

source: Today is a good day to die
th_th: วันนี้เป็นวันดีที่จะตาย

source: You will not live
th_th: เจ้าจะไม่รอด

source: You will not survive
th_th: เจ้าไม่รอดแน่

source: Today is the day you die
th_th: นี่เป็นวันตายของเจ้า

source: Today you die
th_th: วันนี้ี้เป็นวันตายของเจ้า

source: This will be your doom
th_th: นี่่จะเป็นจุดจบของเจ้า

source: I'll rip your head from your neck
th_th: ข้าจะฉีกหัวออกมาจากบ่าของเจ้าซะ

source: I'll break your bones
th_th: ข้าจะหักกระดูกเจ้าซะ

source: I'll tear you inside out
th_th: ข้าจะฉีกเจ้าเป็นชิ้นๆ

source: I'll carve your spine from your shoulders
th_th: ข้าจะดึงกระดูกสันหลังออกมาจากไหล่ของเจ้า

source: I'll crack your bones from your skin
th_th: ข้าจะฉีกกระดูกออกมาจากหนังของเจ้า

source: I'll slice your neck
th_th: ข้าจะหั่นคอเจ้าซะ

source: I'll pierce your heart
th_th: ข้าจะแทงหัวใจของเจ้า

source: RARRRRRRGH!
th_th: อโอ๊ยยยยยยยยย!

source: ARRGHHHH!
th_th: โอ๊ยยยยย!

source: RAHHHHH!
th_th: อ๊าาาาาา!

source: Me fear death? Death fears ME!
th_th: ข้าน่ะรึกลัวความตาย? ความตายต่างหากที่กลัวข้า!

source: Cannibals...
th_th: พวกมนุษย์กินคน...

source: Cannibal scum...
th_th: พวกมนุษย์กินคนชั้นต่ำ...

source: Cannibal vermin...
th_th: พวกมนุษย์กินคนโสโครก...

source: Savages...
th_th: พวกป่าเถื่อน...

source: Cannibal dogs...
th_th: ไอ้หมามนุษย์กินคน
