Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bayan talk to (bugmaster locked).po
Languages: th_th

source: Is that...? The Bugmaster... Hundreds of years and he's finally been slain...
th_th: นี่มัน...? Bugmaster... กว่าร้อยปีในที่สุดก็โดนโค่น...

source: Call it my trophy. Just thought I'd show it off...
th_th: เรียกมันว่าถ้วยรางวัลขอลข้า แค่คิดจะเอามาอวดโชว์น่ะ...

source: Hm hm! Impressive...
th_th: หึ หึ! น่าประทับใจ...

source: Aye... (Hand him over to Bayan)
th_th: เอ้านี่... (มอบตัวเขาให้ Bayan)

source: Hm hm hm!... I should have expected no less of the famous Battle Born.
th_th: หึ หึ หึ!... ข้าควรมีความคาดหวังกับนักรบโดยกำเนิดผู้มีชื่อเสียงสินะ.

source: Honoured, legendary /YOURNAME/.
th_th: ถือเป็นเกียรติ /YOURNAME/ในตำนาน

source: Is that...? The Phoenix mutt...
th_th: นี่มัน...? ไอ้เวร Phoenix...

source: The one and only... (Hand him over to Bayan)
th_th: หนึ่งเดียวเลยล่ะ... (มอบตัวเขาให้ Bayan)

source: Mmh... It really is... I should have expected no less of the famous Battle Born.
th_th: ฮืม... ใช่จริงด้วย... ข้าควรมีความคาดหวังกับนักรบโดยกำเนิดผู้มีชื่อเสียงสินะ.

source: Valtena of the East...?
th_th: Valtena แห่งทางตะวันออก...?

source: Seta of the South...?
th_th: Seta แห่งทิศใต้...?
