Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bayan talk to.po
Languages: th_th

source: The Stone Golem saves her energies for the art of combat. Not the art of gum flapping, as my lady describes it. And that's why I'm here. What do you want, outsider? And make it quick, I'm a busy man.
th_th: The Stone Golem เก็บแรงของนางไว้สำหรับศิลปะการต่อสู้ ไม่ใช่การใช้ปากพูดจาพร่ำเพรื่อ อย่างที่ผู้หญิงของข้าอธิบาย และนั่นคือเหตุผลที่ข้ามาที่นี่ เจ้าต้องการอะไรเจ้าคนนอก เร็วเข้า, ข้าไม่ค่อยว่าง.

source: I wanted to propose an alliance.
th_th: ข้าต้องการเสนอการเป็นพันธมิตร.

source: ... An alliance, you say?... [He stifles an odd-looking grin]
th_th: ...เป็นพันธมิตร, เจ้าพูด?...[เขายับยั้งรอยยิ้มที่ดูแปลกๆ]

source: Hmph! The shek do not 'need' help. They win their battles by their own sword or they don't win them at all. It is one or the other. In the Shek Kingdom alliances are not handed out to nobodies like sake in a swamp...
th_th: ฮึ่ม! Shek ไม่ต้องการความช่วยเหลือ พวกเขาชนะการต่อสู้ด้วยดาบของพวกเขาเองหรือพวกเขาจะไม่ชนะเลย มันเป็นอย่างใดอย่างหนึ่ง ในสหราชอาณาจักร Shek พันธมิตรไม่ได้แจกให้พวกบ้าชื่อเสียงง่ายๆ อย่างกับสาเกในบึง

source: How about I take care of your Berserker problem?
th_th: แล้วถ้าเกิดข้าแก้ปัญหาเรื่อง Berserker ของท่านให้ล่ะ?

source: Futility. You think the Stone Golem needs help dealing with lost kin? Let them do what they will, it is OUR business.... Next question, outlander!
th_th: เปล่าประโยขน์ เจ้าคิดว่า Stone Golem ต้องการความช่วยเหลือในการจัดการกับพี่น้องที่หลงผิดรึ? ให้พวกมันทำที่มันอยากเถอะ นี่มันเรื่องของพวกข้า.... คำถามต่อไป, เจ้าคนนอก!

source: What if I kill the Phoenix for you?
th_th: หากข้า ฆ่า Phoenix ให้ท่านล่ะ?

source: Hm hm! Amusing. I dare you to bring him to me. Kill the Phoenix, or the Bugmaster for that matter, and I'll sing your praise until death takes me to the other side...
th_th: อืมหืม! น่าขัน. ข้าท้าให้เจ้าพามันมาหาข้า ฆ่า Phoenix หรือ Bugmaster หากเจ้าทำได้ ข้าจะร้องเพลงสรรเสริญให้เจ้า จนกว่าความตายจะพาข้าไปอีกด้านหนึ่ง ...

source: Forget I ever asked. I have another question...
th_th: ช่างคำถามมันเถอะ ข้ามีคำถามอื่น...

source: Mmmmph... The Stone Golem was right. You outsiders do talk too much.
th_th: อืมมม... Stone Golem พูดถูก เจ้าเป็นคนนอกที่พูดมากจริงๆ

source: Your loss. I'll take my leave.
th_th: เจ้าแพ้ ข้าไปล่ะ.

source: What if I kill the Bugmaster for you?
th_th: หากข้า ฆ่า Bugmaster ให้ท่านล่ะ?

source: Hm hm! Amusing. Kill the Bugmaster, or the Phoenix for that matter, and I'll sing your praise until death takes me to the other side...
th_th: อืมหืม! น่าขัน. ฆ่า Bugmaster หรือ Phoenix ถ้ามันเกิดขึ้น ข้าจะร้องเพลงสรรเสริญให้เจ้า จนกว่าความตายจะพาข้าไปอีกด้านหนึ่งเลย ...

source: How about I donate funds to you?
th_th: เอาเป็นว่าถ้าบริจาคเงินให้ล่ะ?

source: ... [He raises an eyebrow and scowls]
th_th: ... [เขายกคิ้วและหน้าบึ้ง]

source: ... Or not then.
th_th: ... หรือไม่แล้ว.

source: [He shakes his head]
th_th: [เขาส่ายหัว]

source: An alliance, you say?
th_th: เป็นพันธมิตร,เจ้าพูด?

source: Mmh! An enemy of the Holy Nation is an ally of the Shek.
th_th: อืม! ศัตรูของพวก Holy Nation ย่อมเป็นพันธมิตรของ Shek

source: With the mighty Bugmaster slayer? Mmh, it would be Esata's honor! An enemy of yours is an enemy of the Shek, kin.
th_th: กับผู้พิชิต Bugmaster ผู้เกรียงไกรรึ? มันเป็นเกียรติของ Esata! ศัตรูของเจ้าคือศัตรูของ Shek, พี่น้องข้า.

source: With the mighty Phoenix slayer? Mmh, it would be Esata's honor! An enemy of yours is an enemy of the Shek, kin.
th_th: กับผู้พิชิต Phoenix ผู้เกรียงไกรรึ? มันเป็นเกียรติของ Esata! ศัตรูของเจ้าคือศัตรูของ Shek, พี่น้องข้า.

source: You've already earned our camaraderie, kin. An enemy of yours is an enemy of the Shek.
th_th: เจ้าได้รับการยอมรับแล้ว, พี่น้อง. ศัตรูของเจ้าคือศัตรูของ Shek.

source: Then that is all. Thank you, Bayan.
th_th: แค่นั่นก็เพียงพอแล้ว. ขอบคุณ, Bayan

source: Hmph! With a Holy Nation /MUTT/? No... It's us or them. In the Shek Kingdom alliances are not handed out like sake in a swamp...
th_th: เฮอะ! กับพวก/MUTT/ Holy Nation รึ? ฝันไปเถอะ ... ไม่ว่าจะเป็นพวกเราหรือพวกมัน ในสหราชอาณาจักร Shek ความเป็นพันธมิตรไม่ได้แจกกันง่ายๆ เหมือนสาเกในบึง ...

source: Hmph! With YOUR allies? No... It's us or them. In the Shek Kingdom alliances are not handed out like sake in a swamp...
th_th: เฮอะ! พันธมิตรกับพวกของเจ้ารึ? ฝันไปเถอะ ... ไม่ว่าจะเป็นพวกเราหรือพวกมัน ในสหราชอาณาจักร Shek พันธมิตรไม่ได้เป็นกันง่ายๆ เหมือนแจกสาเก ในบึง ...

source: What happened to your horns?
th_th: เกิดอะไรขึ้นกับเขาของท่าน?

source: [He winces, shrivels his face as if sucking on a sour greenfruit]
th_th: [เขาสะดุ้ง, ใบหน้าเหี่ยวเฉา ราวกับดูดลูกเขียว]

source: ... Are my horns really that important to you, /OUTSIDER/?
th_th: ... เขาของข้ามีความสำคัญยังไงกับเจ้ารึ? /OUTSIDER/

source: Yeah, I mean, you're not a proper shek without them, right?
th_th: เอ่อ, ข้าหมายความว่าหากไม่มีมันท่านก็ไม่ใช่ Shek จริงใช่ไหม?

source: They were lost... I lost. Curse tradition, death is the easy path. I stand and face the consequences of defeat rather than cutting my shame short. I chose not to abandon the kingdom's cause for my own selfish preservation of honor. And because of that, I'm alive to fulfil my purpose. To serve the Stone Golem...
th_th: พวกมันหายไป ... ข้าแพ้ ประเพณีต้องสาป เลือกความตายนั้นง่ายกว่า ข้าลุกขึ้นและเผชิญหน้ากับผลที่ตามมาของความพ่ายแพ้ มากกว่าที่จะลดความละอาย ข้าเลือกที่จะไม่ละทิ้งมูลเหตุของราชอาณาจักรเพื่อรักษาเกียรติอันเห็นแก่ตัวของตัวเองเอาไว้ และด้วยเหตุนี้ข้าจึงมีชีวิตอยู่เพื่อบรรลุวัตถุประสงค์ของข้า เพื่อรับใช้ Stone Golem ...

source: Hmph. So are you done with the senseless questions, /OUTSIDER/?
th_th: เหอะ. เจ้าถามคำถามที่ไร้สติจริงๆ /OUTSIDER/?

source: Mmmmph, idiocy. Then make it quick. I grow bored of this incessant chatter...
th_th: อืม. เจ้าโง่ งั้นรีบหน่อย ข้าเบื่อกับการพูดพล่อยไม่หยุดหย่อนนี้แล้ว.

source: Peace and quiet.
th_th: สันติและสงบสุข.

source: Good. See you on the other side, kin.
th_th: ดี แล้วเจอกันอีกฝั่ง,พี่น้อง.

source: I'm just curious how a mighty warrior such as yourself lost his horns...
th_th: ข้าแค่อยากรู้ว่านักรบผู้ยิ่งใหญ่ เช่นท่านเสียเขาไปได้อย่างไร ...

source: They're not. I shouldn't have asked.
th_th: ไม่ใช่ตอนนี้. ข้าไม่ควรถาม.

source: Can I speak with the Stone Golem?
th_th: ข้าสามารถคุยกับ Stone Golem ได้หรือไม่?

source: Impatience. I already told you, /OUTSIDER/, no... What business can a stranger wielding a rusted sword possibly have with the mighty Shek empress...?
th_th: การขาดความอดทน ข้าได้บอกเจ้าไปแล้ว /OUTSIDER/, ฝันไปเถอะ ... คนแปลกหน้าที่มีดาบเหล็กขึ้นสนิม เป็นไปได้เหรอ ว่ามีธุระกับจักรพรรดิผู้ยิ่งใหญ่ Shek ... ?

source: You may, kin. But, as I said before, the empress is not one for words.
th_th: เจ้าอาจได้ พี่น้อง แต่อย่างที่ข้าบอก จักรพรรดินีจะไม่ปริปากซักคำ.

source: You may, kin. The empress will be honoured to meet such a warrior in the flesh.
th_th: เจ้าอาจได้ พี่น้อง จักพรรดินีถือเป็นเกียรติที่ได้พบนักรบตัวเป็นๆ

source: I've no business, sorry to disturb you.
th_th: ข้าไม่มีธุระ ขอโทษที่รบกวนท่าน.

source: Honor to you, kin. As you know, the Stone Golem is not one for gum flapping as she so fondly describes it. That's what I'm here for. So, what do you need?
th_th: เป็นเกียรติอย่างยิ่ง, พี่น้องข้า. อย่างที่เจ้ารู้, Stone Golem ไม่ใช่หนึ่งสิ่งที่ใครจะพูดพล่อยๆ ถึงนาง นั่นคือเหตุผลที่ข้ามาที่นี่. ดังนั้น, เจ้าต้องการอะไร?

source: Honor to you, Phoenix slayer. What do you need?
th_th: เป็นเกียรติอย่างยิ่ง, ผู้สังหาร Phoenix อะไรที่เจ้าต้องการ?

source: Honor to you, Bugmaster slayer. What do you need?
th_th: เป็นเกียรติอย่างยิ่ง, ผู้สังหาร Bugmaster อะไรที่เจ้าต้องการ?

source: Mmh... It really is... Our most infamous of enemies.
th_th: อืม ... มันคือ ... ศัตรูที่น่าอับอายที่สุดของพวกข้า.

source: Speak to Esata, kin. She'll be honored by your company.
th_th: คุยกับ Esata, พี่น้องข้า. นางจะให้เกียรติกับกลุ่มของท่าน.

source: You'll go down in history for this, as a true ally of the Shek...
th_th: ท่านจะถูกจารึกไปในประวัติศาสตร์สำหรับสิ่งนี้ ในฐานะพันธมิตรที่แท้จริงของ Shek ...

source: It was nothing. I enjoyed the challenge.
th_th: มันไม่สำคัญหรอก. ข้าแค่สนุกกับการท้าทาย.

source: I just want my bounty. I'm not interested in your alliance... or gaining your enemies.
th_th: ข้าแค่ต้องการเงินรางวัล ข้าไม่สนใจพันธมิตรของท่าน ... หรือเป็นศัตรูกับท่าน.

source: Pity. You'd make a fine Invincible.
th_th: น่าเสียดาย เจ้าจะกลายเป็นผู้ไร้เทียมมาน

source: Leave, Okranite /MUTT/. You're not welcome here.
th_th: ออกไปจาก, Okranite /MUTT/ เจ้าไม่ได้รับการต้อนรับที่นี่.

source: Leave, Empire money grubber. You're not welcome here.
th_th: ออกไป, จักรวรรดิหน้าเงิน คนละโมบ เจ้าไม่ได้รับการต้อนรับที่นี่.

source: An ally of the Traders Guild is no ally of the Shek. Leave.
th_th: พันธมิตรของ Traders Guild นั้นไม่ใช่พันธมิตรของ Shek ออกไป..

source: ... Slain by an Okranite dog... Shame. Well, better take him to the Phoenix mutt since you kiss his feet so much.
th_th: ถูกสังหารโดยสุนัขชาว Okranite...น่าอับอาย อืม ควรพาตัวเขาไปให้สุนัข Phoenix นะ ไหน ๆ เจ้าก็คอยเลียแข้งเลียขามันอยู่แล้วนี่.

source: I just want my reward... (Hand him over to Bayan)
th_th: ข้าแค่ต้องการรางวัลของข้า ... (ส่งเขาไปให้ Bayan)

source: Take your money and leave.
th_th: รับเงินของเจ้าแล้วไปซะ.

source: Slain by an Empire boot licker... Shame. Such impressive skills wasted on such a loathsome allegiance...
th_th: ถูกสังหารโดย พวกขี้ประจบของจักรวรรดิ ... อัปยศ ทักษะที่น่าประทับใจดังกล่าวสูญเปล่าไปกับความจงรักภักดีที่น่ารังเกียจ ...

source: Slain by an noble boot licker... Shame. Such impressive skills wasted on such a loathsome allegiance...
th_th: ถูกสังหารโดย พวกขี้ประจบของขุนนาง ... อัปยศ ทักษะที่น่าประทับใจดังกล่าวสูญเปล่าไปกับความจงรักภักดีที่น่ารังเกียจ ...

source: ... Hmph. Think I'd fall for your trickery, Empire boot licker? The Shek can't be fooled with gifts, and they certainly don't need the help of a United Cities /FLATSKIN/ to defeat their enemies!
th_th: ... หืมม คิดว่าข้าจะตกหลุมของเจ้า พวกขี้ข้าจอมประจบจักรวรรดิ? Shekไม่สามารถถูกหลอกได้ด้วยของขวัญ และแน่นอนพวกเขาไม่ต้องการความช่วยเหลือจาก United Cities. /FLATSKIN/เพื่อกำจัดศัตรู!

source: Take him away.
th_th: พามันออกไป.

source: ... Shame. Either an honorless dog stabs /HIS/ own king in the back, or a devious snake takes the Shek for fools...
th_th: ... ความอัปยศ. ไม่ว่าจะเป็นสุนัขที่ไร้เกียรติแทง /HIS/ กษัตริย์ของตัวเองจากด้านหลังหรืองูคดเคี้ยว มันทำให้ Shek ดูโง่ ...

source: ... Hmph. Think I'd fall for your trickery, noble boot licker? The Shek can't be fooled with gifts, and they certainly don't need the help of a Traders Guild /FLATSKIN/ to defeat their enemies!
th_th: ... หืมม คิดว่าข้าจะตกหลุมของเจ้า พวกขี้ข้าจอมประจบขุนนาง? Shek ไม่สามารถถูกหลอกได้ด้วยของขวัญและแน่นอนพวกเขาไม่ต้องการความช่วยเหลือจาก Traders Guild /FLATSKIN/ เพื่อเอาชนะศัตรูของพวกเขา!
