Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/beep talk to recruit.po
Languages: th_th

source: Uhh... Hi Beep...
th_th: เอ่อ...สวัสดีบิ๊บ...

source: ...how... how do you know my name?
th_th: ...ระ... รู้ชื่อของข้าได้ยังไง?

source: It was just a guess
th_th: ก็แค่เดาน่ะ

source: You just said "beep" for no reason, so I thought maybe you were introducing yourself
th_th: เจ้าพูดว่า"บิ๊บ"แบบไม่มีเหตุผล ข้าเลยคิดว่าบางทีเจ้าอาจกำลังแนะนำตัวอยู่ก็ได้น่ะ

source: ...You must be some kind of genius then?
th_th: ...เจ้าต้องเป็นอัจฉริยะแน่เลยสินะ?

source: Err... are you taking the piss?
th_th: เอ๋...นี่กวนตีนกันปะเนี่ย?

source: Beep
th_th: บี๊บ

source: I think you are!
th_th: ข้าคิดว่าเจ้าทำนะ!

source: [He swallows nervously] Sir, I would never steal your piss...
th_th: [เขากลืนน้ำลายอย่างกังวล] ท่าน ข้าจะไม่กวนเท้าท่านเลยนะ...

source: Yes, yes I am.
th_th: จ้าจ้า ข้าเองแหละ

source: Can I join you? I want to become strong, become a swordsman
th_th: ข้าขอเข้าร่วมด้วยได้ไหม? ข้าอยากเก่งขึ้น อยากเป็นนักดาบ

source: You don't look very strong. You don't even have a weapon. Do you have any skills?
th_th: เจ้าดูไม่แข็งแกร่งเลยนะ ไม่มีกระทั่งดาบด้วยซ้ำ มีทักษะอะไรบ้างไหม?

source: Sorry, I beep when I'm nervous
th_th: ขอโทษด้วย, ข้าบิ๊บตอนข้ากังวลใจ

source: That's a bit weird
th_th: มันแปลกไปหน่อยนะ

source: They exiled me from the Hive
th_th: พวกเขาขับไล่ข้าออกจากรัง

source: Just because you keep saying "beep"?
th_th: เพียงเพราะแค่เจ้าพูดว่า"บิ๊บ"น่ะนะ?

source: I am defective. Not good for the Hive.
th_th: ข้ามันของบกพร่อง ไม่ดีต่อรัง.

source: But Beep doesn't give up! Beep is strong!
th_th: แต่บิ๊บไม่ยอมแพ้! บิ๊บน่ะแข็งแกร่ง!

source: Since I left the Hive I can feel my mind changing, the way I think, I feel free, having thoughts I never had before. I want freedom, but everywhere I go things try to kill me or chase me.
th_th: พอได้ออกจากรังข้าก็สามารถรู้สึกได้ถึงความคิดที่เปลี่ยนไป สิ่งที่ข้าคิด ข้ารู้สึกอิสระ ได้คิดในสิ่งที่ไม่เคยคิดมาก่อน ข้าอยากได้อิสระ แต่ทุกที่ที่ข้าไปต้องมีสิ่งที่พยายามฆ่าข้าไม่ก็ไล่ล่าข้าทุกที.

source: Beep tires of running. Time to stab the things that chase me.
th_th: บิ๊บเหนื่อยที่ต้องวิ่งหนี ได้เวลาสู้กับพวกที่ไล่ตามข้าแล้ว.

source: *sigh* Another weak nobody. How much money do you want?
th_th: *เฮ้อ*พวกคนอ่อนแอไร้ชื่อเสียงอีกคน ต้องการเงินเท่าไหร่ล่ะ?

source: Money? I don't know what that means.
th_th: เงิน? ข้าไม่รู้ว่าหมายความว่ายังไง.

source: Welcome to the team!
th_th: ยินดีต้อนรับเข้าสู่ทีม!

source: No thanks, come back when you're stronger
th_th: ไม่ล่ะ ขอบคุณ ไว้มาใหม่ตอนเจ้าเก่งขึ้นแล้วกัน

source: I don't blame them
th_th: ข้าไม่โทษพวกนั้นหรอกนะ

source: ...nevermind
th_th: ...ช่างมันเถอะ

source: Why are you following me?
th_th: ตามข้ามาทำไมเนี่ย?
