Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Being healed.po
Languages: th_th

source: Ack!
th_th: อั๊ก!

source: Urk..
th_th: อุก...

source: W-wait wait wait! OWWW!
th_th: ด-เดี๋ยว เดี๋ยว เดี๋ยว! โอ้ยยย!

source: No, wait don't do tha- /ARG/!
th_th: ไม่ เดี๋ยวอย่าทำงั้- /ARG/!

source: No, don't touch that... stop! /ARG/!
th_th: ไม่ อย่าแตะต้องมั- /ARG/!

source: Oh god, make the pain stop!
th_th: พระเจ้า ช่วยหยุดความเจ็บนี่ที!

source: My leg.. my damn leg, make it stop! Ahh the pain!
th_th: ขาข้า...ไอ้ขาของข้า หยุดมันที! อ๊าา ความเจ็บนี่น่ะ!

source: Dammit, my leg! Nghhhh!
th_th: เวรเอ้ย ขาข้า! อ้าาาา!

source: My leg, it's gone numb...
th_th: ขาข้า ไม่รู้สึกอะไรแล้ว...

source: Is it broken? It looks kinda bent...
th_th: มันหักแล้วเหรอ? มันดูงอนะ...

source: Is it broken? It looks kinda shonky...
th_th: มันหักแล้วเหรอ? มันดูไม่ได้เลยนะ...

source: I... I can't feel my arm!
th_th: ข้า...ข้าไม่รู้สึกถึงแขนข้าเลย!

source: My arm! Is it gonna be okay?!
th_th: แขนข้า! มันจะไม่เป็นไรใช่ไหม?!

source: /FUCK/, that hurts!
th_th: /FUCK/ เจ็บชิบหาย!
