Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Being healed start noble.po
Languages: th_th

source: Fix it!
th_th: รักษาซะ!

source: /YUCK/! Your hands are so sticky!
th_th: /YUCK/! มือเจ้ามันเหนียวชะมัด!

source: /YUCK/! Wash your hands first!
th_th: /YUCK/! ไปล้างมือก่อนไป๊!

source: /YUCK/! Don't touch me with those /DIRTY/ stick fingers!
th_th: /YUCK/! อย่าแตะต้องข้าด้วยนิ้วมือเหนียวเหนอะ /DIRTY/ พวกนั้นเชียว!

source: It HURTS!!!
th_th: เจ็บนะโว้ย!

source: OUCH! Stop poking me with those boney fingers! /YUCK/!
th_th: โอ้ย! หยุดจิ้มข้าด้วยพวกนิ้วก้างๆ พวกนั้นที! ! /YUCK/!

source: Make it better, NOW!
th_th: ทำให้มันดีๆ หน่อยสิวะ ตอนนี้เลย!

source: The pain!
th_th: เจ็บโว้ย!

source: I'm bleeding!!
th_th: เลือดข้าไหลแล้วเนี่ย!!

source: Is this MY blood!?
th_th: นั่นเลือดข้าเรอะ!?

source: Do NOT screw this up...
th_th: อย่าทำมันแย่ลงนะเว้ย...

source: Do NOT fail me...
th_th: อย่าทำพลาดนะเว้ย...

source: Better not screw this up...
th_th: อย่าทำพังดีกว่านะเว้ย...

source: Screw this up and I'll have your head...
th_th: ถ้าทำให้มันแย่กว่าเดิมหัวเจ้าหลุดแน่...
