Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Berserker tracks down player assault.po
Languages: th_th

source: Come out, come out, slayer!
th_th: ออกมานี่ๆ ผู้สังหาร!

source: /IWE/'ve travelled far to find you....
th_th: /IWE/เดินทางมาไกลเพื่อเจอเจ้า...

source: I've waited a long time for this moment...
th_th: ข้ารอเวลานี้มานานแล้ว...

source: With the Bugmaster gone, /MYOUR/ glory lies with you now...
th_th: ตอนนี้ Bugmaster จากไปแล้ว ตอนนี้เกียรติก็ได้อยู่ที่/MYOUR/...

source: Now that the Bugmaster is gone, it is you who will lead us to gateway...
th_th: ตอนนี้ Bugmaster จากไปแล้ว จึงเป็นเจ้าที่ต้องชี้ทางเราสู่สรวงสวรรค์...

source: Now that the Bugmaster is gone, I expect a mighty battle from you...
th_th: ตอนนี้ Bugmaster จากไปแล้ว ข้าคาดหวังการต่อสู้อันยิ่งใหญ่จากแจ้า...

source: Today you give me my glory, or I join my kin on the other side...
th_th: วันนี้ท่านจะมอบเกียรติให้ข้า หรือข้าจะได้ร่วมกับเหล่าพี่น้องไปยังโลกหน้ากัน...

source: Today I will kill the undefeated. Or I will join my kin in Gateway...
th_th: วันนี้ี้ข้าจักสังหารผู้อมตะได้ หรือข้าจะได้ร่วมกับเหล่าพี่น้องสู่สรวงสวรรค์กัน...

source: And you'd better not disappoint /MEUS/...
th_th: และเจ้าอย่าได้หมิ่นเกียรติของ/MEUS/เชียว...

source: And you'd better live up to your reputation...
th_th: และเจ้าจะได้ใช้ชีวิตตามที่ชื่อเสียงคาดหวัง...

source: Either way, only one of us will walk away today...
th_th: ถึงแม้ จะมีหนึ่งในเราต้องจากไปในวันนี้...

source: Either way, one of us dies today...
th_th: ถึงแม้ จะมีหนึ่งในเราจะตายไปในวันนี้...

source: Fight me, warrior/S/! Give me my death or give me by glory!
th_th: สู้กับข้าเสีย นักรบ! จงมอบความตายหรือไม่ก็ชัยให้แด่ข้า!

source: Raise your sword/S/, warrior/S/! Today will be a day of history!
th_th: ชักดาบขึ้นเสีย นักรบ! วันนี้จักเป็นวันแห่งประวัติศาสตร์!

source: Today is a good day to die, warrior/S/!
th_th: วันนี้ช่างเหมาะแก่การตายนัก นักรบ!

source: Bring me a good battle!
th_th: ให้ข้ามีการต่อสู้ที่ดีหน่อย!

source: Finally...
th_th: ในที่สุด...

source: Finally. /YOURNAME/.
th_th: ในที่สุด /YOURNAME/.

source: Hm hm. We finally meet, /YOURNAME/.
th_th: หึ หึ ในที่สุดเราก็พบ/YOURNAME/.
