Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Big grim talk to diplomat.po
Languages: th_th

source: New /GUY/, eh? Heard you got somethin' to say to me... Go.
th_th: /GUY/หน้าใหม่,ไหน? ได้ยินว่าเจ้ามีอะไรจะพูดกับข้านิ...ว่ามา

source: I want to join the Hounds.
th_th: ข้าต้องการเข้าร่วม Hounds.

source: You do, eh? Well, you wanna join the Hounds, you gotta work for the Hounds. You in, or you out, newbie?... Go.
th_th: จริงเหรอ,ไหน? เจ้าอยากจะเข้าร่วม Hounds, เจ้าจะต้องทำงานให้ Hounds. เจ้าจะเอาหรือไม่เอา,เด็กไหม่...เลือก.

source: In.
th_th: เอา

source: Alright, pup. I'm sendin' you on a lil' smugglin' mission. Yer gonna take these packages, yer gonna dump 'em in the UC, you AIN'T gonna get caught... and then yer gonna bring me back my profits.
th_th: เอาหละ.ไอ้ลูกหมาข้าจะส่งเจ้าไปลักลอบขนของ เจ้าจะต้องรับห่อของนี่ เอาไปส่งที่ UC เจ้าจะต้องไม่ถูกจับ แล้วเจ้าก็ต้องเอากำไรมาให้กับข้า

source: If you ain't back in a week, I'll kill ya.
th_th: ถ้าเจ้าไม่กลับมาใน1อาทิตย์ ข้าจะฆ่าเจ้า

source: Out.
th_th: ไม่เอา

source: Out, eh? Well, don't come crawlin' back to me, newbie. You had yer chance.
th_th: ไม่เอาสินะ? งันก็ไม่ต้องคลานกลับมาหาข้าล่ะ ข้าให้โอกาศเจ้าแล้วนะ

source: Now, gid outta my HQ.
th_th: เอาล่ะ,ออกไปจากฐานของข้า

source: What's the work?
th_th: งานเป็นยังไง?

source: IN. OR. OUT... GO.
th_th: เอา หรือ ไม่เอา...เลือก

source: I wanted to make a donation to the Hounds.
th_th: ข้าอยากจะมอบเงินให้ Hounds.

source: You think my Hounds can be bought with CATS? Gid outta heeyah! Ain't nobody buyin' the Hounds! We earn our own way, free livin' in the swamp! You wanna wave your Cats 'round, go join the UC, eh?
th_th: เจ้าคิดว่า Hounds สามารถซื้อได้ด้วยเงินงั้นเหรอ?ใสหัวออกไป!ไม่มีไครซื้อHoundsได้!เรามีทางหาเงินของเรา เรามีอิสระใน swamp!ถ้าเจ้าต้องการจะอวดเงินของเจ้า ก็ไปอยู่กับUCโน่น

source: Didn't mean to offend you.
th_th: ข้าไม่ได้ต้องการจะทำให้เจ้าโกรธ

source: Look, you wanna join the Hounds, you gotta work for the Hounds. You in, or you out, newbie?... Go.
th_th: เอาหล่ะ,เจ้าอยากจะเข้าร่วมHoundsใช่มั้ย,เจ้าจะต้องทำงานให้ Hounds จะเอาหรือไม่เอา...เลือก

source: You say that, but I did just have to pay a guy called Ears 2000 Cats...
th_th: ถึงเจ้าจะพูดอย่างงั้น แต่ข้าเห็นเจ้าจ่ายเงินให้ Ears 2000 cats...

source: You gettin' smart with me, /BOY/? You wanna get by in the swamps, you gotta learn that different doors need different keys. Got it?
th_th: เจ้ามาอวดฉลาดกับข้าเหรอ, /BOY/? ถ้าเจ้าอยากจะอยู่รอดใน swamps เจ้าต้องเรียนรู้ว่าประตูที่ต่างกันก็ต้องใช้กุญแจที่ต่างกัน เข้าใจมั้ย

source: ... Sure.
th_th: ...โอเค

source: ... So you accept bribes depending on your mood?
th_th: ...แสดงว่าเจ้าจะรับสินบนหรือไม่ก็แล้วแต่อารมณ์ของเจ้า ใช่มั้ย

source: Guess the newbie don't got it!
th_th: สงสัยเจ้าเด็กไหม่นี่จะไม่เข้าใจว่ะ!

source: Gid outta my HQ.
th_th: ใสหัวออกไปจากฐานของข้า!
