Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Big bo ally recruit.po
Languages: th_th

source: So you're the new /GUY/, eh... Well, how about we have some fun together?
th_th: อ้อ เจ้าคือ /GUY/ใหม่สินะ...อืม ไปหาเรื่องสนุก ๆ ทำกันหน่อยมั้ย?

source: Let's go!
th_th: ไปกันเลย!

source: Bwahaha! Don't let me down, /YOURNAME/...
th_th: อุวะฮะฮ่า อย่าทำให้ข้าผิดหวังนะ /YOURNAME/...

source: Lets find some slavers to fuck up.
th_th: ไปหาพ่อค้าทาสมาซ้อมมือกัน.

source: Bwahaha! Don't let me down, emperor killer...
th_th: อุวะฮะฮ่า อย่าทำให้ข้าผิดหวังล่ะ ผู้สังหารจักรพรรดิเอ๋ย...

source: Bwahaha! Don't let me down, noble killer...
th_th: อุวะฮะฮ่า อย่าทำให้ข้าผิดหวังล่ะ ผู้สังหารขุนนางเอ๋ย...

source: Bwahaha! Don't let me down, monster killer...
th_th: อุวะฮะฮ่า อย่าทำให้ข้าผิดหวังล่ะ ผู้สังหารสัตว์ประหลาดเอ๋ย...

source: You're Big Bo? But you're so small...
th_th: เจ้าคือ Big Bo หรอ? ยังดูเด็กอยู่เลยนะ...

source: Yeah, yeah, looks can be decieving, /YOURNAME/. I got a big bite for a little bark... So, we gonna find some action or what?
th_th: ช่าย ช่ายยย อย่าให้รูปร่างหน้าตาหลอกเจ้าน่า /YOURNAME/. ข้ามีพลังกัดเก่งกว่าส่งเสียงขู่อะนะ...... แล้ว นี่จะลงมือทำอะไรสักอย่างหน่อยมั้ย?

source: No thanks, I don't swing that way.
th_th: เอ่อ ไม่ล่ะ ข้าไม่ได้มีรสนิยมแบบนั้นอ่ะ.

source: Idiot! I'm talking slaver blood... You've got a big reputation to live up to. And I want to break slaver skulls along side it.
th_th: ไอ้ทึ่ม! ข้าหมายถึงไปเอาเลือดหัวพ่อค้าทาสออกกัน... เจ้ามีชื่อเสียงพอตัวที่ต้องรักษาไว้ ส่วนข้าก็อยากฟาดกบาลพวกพ่อค้าทาสไปด้วยระหว่างที่เจ้าลงมือไง.

source: Sorry, I'm not taking recruits right now.
th_th: ต้องขออภัยด้วย ข้าคงไม่ตอบรับคำเชิญเข้าร่วมกลุ่มในตอนนี้นะ.

source: The hell? We could have had fun, you and me!... Dammit!
th_th: อะไรวะ? เราแค่สนุกกันน่า เจ้ากับข้า! ...เวรเอ๊ย!

source: We'd be a force to be reckoned with... Psh!
th_th: เราจะเป็นคู่ที่คนต้องจดจำเลยนะ ฮึ!

source: You, me, our fists, our swords. How about we go tenderize some slaver meat? Don't let me down now, you got a big reputation to live up to...
th_th: เจ้า ข้า ดาบของพวกเรา ไปแล่เนื้อพวกพ่อค้าทาสกันหน่อยมั้ยล่ะ? อย่าทำให้ข้าผิดหวังนะ เจ้ามีชื่อเสียงที่ต้องรักษาไว้อยู่นี่...

source: [She looks over your companions and pouts]... Dang. Your party's looking a little full actually. Maybe another time, eh, /YOURNAME/?
th_th: [นางมองไปยังเพื่อนร่วมทางของเจ้าแล้วมุ่ยปาก]... เฮ้อ เหมือนว่ากลุ่มของเจ้าจะเต็มนะ ไว้ครั้งหน้าดีมั้ย ว่าไง /YOURNAME/?

source: So you're the famous /YOURNAME/ giving Eyegore a run for his money, eh... Well, how about we have some fun together?
th_th: เจ้าโด่งดังมากเลยนี่ /YOURNAME/ ที่จัดการ Eyegore เพื่อค่าหัวของเขาน่ะ เฮ้...ไปหาอะไรสนุก ๆ ทำกันหน่อยมั้ย?

source: So you're the famous /YOURNAME/ giving Kana a run for her money, eh... Well, how about we have some fun together?
th_th: เจ้าโด่งดังมากเลยนี่ /YOURNAME/ ที่จัดการ Kana เพื่อค่าหัวของนางน่ะ เฮ้...ไปหาอะไรสนุก ๆ ทำกันหน่อยมั้ย?

source: So you're the famous /YOURNAME/ giving Longen a run for his money, eh... Well, how about we have some fun together?
th_th: เจ้าโด่งดังมากเลยนี่ /YOURNAME/ ที่จัดการ Longen เพื่อค่าหัวของเขาน่ะ เฮ้...ไปหาอะไรสนุก ๆ ทำกันหน่อยมั้ย?

source: So you're the famous /YOURNAME/ giving Tengu a run for his money, eh... Well, how about we have some fun together?
th_th: เจ้าโด่งดังมากเลยนี่ /YOURNAME/ ที่จัดการ Tengu เพื่อค่าหัวของเขาน่ะ เฮ้...ไปหาอะไรสนุก ๆ ทำกันหน่อยมั้ย?

source: Bwaha, I knew you'd be back. What kind of moron rejects THE Big Bo anyway?
th_th: ว่ะฮะฮ่า ข้ารู้ว่าเจ้าต้องกลับมา ไม่มีไอ้หน้าโง่คนไหนปฏิเสธ Big Bo ได้อยู่แล้วนิ?

source: So you're the new /GUY/, eh... Well, how about you come back to me when you've trained up a little more. I'm not here to hand hold rookies...
th_th: เจ้าคือ /GUY/หน้าใหม่นี่ อืม...เอาเป็นว่าเจ้ากลับมาหาข้าอีกทีหลังจากไปฝึกฝนตนอีกหน่อยดีกว่า ข้าไม่มีเวลามาจูงมือเด็กใหม่น่ะ...

source: Come back to me when you've assassinated your first slave master, eh?
th_th: กลับมาหาข้าหลังจากที่เจ้าลอบสังหารพ่อค้าทาสคนแรกได้ ตกลงนะ?

source: Good luck! Bwaha!
th_th: โชคดีล่ะ! ว่ะฮะฮ่า!

source: So you're the new /GUY/, eh... Heard you been causing quite some chaos in the stone camps, bwahaha! Well, how about we have some fun together?
th_th: เจ้าคือ /GUY/หน้าใหม่นี่ อืม...ได้ยินมาว่าเจ้าสร้าางวีรกรรมไว้ในค่ายของพวก stones นี่ ว่ะฮะฮ่า! สนใจจะออกไปหาเรื่อสนุกทำกันหน่อยมั้ย?

source: So you're the new /GUY/, eh... I've been hearing all about your desert noble shenanigans, bwahaha!... Well, how about we have some fun together?
th_th: เจ้าคือ /GUY/หน้าใหม่นี่ อืม... ข้าได้ยินเรื่องของเจ้าเกี่ยวกับพวกสำมะเลเทเมาในทะเลทรายมาอยู่นะ ว่ะฮะฮ่า! สนใจจะออกไปหาเรื่อสนุกทำกันหน่อยมั้ย?
