Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome cower.po
Languages: th_th

source: I don't like this fog...
th_th: ข้าไม่ชอบหมอกนี้ ...

source: This fog feels... wrong
th_th: หมอกนี้ให้ความรู้สึก...ผิดปกติ

source: I don't like this place...
th_th: ข้าไม่ชอบสถานที่นี้ ...

source: Something's not right....
th_th: บางสิ่งไม่ถูกต้อง ....

source: ...something's not right about this place...
th_th: ... มีบางอย่างไม่ถูกต้องเกี่ยวกับสถานที่นี้ ...

source: I don't like this, not one bit...
th_th: ข้าไม่ชอบที่นี่เลย ไม่เลยสักนิด ...

source: We should get the hell out of this place
th_th: เราควรรีบสับตีนออกจากที่นี่ให้ไว

source: Let's turn back
th_th: หันหลังกลับกันเถอะ

source: The fog islands of Mongrel
th_th: หมู่เกาะแห่งหมอก ของชาวMongrel

source: The fog islands
th_th: หมู่เกาะหมอก

source: We should try to stay up high, out of the fog
th_th: เราควรพยายามอยู่ให้สูงจากหมอก

source: Only the most desperate ever come here
th_th: มีแต่พวกที่หมดอาลัยตายอยากทั้งนั้นแหละที่มาที่นี่น่ะ

source: Refugees from the Holy Nation, hoping to lose their pursuers to the Fogmen...
th_th: ผู้ลี้ภัยจาก Holy Nation หวังว่าจะสลัดคนไล่ล่าให้กับ fogmen...

source: Wait, Fogmen? What are Fogmen!?
th_th: เดี๋ยวก่อน Fogmen? Fogmen คืออะไร!?

source: What, you scared? /QUICKLAUGH/!
th_th: อะไร แกกลัวเหรอ? /QUICKLAUGH/!

source: Pffft! Men made of fog doesn't sound very scary.
th_th: เฮอะ! มนุษย์ที่สร้างจากหมอก ไม่เห็นน่ากลัวตรงไหน

source: Scared, eh? Turning yellow?
th_th: กลัวใช่มั้ยล่ะ ซีดไปหมดแล้ว?

source: Shut up!
th_th: หุบปากไปเลย!

source: Shut up, I ain't afraid!
th_th: หุบปาก ข้าไม่กลัวหรอก!

source: I ain't scared! Shut up!
th_th: ข้าไม่กลัว! หุบปาก!

source: People of the Deadhive...
th_th: ประชากรแห่ง Deadhive...

source: We shouldn't try to cross this zone.
th_th: เราไม่ควรพยายามข้ามโซนนี้

source: What's the Deadhive?
th_th: Deadhive คืออะไร?

source: Cousins of other Hives. Lost their minds to parasite
th_th: ลูกพี่ลูกน้องของ Hiveอื่น ๆ สูญเสียจิตใจให้กับปรสิต

source: Controls them from the inside. Nothing can be done for them now.
th_th: ควบคุมพวกเขาจากภายใน ตอนนี้ช่วยอะไรพวกเขาไม่ได้แล้วล่ะ

source: We stick to high places, safer out of the fog.
th_th: อยู่ที่สูงเข้าไว้ จะได้ปลอดภัยจากหมอก
