Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome entries Phoenix world state.po
Languages: th_th

source: So, can I now FINALLY travel through Okran's Pride without being treated like a demonic farm animal?
th_th: ในที่สุด ข้าก็สามารถเดินทางผ่าน Okran's Pride ได้โดยไม่ถูกปฏิบัติเยี่ยงสัตว์เลี้ยงในฟาร์มของพวกปีศาจแล้วใช่ไหม?

source: And the skeletons can FINALLY take over the world in peace?
th_th: ในที่สุดแล้วพวก Skeletons ก็สามารถยึดครองโลกได้ด้วยสันติวิธีหรือ?

source: *awkward silence*
th_th: *ความเงียบงันที่น่าอึดอัด*

source: ... It was a joke.
th_th: ...ข้าแค่พูดล้อเล่นน่ะ

source: See. The Shek gets it. And the Shek never get anything...
th_th: เห็นมั้ย Shek เข้าใจมันด้วยล่ะ แถม Shek ไม่เคยเข้าใจเรื่องอะไรแบบนี้เลยด้วยนะ

source: Mmh?!
th_th: หืมม?!

source: Jokes, I meant jokes. Of course you 'get' things.
th_th: ล้อเล่นน่า ข้าแค่ล้อเล่นเอง แน่นอนอยู่แล้วว่าเจ้า 'เข้าใจ' เรื่องต่าง ๆ

source: Oh, but it's not over yet...
th_th: โอ๊ะ แต่มันยังไม่จบนะ...

source: Next up: We take down the desert Empire.
th_th: ลำดับต่อไป เราต้องจัดการจักรวรรดิในทะเลทรายซะ.

source: Music to my ears!... Sounds like a challenge!
th_th: ยิ่งกว่าเสียงสวรรค์! ...ฟังดูท้าทายดีนะ!

source: It's all so exciting... Sure, everything's a mess right now, but we get the chance to rebuild...
th_th: มันน่าตื่นเต้นจริง ๆ... แน่นอนว่าตอนนี้ทุกอย่างมันวุ่นวายไปหมด แต่พวกเรามีโอกาสที่จะเริ่มต้นสร้างมันขึ้นใหม่นะ...

source: We can start over in Okran's Pride, from fresh.
th_th: เราสามารถเริ่มต้นใหม่ได้ใน Okran's Pride เริ่มจากจุดเริ่มต้นเลย

source: Dunno if it's that simple, kiddo.
th_th: ไม่รู้ว่ามันจะง่ายแบบที่เจ้าคิดหรือเปล่านะ เจ้าหนู

source: Then we kill what's left of everyone, we make it simple.
th_th: ถ้าอย่างนั้นเราก็ฆ่าทุกคนที่เหลือทิ้งซะ มันจะได้ง่ายไง

source: She used to be so innocent...
th_th: นางเคยไร้เดียงสามากนะ...

source: I think we broke her.
th_th: ข้าคิดว่าเราทำให้นางเสียคนแล้ว.

source: It still doesn't feel real to me... that he's gone. That... maybe it can all be over.
th_th: สำหรับข้ามันยังดูไม่เหมือนความจริงเลย...ว่าเขาจากไปแล้ว ว่า...บางทีเรื่องทั้งหมดมันจบลงแล้ว.

source: The Phoenix dog is dead at last! Pride, kin...
th_th: ในที่สุดเจ้าสุนัข Phoenix นั่นตายแล้ว! จงภูมิใจเถิด พี่น้อง...

source: Good riddance to the Harebrain Lord Phoenix...
th_th: กำจัดไอ้ Lord Phoenix สมองกระต่ายนั่นได้ซักที...

source: Blighted be his name.
th_th: ขอให้มันแห้งเหี่ยวไปเสียเถอะ.

source: So, can I now FINALLY take a stroll in the grasslands without holier-than-holy paladins breathing down my neck?
th_th: ในที่สุด ข้าก็สามารถเดินทอดน่องใน glasslands ได้โดยไม่มีพวกโครตบรรพบุรุษพาลาดินศักดิ์สิทธิ์มาหายใจรดต้นคอข้าแล้วใช่ไหม?

source: The Okranite mutt is gone... And by my own blade too, but...
th_th: พวกสุนัข Okranite หายไปแล้ว... ดาบของข้าก็ด้วยเช่นกัน แต่...

source: Frustration!
th_th: น่าหงุดหงิดนัก!

source: With him and the Bugmaster gone, who is left to battle?
th_th: เมื่อเขากับ Bugmaster ไม่อยู่แล้ว ข้าจะเหลือใครให้ต่อสู้ด้วยล่ะ?

source: There are too many left to battle... There always will be.
th_th: เหลือคนอีกมากให้เจ้าไปสู้ด้วย... มีคนอีกมากอยู่เสมอแหละ.

source: We've just taken down a shek-hating god prince...
th_th: เราเพิ่งจะจัดการ เจ้าชายแห่งพระเจ้าที่เกลียดชังพวก Shek ได้...

source: ... If that doesn't make you happy, what does exactly?
th_th: ...ถ้าเรื่องนั้นไม่ได้ทำให้เจ้ายินดี แล้วเรื่องไหนล่ะที่เจ้าจะพอใจ?

source: Death makes me happy.
th_th: มรณาทำให้ข้ามีความสุข

source: You're no fun, you know that? You're the OPPOSITE to fun.
th_th: เจ้านี่ไม่ตลกเลย เจ้ารู้ตัวมั้ย? เจ้านี่ช่างอยู่ตรงกันข้ามกับคำว่าตลกเลย

source: This knowledge makes me happy.
th_th: ความรู้เรื่องนี้ทำให้ข้ามีความสุข

source: I feel... conflicted.
th_th: ข้ารู้สึก...ขัดแย้งจัง

source: Wow, the chosen Okranite FEELS?
th_th: ว้าว Okranite ผู้ถูกเลือก รู้สึกเป็นด้วยเหรอ?

source: And there I thought you were just an empty husk of make-believe scriptures.
th_th: ตลอดมาข้าคิดว่าเจ้าเป็นแค่เปลือกกลวง ๆ ที่บรรจุหลักคำสอนที่ถูกกุขึ้นมาซะอีก.

source: ... And what is there to be conflicted about?
th_th: ...ว่าแต่ เข้ารู้สึกขัดแย้งเรื่องอะไรเหรอ?

source: Just my life's purpose... but...
th_th: แค่เรื่องวัตถุประสงค์ของชีวิตข้าน่ะ...แต่...

source: He spread fear within the Holy Nation. It is for the best to start over, I know...
th_th: เขาทำให้ Holy Nation หวาดกลัว มันดีแล้วที่จะเริ่มใหม่ ข้ารู้...

source: ... If only there were more Griffins in the holy land, it wouldn't have had to come to this.
th_th: ...ถ้าเพียงแต่จะมี Griffins ใน holy land มากกว่านี้ มันก็คงไม่เป็นถึงขั้นนี้

source: ... Thank you.
th_th: ...ขอบคุณมากนะ

source: The guy was basically Longen in a priest robe. What is there to be conflicted about?
th_th: พ่อหนุ่มนั่นเป็นเหมือน Longen ที่ใส่ชุดนักบวชเลยนะ มันมีเรื่องอะไรให้รู้สึกข้ัดแย้งนักหนาเหรอ?

source: Well, I thought he was a pretty decent guy, myself.
th_th: อืม สำหรับข้าแล้ว ข้าคิดว่าเขาเป็นคนใช้ได้เลยนะ.

source: BECAUSE YOU'RE A HUMAN!
th_th: เพราะว่าเจ้าเป็นมนุษย์น่ะสิ!

source: What's so funny?
th_th: มีอะไรตลกนักเรอะ?

source: The Holy Nation's doom!
th_th: The Holy Nation ฉิบหายแล้ว!
