Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome heng.po
Languages: th_th

source: This is Empire territory... The place is rife with slavers... I shouldn't be here.
th_th: นี่คือดินแดนของจักรวรรดิ...มีพ่อค้าทาสเต็มไปหมด...ข้าไม่ควรอยู่ที่นี่

source: I'm an escaped slave. You know what they'll do to me if they see me?!
th_th: ข้าเป็นทาสที่หลบหนีมา เจ้ารู้หรือไม่ว่าพวกเขาจะทำอะไรกับข้าถ้าพวกเขาพบตัวข้านะหา?!

source: You got your brand removed, right? You'll be fine, relax.
th_th: ตราประทับของเจ้าถูกลบไปแล้วนี่ ใช่มั้ย? เจ้าจะไม่เป็นไรหรอก ผ่อนคลายหน่อย

source: ... Hmph, I hate this place! Not sure which is worse: this or the spider plains...
th_th: ...ฮึ่ม ข้าเกลียดที่นี่! ไม่รู้เหมือนกันว่าระหว่างที่นี่กับ spider plains ที่ไหนแย่กว่ากัน...

source: Kneecap you?
th_th: เจ้าถูกทรมานรึ?

source: Guess you'd know, wouldn't you, ex-slaver? *Spit*
th_th: เจ้าคงรู้อยู่แล้วนี่ ใช่มั้ย อดีตพ่อค้าทาส? *ถ่มน้ำลาย*

source: Yup, sure would. Nothing more exilerating than kneecapping a fugitive, heheh.
th_th: ใช่ ข้ารู้สิ ไม่มีอะไรน่าหฤหรรษ์ไปมากกว่าการทรมานพวกผู้ลี้ภัยแล้วล่ะ ฮี่ฮี่

source: I suggest you watch your mouth... and your back if you want to avoid a kneecapping yourself...
th_th: ขอเตือนให้ระวังปากไว้หน่อยดีกว่านะ...ระวังหลังด้วย ถ้าเจ้าไม่อยากโดนทรมานซะเอง...

source: Loosen up, big guy. We're all friends here remember. Heh.
th_th: ผ่อนคลายหน่อย พี่บึ้ก จำไว้ว่าพวกเราทั้งหมดเป็นสหายกัน ฮี่

source: Mah, the United Cities... Nothing I love more than being told what to do by fat bloated nobles...
th_th: เหอะ United Cities ...ไม่มีอะไรที่ข้าจะรักยิ่งกว่าการถูกบอกว่าจะทำอย่างไรกับขุนนางอ้วนหมูตอนนี่ดี ......

source: ... Really? But the nobles are the most feared leaders this side of the world...
th_th: ...จริงดิ? แต่ฟากนี่ของแผ่นดินมองว่าพวกขุนนางนี่คือผู้นำที่โครตน่ากลัวที่สุดเลยนะ...

source: It was sarcasm, genius. Twinblade goons, fatty nobles... Nobody tells /MYNAME/ what to do.
th_th: ข้าแค่ประชด พ่อสมองใส ทั้งลิ่วล้อของ Twinblade ทั้งขุนนางอ้วนฉุ...ไม่มีใครบอกให้/MYNAME/ทำอะไรได้ทั้งนั่นล่ะ

source: I'd like to see you say that to the nobles' faces...
th_th: ข้าอยากเห็นเจ้าพูดแบบนั่นใส่หน้าพวกขุนนางจัง...

source: Try calling them that to their faces, I dare you.
th_th: ลองพูดแบบนั้นต่อหน้าพวกมันดูสิ, ข้าท้าเจ้า.

source: I escape one hell, land in another. Story of my life. Remind me why we're in this place again?
th_th: ข้าหนีรอดจากนรกแห่งหนึ่งมาสู่นรกอีกแห่งหนึ่ง นั่นล่ะคือชีวิตของข้า เตือนข้าอีกครั้งซิว่าทำไมเราถึงมาอยู่ที่นี่ได้?

source: Nobles aside, we're going to need expendable money if we want to survive this place.
th_th: ถึงจะตัดเรื่องขุนนางออกไปได้ แต่เราจำเป็นต้องใช้เงินจำนวนมหาศาลในการเอาชีวิตรอดในที่แห่งนี้นะ

source: We won't get far without. There's no charity for the poor here.
th_th: เราไปไม่รอดแน่ถ้าไม่มีเงิน ที่นี่ไม่ใช่โรงทานสำหรับคนจนด้วย.

source: Heng. Better hope we've got enough bribe money to survive this place...
th_th: เมือง Heng เหรอ หวังว่าเราจะมีเงินติดสินบนพอที่จะทำให้เรารอดชีวิตที่นี่ได้นะ...

source: Bribe money?... Kch. The gluttonous outsiders never cease to surprise me.
th_th: เงินสินบน?...ชิ พวกคนนอกจอมโลภทำให้ข้าประหลาดใจได้เสมอเลยนะ.

source: Bribe money? What, you can just buy your way through life in this place?
th_th: เงิินสินบน? นี่เจ้าคิดว่าจะใช้เงินมาเป็นตัวแก้ปัญหาสำหรับการใช้ชีวิตที่นี่งั้นรึ?

source: Well, if you put it like that...
th_th: อืมม ถ้าเจ้าพูดแบบนั้นล่ะก็....

source: Wow, sounds so easy! In the Holy Nation I'm powerless, but here all I need is Cats...
th_th: ว้าว ฟังดูง่ายดีนะ! ใน Holy Nation ข้านั้นไร้ตัวตน แต่ถ้าเป็นที่นี่ ขอข้าแค่มี Cats...

source: Might want to make yourself some actual money first before you get too attached to that idea...
th_th: ก่อนจะคิดแบบนั้น เจ้าควรหาทางทำมาหากินให้ได้เงินมาเสียก่อนเถอะ...

source: Better make sure we've got some expendable Cats for bribes before we get too cozy here in the canyons..
th_th: ต้องทำให้แน่ใจว่าเราจะมี Cats มากพอที่จะเป็นเงินสินบน เพื่อที่เราจะได้ใช้ชีวิตสบาย ๆ ในหุบเขานี้นะ

source: The United Cities, where the locals worship coins and their own inflated egos...
th_th: United Cities ที่ที่คนบูชาเงินเหรียญแวววาวและอัตตาที่เบ่งบานของพวกเขา...

source: ... Says the guy who worships a god that burns people alive for breathing funny...
th_th: ...ตลกจังที่มันออกจากปากของบุรุษที่มีวิถีชีวิตคือการบูชาพระเจ้าและเผาผู้คนน่ะนะ...

source: A case of confused messengers. My judgement won't be clouded by others' actions.
th_th: เป็นเรื่องของผู้ส่งข่าวที่สับสนน่ะ ไม่มีการกระทำของผู้ใดทั้งสิ้นที่จะครอบงำการตัดสินใจของข้าได้.

source: Ugh. You serve a DEVIL responsible for the murders of thousands. Keep your judgement to yourself, sentinel.
th_th: เหอะ เจ้ารับใช้ปีศาจที่มีส่วนร่วมในการสังหารผู้คนนับพัน เก็บการตัดสินใจของเจ้าไว้เงียบ ๆ เถอะ องครักษ์เอ๋ย!

source: Devil?! Curse you, woman! The teachings of Okran run far deeper than the rogue paladins who serve him!
th_th: ปีศาจเรอะ?! เงียบปากไปนะ นางผู้หญิง! คำสอนของ Okran ลึกซึ้งกว่าพวกพาลาดินนอกลู่นอกทางที่รับใช้พระองค์นะ!

source: And where is this precious god to protect us from his 'rogue paladins', hm?!
th_th: แล้วตอนนี้พระเจ้าที่รักอยู่ไหนล่ะ ทำไมไม่ออกมาปกป้องพวกเราจากพาลาดินนอกลู่นอกทางพวกนั้น หืม?!

source: Hoy, break it up both of you! I'd rather we didn't attract the attention of rogue slavers...
th_th: พอแล้วเฮ้ย ทั้งคู่เลย! ข้าไม่อยากดึงดูดความสนใจจากพวกพ่อค้าทาสนอกรีตนะ...

source: Blind lug headed... *mumble*
th_th: เจ้าหัวทึบตามืดบอดเอ๋ย...*พึมพำ*

source: Oh, the United Cities!.. Wait... fat song, fat song, let me think...
th_th: โอ้ United Cities! ...เดี่๋ยวก่อนนะ...ขอข้าคิดหน่อย...เพลงที่เกี่ยวกับความอ้วน...ความอ้วน...

source: No songs! We get it, the nobles are fat...
th_th: ไม่มีเพลงอะไรทั้งนั้นแหละ! พวกเราเข้าใจดี พวกขุนนางน่ะตุ้ยนุ้ยทั้งนั้น...

source: And twisted, don't forget twisted. We probably shouldn't be here.
th_th: แล้วก็บิดเบี้ยวด้วย อย่าลืมเรื่องบิดเบี้ยวนะ พวกเราไม่ควรอยู่ที่นี่เลยอ่ะ

source: Well, we're already here. No going back now.
th_th: แต่เรามาถึงที่นี่แล้ว ไม่มีทางให้หันหลังกลับแล้วล่ะ
