Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome- howler maze.po
Languages: th_th

source: It's almost completely gone now...
th_th: มันเกือบจะเลือนหายไปแล้วในตอนนี้

source: The city that used to be here, I wonder what's left
th_th: เมืองที่ครั้งหนึ่งเคยอยู่ที่นี่, ข้าสงสัยจังเลยว่าจะมีอะไรเหลืออยู่

source: I'm excited actually. Despite being simultaneously depressed.
th_th: ข้าตื่นเต้นจริง ๆ. แม้จะหดหู่ในเวลาเดียวกัน

source: ...Does that mean there's treasure?
th_th: ...นี่หมายความว่ามีสมบัติอยู่ที่นี่ใช่มั๊ย?

source: I like treasure
th_th: ข้าชอบสมบัติ

source: Depends if it's been cleared out yet. It is pretty close to the empire lands.
th_th: ขึ้นอยู่กับว่า มันถูกเก็บกวาดไปหมดแล้วหรือยัง. เพราะมันอยู่ใกล้กับดินแดนของจักรวรรดิมาก.

source: Howler Maze... This island is a no-man's land. It's not been settled.
th_th: Howler Maze... เกาะนี้เป็นดินแดนที่ไม่มีมนุษย์อยู่เลย. ไม่มีแม้แต่การตั้งถิ่นฐาน.

source: Must be for a good reason...
th_th: มันต้องเกิดอะไรขึ้นที่นี่แน่ๆ...

source: It's the crabs!
th_th: นะ นี่มันพวก crabs!

source: Keep on guard for Howlers...
th_th: คอยระวังพวก Howler หน่อยล่ะ

source: What the /FUCK/ is a Howler?
th_th: Howler นี่มันตัว/FUCK/อะไรวะ?

source: Howler's 'ain't crabs
th_th: Howler ไม่ใช่ crab นะ

source: Y'know, beasts of the maze...
th_th: มันคือสัตว์ประหลาดแห่งเขาวงกต...

source: Yer just makin' up a load of /BULLSHIT/
th_th: เจ้าเอาแต่พล่ามพูดเรื่อง/BULLSHIT/
