Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome- deadlands.po
Languages: th_th

source: Home again I suppose.
th_th: ดูท่าว่าจะกลับมาบ้านอีกครั้งแล้วสินะ.

source: Are you fleshies all geared up for this place?
th_th: นี่นายได้ชิ้นส่วนร่างทั้งหมดมาจากที่นี่เหรอ?

source: Got your reinforced rain coats?
th_th: เตรียมเสื้อกันฝนไว้พร้อมรึยัง?

source: Don't drink the water here
th_th: อย่าดื่มน้ำที่นี่ล่ะ

source: Or get any on your skin
th_th: อย่าแต่จะแตะต้องมัน

source: /GODCURSE/! This is the freakin' Deadlands, we can't come here!
th_th: /GODCURSE/! ที่นี่มัน Deadlands นรก เราไม่ควรมาที่นี่!

source: It's not a place for /MERACE/s...
th_th: นี่ไม่ใช่ที่สำหรับ/MERACE/อย่างข้า...

source: I like it
th_th: ข้าชอบมันนะ

source: Rain feels nice
th_th: ฝนทำให้รู้สึกดี

source: This isn't a home to me
th_th: นี่ไม่ใช่บ้านสำหรับข้า

source: Just a hiding place. It's a safehouse for us to retreat to and mope.
th_th: เป็นเพียงสถานที่หลบซ่อน. มันเป็นเซฟเฮาส์เพื่อให้เราใช้หนีและหยุดเศร้าสร้อยไปกับมัน.

source: Retreat from what?
th_th: หนีจากอะไร?

source: From our failures...
th_th: จากความผิดพลาดของพวกเรา...

source: These broken and fragmented civilisations that don't know how to give up...
th_th: อารยธรรมที่แตกหักและพังทลายเหล่านี้ไม่รู้จักวิธีที่จะยอมแพ้...

source: Great. Now I sound like the others....
th_th: เจ๋ง ตอนนี้ข้าฟังดูเหมือนคนอื่นแล้วสิ...
