Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome entries Longen world state.po
Languages: th_th

source: The slavers were like the life blood of the land...
th_th: พวกพ่อค้าทาสเป็นเหมือนเส้นเลือดที่คอยหล่อเลี้ยงแผ่นดิน...

source: Never thought the day would come where I'd see them fall.
th_th: ไม่อยากเชื่อเลยว่าจะมีวันที่ข้าได้เห็นมันล่มสลายไปกับตา.

source: Feels empowering, don't it?
th_th: รู้สึกมีอำนาจใช่ไหมล่ะ?

source: Taking down the leader of the most deep rooted faction in all the land...
th_th: จัดการโค่นล้มผู้นำของกลุ่มที่ฝังรากลึกที่สุดบนแผ่นดินนี้...

source: This is the beginning of true freedom, comrades. Enjoy it while it lasts...
th_th: นี่คือจุดเริ่มต้นของอิสรภาพที่แท้จริง สหาย จงมีความสุขกับมันตอนที่ยังทำได้นะ

source: 'Cause you never know when the next Tengu's gonna take it away again.
th_th: เพราะเจ้าไม่มีวันรู้หรอกว่า Tengu คนต่อไปจะมาฉกฉวยมันไปจากเจ้าเมื่อใด.

source: I'm sure as hell not letting anyone take it away again.
th_th: ข้าโครตจะมั่นใจว่าจะไม่ยอมให้ใครหน้าไหนเอามันไปได้อีกครั้ง.

source: Mmh! Just let them TRY and take it.
th_th: อืมม! ให้พวกมัน พยายาม มาเอาไปดูสิ.

source: 'Cause you never know when the next Longen's gonna take it away again.
th_th: เพราะเจ้าไม่มีวันรู้หรอกว่า Longen คนต่อไปจะมาฉกฉวยมันไปจากเจ้าเมื่อใด

source: The beginning of a new era...
th_th: จุดเริ่มต้นของยุคสมัยใหม่...

source: I can just hear the songs now! 'Heroes of the outlands'...
th_th: ข้าสามารถได้ยินเสียงเพลงเลยนะ! เพลง 'เหล่าวีรชนแห่ง outlands' น่ะ...

source: Ya know... this is the first time I'm actually interested in hearing a song from you...
th_th: เจ้ารู้มั้ย...นี่เป็นครั้งแรกเลย ที่ข้าสนใจอยากได้ยินเจ้าร้องเพลงน่ะ...

source: Now that I'M in it. Hit me with your screeching, Bard.
th_th: เอาล่ะ ข้าพร้อมแล้ว กรีดร้องใส่ข้าเลย เจ้านักกวี.

source: Can't. Sore throat.
th_th: คงไม่ไหวอ่ะ ข้าเจ็บคอ.

source: Useless!
th_th: ไอ้ตัวไร้ประโยชน์!

source: Not to spoil your celebration... but factions fall and rise like clouds grow and fade.
th_th: ไม่ได้อยากทำลายบรรยากาศเฉลิมฉลองของท่านหรอก...แต่พวกก๊กเหล่านี่เกิดขึ้นแล้วล่มไปไม่ต่างกับเมฆบนฟ้าที่ขยายตัวแล้วจางหายไปเลยนะ

source: Another will take Longen's place. Be it in your lifetime, or beyond.
th_th: จะมีคนมาแทนที่ Longen ขึ้นอยู่กับว่าจะเป็นในช่วงชีวิตนี้ของเจ้า หรือนานกว่านั้นเท่านั้นเอง

source: WE will take his place! We'll take the land...
th_th: พวกเรา จะแทนที่เขา! พวกเราจะครองแผ่นดิน....

source: Will you keep the slave camps?
th_th: เจ้าจะยังเก็บค่ายของพวกทาสเอาไว้หรือเปล่า?

source: Only for the criminals, the bandits... and our enemies. We'll keep the economy moving. Everyone's happy.
th_th: เอาไว้ขังแต่พวกอาชญากร พวกโจร...แล้วก็พวกศัตรูของเรา เราจะทำให้เศรษฐกิจยังดำเนินต่อไป แล้วทุกคนก็จะมีความสุข.

source: You don't agree?
th_th: เจ้าไม่เห็นด้วยหรือ?

source: That's how the Traders Guild first started. Everyone thinks they have good intentions.
th_th: สมาคม Traders ก็เริ่มต้นแบบนั้น ทุกคนคิดว่าพวกเขามีความตั้งใจที่ดี

source: It is the human race's weakness. They refuse to learn from their mistakes, dismiss the past as someone else's.
th_th: มันคือความอ่อนแอของมนุษยชาติน่ะ พวกเขาปฏิเสธที่จะเรียนรู้จากข้อผิดพลาด ปัดให้อดีตเป็นเรื่องของคนอื่นไปซะงั้น

source: Well... that sure as hell put a downer on my buzz.
th_th: อืม...เจ้าพูดให้ข้าหมดอารมณ์เลยอ่ะ

source: I feel relieved, happy no one else will suffer under Longen... But...
th_th: ข้ารู้สึกโล่งใจและมีความสุขที่ไม่มีใครต้องทุกข์ทรมานเพราะ Longen แล้ว...แต่...

source: You feel unsatisfied. Still hungry for vengeance.
th_th: เจ้ายังไม่พึงพอใจ เจ้ายังกระหายที่จะได้แก้แค้น.

source: ... Yes.
th_th: ...ใช่

source: You can kill and avenge all you want, but it won't bring your wife back.
th_th: เจ้าสามารถสังหารและล้างแค้นได้ตามสะดวกเลย แต่ยังไงภรรยาเจ้าก็กลับมาไม่ได้หรอกนะ.

source: Until you face this, there will forever be this void you call justice.
th_th: จนกว่าเจ้าจะยอมรับมันได้ นี่จะเป็นรูโหว่ในสิ่งที่เจ้าเรียกว่าความยุติธรรมไปตลอดกาล.

source: You wife is still gone. Vengeance has not brought her back.
th_th: ภรรยาของเจ้าจากไปแล้ว การแก้แค้นไม่ทำให้นางกลับมา.

source: Loss... mourning. It is the hardest part of living.
th_th: ความสูญเสีย...ความอาลัย คือส่วนที่ยากที่สุดในการมีชีวิตนะ

source: Centuries gone by, and I have never learned a fix for loss' wounds.
th_th: หลายศตวรรษผ่านไป และข้ายังคงไม่เรียนรู้ที่จะจัดการกับบาดแผลของความสูญเสียได้เลย.

source: We move on. Find new loved ones. New family.
th_th: พวกเราต้องก้าวต่อไป หาคนใหม่ที่เจ้าจะรักได้ เริ่มครอบครัวใหม่.

source: Look around you. This is your life now, but keep looking behind and you'll miss it all...
th_th: มองไปรอบตัวเจ้าสิ นี่คือชีวิตของเจ้าในตอนนี้ ถ้าเอาแต่หันไปมองข้างหลัง เจ้าจะพลาดทุกสิ่งทุกอย่างไปนะ...

source: Forever trying to numb yourself with vengeance.
th_th: พยายามจะใช้การแก้แค้นทำให้ตัวเองด้านชาไปตลอดกาล.

source: From farm girl, to selling myself for fucking fish scraps...
th_th: จากเด็กสาวในฟาร์ม จนขายตัวเองให้ไอ้ปลาขยะนั่น...

source: To saviour of the oppressed.
th_th: แด่ผู้กอบกู้ของผู้ถูกกดขี่ข่มเหง

source: Yeah. I'd say it feels pretty damn good.
th_th: ใช่ ข้าพูดได้เลยว่าข้าโครตรู้สึกดี.

source: Well. You guys sure showed me. Choosing the winning side ain't always so smart after all.
th_th: อืม พวกเจ้าเพิ่งทำให้ข้าได้รู้ว่าการเลือกอยู่ฝั่งที่ชนะไม่ใช่ทางเลือกที่ฉลาดเสมอไป.

source: Agreed. I thought all the dreamers were just turret fodder for the slavers.
th_th: เห็นด้วย ข้าเคยคิดว่าพวกช่างฝันทั้งหลายก็เป็นได้แค่หญ้ารองปืนใหญ่สำหรับพวกพ่อค้าทาส.

source: Sometimes you speak sense, for a bone headed gunner.
th_th: บางครั้งเจ้าก็พูดดีมีเหตุผลนี่ สำหรับมือปืนกะโหลกหนาอ่ะนะ.

source: ... Ain't it past your nap time about now, kid?
th_th: ...นี่เลยเวลานอนกลางวันของเจ้าแล้วหรือเปล่านะ เจ้าหนู?

source: Perhaps this was Okran's true mission for me after all...
th_th: บางทีนี่อาจเป็นภารกิจที่แท้จริงของ Okran ที่มอบให้ข้าก็ได้นะ...

source: Perhaps this was the wreck bound for civilisation's second destruction.
th_th: บางทีนี่อาจเป็นหายนะที่จะนำพามาซึ่งการล่มสลายของอารยธรรมเป็นครั้งที่ 2 ก็ได้นะ.

source: I don't care either way, if I'm honest...
th_th: เอาจริง ๆ นะ ข้าไม่สนใจทั้งนั้นแหละ...

source: Can we rest now? My back is killing me.
th_th: พวกเราพักได้หรือยัง? หลังข้าจะแย่แล้ว.

source: There were times I thought I'd be stuck in the Vault 'til I died...
th_th: มีช่วงหนึ่งที่ข้าเชื่อว่าข้าจะติดอยู่ในคุกลงทัณฑ์จนตาย...

source: And now this! I was able to do my part in the fight for freedom after all.
th_th: แล้วดูตอนนี้สิ! ข้ามีส่วนร่วมในการปลดแอกเพื่ออิสรภาพจนได้.

source: It's been an honour to fight by your side.
th_th: เป็นเกียรติมากที่ได้ร่วมต่อสู้เคียงข้างเจ้า.

source: Right! I'd say this calls for a drink at the Dancing Skeleton...
th_th: ถูกเผง! ข้าคิดว่านี่เป็นเวลาที่ดีที่เราจะไปดื่มที่ Dancing Skeleton...

source: A toast to freedom! *glug glug*
th_th: อวยพรแด่อิสรภาพ! *อึก อึก*

source: Wher-... where'd you even get that drink from?
th_th: น่ะ...นั่นเจ้าไปเอาเครื่องดื่มนั่นมาจากไหนกัน?

source: Well, I guess we'll be crafting our own gear from now on then...
th_th: อืม ข้าเดาว่าตั้งแต่นี้ไปเราคงต้องสร้างเครื่องสวมใส่กันเองแล้วล่ะ...

source: Since it's gonna cost a POOBILLION Cats to buy a stinkin' loaf of bread now!
th_th: เพราะมันคงต้องใช้ Cats มหาศาลลลลลล ในการซื้อขนมปังสักแถวแล้วสินะ!

source: This. This is a life well lived.
th_th: นี่ คือชีวิตที่อยู่มาคุ้มค่า.

source: Are you laughing again?
th_th: เจ้าหัวเราะอีกแล้วรึ?

source: I thought we agreed not to do that. It's... creepy when you laugh.
th_th: ข้าคิดว่าเราตกลงกันว่าจะไม่ทำแบบนั้นแล้วซะอีก มัน...น่าขนลุกมากเวลาเจ้าหัวเราะน่ะ.

source: Glory to us all!
th_th: ความรุ่งโรจน์แด่พวกเราทุกคน!

source: We done good, guys. We done good. Longen's dead...
th_th: เราทำได้ดีแล้ว พรรคพวก ทำได้ดีแล้ว Longen ตายแล้ว...

source: And now the world is our playground, muhaha!
th_th: แล้วตอนนี้โลกก็เป็นสนามเด็กเล่นของพวกเรา วะฮะฮ่า!

source: Longen's dead, now it's time to sit back and watch the slavers burn.
th_th: Longen ตายแล้ว ได้เวลานั่งรอชมวันที่พ่อค้าทาสจะฉิบหายแล้ว

source: The desert's nicely riled up, I'd say. I'm proud of you guys.
th_th: ทะเลทรายวุ่นวายไม่ใช่น้อยเลย ข้าภูมิใจในตัวพวกเจ้ามาก พรรคพวก.

source: Pride, kin!
th_th: ภูมิใจเข้าไว้ พี่น้องเอ๋ย!

source: We've molded the world itself, with our own blades.
th_th: พวกเราทำให้โลกนี้เป็นรูปเป็นร่าง ด้วยดาบของพวกเรา.

source: Now is a glorious age.
th_th: ถึงยุคแห่งความเฟื่องฟูแล้ว.
