Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome Floodlands.po
Languages: th_th

source: An ancient place this, we should be careful
th_th: พวกเราควรระมัดระวังตัวในสถานที่โบราณแห่งนี้

source: It's probably crawling with spiders
th_th: มันคงมีแมงมุมวิ่งยั้วเยี้ยเลยล่ะ

source: But where there's spiders, there's technology and riches to be found!
th_th: แต่ในที่ที่มีแมงมุม ก็จะมีวิทยาการและความร่ำรวยรอเราไปค้นพบเช่นกัน!

source: But spiders mean treasure!
th_th: แต่มีแมงมุมก็คือมีสมบัติไง!

source: ...right?
th_th: ...ใช่มั้ยอ่ะ?

source: This place is a relic of the old world
th_th: ที่แห่งนี้คืออนุสรณ์สถานแห่งโลกเก่า

source: Wonders of technology were produced here, in staggering quantities
th_th: วิทยาการที่น่าทึ่งจำนวนมากมายมหาศาลถูกสร้างขึ้นที่นี่

source: The husks of machinery here were wonders of production
th_th: เปลือกนอกของเครื่องจักรในนี้เป็นผลิตภัณฑ์ที่น่าทึ่งมาก

source: Machines building more machines to build more machines with
th_th: เครื่องจักรที่ผลิตเครื่องจักรที่จะผลิตเครื่องจักรต่อไปอีก

source: In the end, they couldn't keep up with its hunger
th_th: สุดท้ายแล้ว พวกเขาก็ทนความหิวโหยไม่ไหว

source: This is where I was born....
th_th: ที่นี่คือที่ที่ข้าถือกำเนิดขึ้น...
