Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome entries Tengu world state.po
Languages: th_th

source: The Empire has been crippled yet... I feel no better.
th_th: จักรวรรดิถูกทำให้ง่อยเปลี้ยแล้ว แต่...ข้าไม่ได้รู้สึกดีขึ้นเลย

source: Victims still suffer... evils get replaced with new evils...
th_th: พวกเหยื่อยังทุกข์ทรมาน...ปีศาจแค่ถูกแทนที่ด้วยปีศาจอีกตัว...

source: Look a little more closely. You're looking at the whole world, and it's too big to take in.
th_th: มองให้ลึกลงหน่อยพวก เจ้าเอาตัวมองโลกทั้งใบ มันใหญ่เกินกว่าที่พวกเราจะรับมือไหวนะ

source: But one by one, we've saved people.
th_th: แต่อย่างน้อย พวกเราได้ช่วยเหลือผู้คน ทีละคน ทีละคน

source: So... Tengu's gone now...
th_th: ตอนนี้...Tengu หายไปแล้วสินะ...

source: Tengu was a useless coward. I feel no pride in defeating the bloated meatsack...
th_th: Tengu เป็นแค่ไอ้ขี้ขลาดไร้ประโยชน์ ข้าไม่รู้สึกภูมิใจที่ชนะถุงเนื้อพอง ๆ ใบหนึ่งหรอกนะ...

source: Agreed.
th_th: เห็นด้วยสุด ๆ

source: Disdain. The baby's blubbering has left a bad taste in my mouth.
th_th: น่าชังนัก เสียงสะอื้นของพวกเด็กน้อยทำให้ข้าขมปากเหลือเกิน.

source: I was expecting something a little more dramatic following the death of the Emperor...
th_th: ข้าหวังว่าจะมีเรื่องน้ำเน่ากว่านี้ให้เห็นหลังจากที่จักรพรรดิสิ้นพระชนม์ซะอีก...

source: Watching Tengu squeal was like music to my ears. Ha! Not laughing now, is he?
th_th: ตอนที่มอง Tengu กรีดร้องนี่เหมือนข้าได้ฟังดนตรีเลยนะ ฮ่า! เขาไม่ได้หัวเราะแล้วเหรอ?

source: ... Not a lot has changed since. I'm disappointed.
th_th: ...แทบไม่มีอะไรเปลี่ยนแปลงเลย ข้าผิดหวังนะนี่.

source: What did you expect? That idiot to be the mastermind behind the UC?
th_th: เจ้าคาดหวังอะไรล่ะ? ว่าเจ้าโง่นั่นจะเป็นผู้วางแผนอยู่เบื้องหลัง UC เหรอ?

source: He was a puppet. And puppets are easily replaced.
th_th: เขาเป็นแค่หุ่นเชิด หุ่นเชิดถูกเปลี่ยนได้อย่างง่ายดายเสมอ.

source: Well, I had my fun anyway.
th_th: อืม อย่างน้อยข้าก็ได้สนุกล่ะนะ.

source: We brought justice to Tengu, either way.
th_th: อย่างน้อยเราทำให้ Tengu ได้รู้จักความยุติธรรม.

source: Let his replacement quiver in his boots at the thought of Tengu's murderers on the loose!
th_th: ปล่อยให้คนที่จะมาแทน Tengu กลัวตัวสั่นงันงกเพราะว่าฆาตกรยังลอยนวลอยู่ข้างนอกนั่นอย่างไรล่ะ!

source: As long as we still breathe, we'll make the nobles suffer.
th_th: ตราบใดที่พวกเรายังหายใจ เราจะทำให้พวกขุนนางเจ็บปวดทรมาน.

source: Hmph, annoyance. So we find it's real root, and we destroy it.
th_th: ฮึ่ม น่ารำคาญนัก เราก็แค่ต้องหาต้นตอที่แท้จริง แล้วก็กำจัดมันซะ

source: Tengu was no challenge anyway.
th_th: Tengu ไม่ได้เป็นความท้าทายอะไรอยู่แล้วนี่.

source: Freedom is a never ending battle. The moment you pause, the moment the rot starts spreading back...
th_th: อิสรภาพคือสงครามที่ไม่มีวันจบสิ้น เมื่อใดที่เจ้าหยุด เมื่อนั้นความเน่าเฟะจะแพร่กระจายอีกครั้ง...

source: The land will always need freedom fighters. Better to fight than be a victim.
th_th: ดินแดนนี้ต้องการนักสู้เพื่ออิสรภาพเสมอ การลุกขึ้นสู้ดีกว่าการตกเป็นเหยื่อ.

source: The UC is as old as it is big. It will take more to dig up it's root.
th_th: UC เก่าแก่พอ ๆ กับที่ใหญ่โต มันต้องใช้เวลาเพื่อตามหาต้นตอ.

source: Didn't it used to be your home, the UC?
th_th: ไม่ใช่ว่า UC เคยเป็นบ้านของเจ้าหรอกหรือ?

source: It was my master's home. I follow a new master now, the life of a samurai goes on.
th_th: มันเคยเป็นบ้านของนายท่านของข้า ข้ามีนายท่านคนใหม่แล้ว วิถีชีวิตของซามูไรยังคงต้องก้าวเดินต่อไป

source: Sounds a little heartless...
th_th: ฟังดูไร้หัวใจไปหน่อยนะ...

source: Try working for a noble, then come back to me and we'll finish this conversation.
th_th: ลองทำงานให้พวกขุนนางสิ แล้วค่อยกลับมาถกเรื่องนี้กับข้า

source: It was nothing but stress. How else do you think I ended up with grey hair?
th_th: มันไม่มีอะไรเลยนอกจากความกดดัน ไม่งั้นเจ้าคิดว่าข้าผมหงอกเพราะอะไรล่ะ?

source: Bad sun protection?
th_th: เจ้าใช้อุปกรณ์กันแดดที่ห่วยแตกมั้ง?

source: Well... that too.
th_th: เอ่อ...นั่นก็ด้วย

source: You know, I can't help but feel that the lands got even MORE fucked up with him gone...
th_th: รู้มั้ย ข้าอดคิดไม่ได้ว่ามันยิ่งดูเละเทะไปกันใหญ่หลังจากเขาตายน่ะ...
