Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome entries Esata world state.po
Languages: th_th

source: Why do I feel like we've just kicked a nest of blood spiders...?
th_th: ทำไมข้ารู้สึกเหมือนพวกเราเพิ่งเตะรังแมงมุมโลหิตกันนะ...?

source: Because the Shek idolize the strong...
th_th: เพราะว่าพวก Shek เคารพผู้แข็งแกร่งนะสิ...

source: And in defeating their strongest, we've made ourselves their next challenge.
th_th: และการที่พวกเราเอาชนะผู้ที่แข็งแกร่งที่สุดของพวกเขาได้ พวกเรากลายเป็นเป้าหมายการท้าสู้คนต่อไปของเขาแล้วล่ะ.

source: ... Beep...
th_th: ...บี๊บ...

source: Until they find a better challenge, they'll be coming for us. Don't underestimate the determination of a Shek.
th_th: จนกว่าพวกเขาจะหาคู่ต่อสู้คนใหม่ได้ พวกเขาจะมุ่งเป้ามาที่เรา อย่าดูแคลนความมุ่งมั่นของพวก Shek เชียว

source: ... Stubbornness more like...
th_th: ...น่าจะเรียกว่าหัวดื้อมากกว่านะ...

source: Because the Shek love an excuse to fight.
th_th: เพราะว่าพวก Shek ชอบหาข้ออ้างที่จะต่อสู้นะ

source: And we've just given them one hell of an excuse.
th_th: และพวกเราเพิ่งเปิดช่องให้พวกเขาหาข้ออ้างได้ด้วย.

source: Disappointing. I'd hoped the mighty Stone Golem would be stronger.
th_th: น่าผิดหวังจริง ข้าคาดหวังว่า Stone Golem จะแกร่งกว่านี้ซะอีก.

source: You surprise me, Shek. You betrayed your own queen...
th_th: เจ้าทำให้ข้าประหลาดใจนะ ชาว Shek เจ้าทรยศราชินีของพวกเจ้า...

source: And that's all you have to say?
th_th: นั่นคือทั้งหมดที่เจ้าอยากจะพูดรึ?

source: Because they Shek are arrogant boneheads, I tell you. Ain't no sword that can kill their egos...
th_th: เพราะว่าพวก Shek เป็นพวกกะโหลกหนาจอมหยิ่ง ไม่มีดาบเล่มใดสามารถตัดความเชื่อมั่นในตนเองของพวกเขาได้ ข้าขอบอก.

source: And they won't forgive us for what we've done. We're their new Bugmaster now.
th_th: และพวกเขาไม่มีวันให้อภัยในสิ่งที่พวกเราทำ สำหรับพวกเขา เรากลายเป็น Bugmaster คนใหม่ไปแล้ว

source: But call me flatskin one more time, I dare 'em...
th_th: แต่ข้าขอท้าให้มันเรียกข้าว่า flatskin อีกครั้งดู...

source: Well, someone needed to put them in their place...
th_th: อืม ต้องมีคนทำให้พวกเขาเจียมตัวอยู่ในที่ของตัวเองบ้างนะ...

source: Honour? Bullshit to their honour. They're nothing but barbarians.
th_th: เกียรติศักดิ์? ช่างหัวเกียรติศักดิ์มันเถอะ พวกมันเป็นแค่คนถ่อยเถื่อนไร้อารยธรรม

source: Mmh!?
th_th: หืมม?!

source: Hm! I betrayed my queen the moment I left with you.
th_th: ฮึ่ม! ข้าทรยศต่อราชินีตั้งแต่ที่วินาทีที่ข้าเลือกจะมากับเจ้าแล้ว

source: But the Shek Kingdom will live on...
th_th: แต่อาณาจักรของ Shek จะคงอยู่ต่อไป...

source: ... And I'm honoured to be their new enemy.
th_th: ...และข้ารู้สึกเป็นเกียรติมากที่ได้เป็นศัตรูคนใหม่ของพวกเขา

source: Because the Shek never forgive...
th_th: เพราะว่าพวก Shek ไม่เคยให้อภัย...

source: Only death will end their thirst for blood.
th_th: มีแต่มรณาเท่านั้นที่จะหยุดยั้งความกระหายเลือดของพวกเขาได้

source: ... Because we just riled the most battle hungry nation in all the land.
th_th: ...เพราะว่าพวกเราเพิ่งจะไปแหย่รังแตนอาณาจักรที่กระหายการต่อสู้ที่สุดบนแผ่นดินน่ะสิ
