Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome journey to ashlands pt4.po
Languages: th_th

source: Ever hear of that famous adventurer group, the Ashland Drifters?
th_th: เคยได้ยินกลุ่มนักผจญภัยชื่อดังอย่าง Ashland Drifters หรือไม่?

source: Apparently the only people to come back out of the Ashlands alive...
th_th: อย่างที่ได้ยิน มีเพียงคนเดียวที่กลับมาจาก Ashlands แล้วยังมีชีวิตอยู่...

source: Seriously... Not the time for this conversation. We're JUST getting to the Ashlands...
th_th: เอาจริงดิ... นี่ไม่ใช่เวลาที่จะมาพูดนะ. พวกเราพึ่งจะมาถึง Ashlands กันเอง...

source: Well, we can't ignore the leviathyn in the room now, can we?
th_th: พวกเราไม่สามารถไม่สนใจ Leviathyn ในห้องนี้ได้นี่ ใช่ไหม?

source: If the acid rain don't melt our skin off it'll be the dragons that finish us off.
th_th: หากฝนกรดไม่ละลายผิวของเรา เราก็อาจจะถูกฆ่าโดยมังกรก็ได้.

source: I don't even know who's idea it was to come here. I guess I'm the idiot for coming along...
th_th: ข้าไม่รู้ด้วยซ้ำว่าการมาที่นี่เป็นความคิดของใคร ข้าคิดว่าข้าโง่มากเลยที่ตามมาด้วย...

source: ... What's a dragon?
th_th: ...อะไรนะ มังกรหรอ?

source: Oh they're basically like leviathyns with wings...
th_th: อ้อ โดยพื้นฐานแล้วเนี่ย พวกมันก็เหมือนพวก leviathyns ที่มีปีกอะน่ะ...

source: But they shoot flames out of their eyes and have giant fangs for crushing the bones of adventurers...
th_th: แต่ว่าพวกมันสามารถพ่นไฟออกมาจากดวงตาได้ด้วย แล้วก็มีเขี้ยวที่ใหญ่ยักษ์เพื่อเอาไว้เคี้ยวพวกนักผจญภัยทั้งหลาย...

source: Nah, you're thinking of winged beak ogres.
th_th: ไม่อะ, เจ้ากำลังคิดถึงอสูรปากกว้างมากกว่า.

source: Or dray guns? Yeah they're the turret beams that the headless ancients boil adventurers with.
th_th: ปืน dray รึ? อืม มันยิงลำแสงที่พวกคนโบราณไร้หัวใช้เผาพวกนักผจญภัยน่ะ.

source: They're made of drays.
th_th: พวกมันทำมาจาก dray

source: What the fuck is a dray?
th_th: dray เชี่ยอะไรของมึงว่ะ?

source: CAN WE STOP TALKING ABOUT DYING IN THE ASHLANDS PLEASE?
th_th: พอเถอะน่า..เมื่อไหร่เราจะหยุดพูดถึงความตายใน ASHLANDS กันสักที?

source: ... Drays?
th_th: ...Drays อะไรของแม่งวะ?

source: You're thinking of winged beak ogres. What foreign name is this 'daragorn'?
th_th: เจ้ากำลังพูดถึงอสูรปากกว้าง. ว่าแต่มันชื่ออะไรนะ มังการอน หรอ?
