Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome arrival bugmaster.po
Languages: th_th

source: This is where the Bugmaster has lived for hundreds of years...
th_th: นี่คือที่ที่ Bugmaster อาศัยอยู่มาหลายร้อยปี ...

source: Nobody knows what he is or where he came from...
th_th: ไม่มีใครรู้ว่าเขาเป็นใครหรือมาจากไหน ...

source: But what we do know is.. those that do find him never come back.
th_th: แต่สิ่งที่เรารู้คือ .. คนที่พบเขาไม่เคยกลับมา.

source: ... Yep. This place definitely LOOKS as ominous as all the stories about it.
th_th: ... อ๋อ สถานที่นี้ดูเป็นลางไม่ดี พอๆกับเรื่องราวทั้งหมดเกี่ยวกับมัน.

source: Even the rocks look evil... How about we heed the evil rocks and leave while we still can?
th_th: แม้แต่ก้อนหินก็ดูชั่วร้าย ... แล้วเราจะระวังก้อนหินที่ชั่วร้ายและออกไปในขณะที่เรายังทำได้อยู่ไหม?

source: Hmph. Run all you want, coward. I look forward to fighting the legend with my own sword...
th_th: ฮึ่มม หนีไปเลยถ้าแกขี้ขลาด ข้าหวังว่าจะได้ต่อสู้อย่างตำนานด้วยดาบของข้าเอง ...

source: Yadda yadda. All I care about is the Bugmaster's loot. I've got dibs if it's a shiny new sword.
th_th: แหมๆ ทั้งหมดที่ข้าสนก็สมบัติของ Bugmaster นี่แหละ ถ้าเป็นดาบส่องประกายเล่มใหม่ข้าจองนะเว้ย.

source: Hmph. Typical outsider. Take your sorry prize. I just want to see the legend himself with my own two eyes...
th_th: ฮึ่ม เจ้าคนนอกธรรมดา รับรางวัลขอโทษของเจ้าไป ข้าแค่อยากเห็นตำนานตัวเป็นๆ ด้วยตาสองข้างของข้าเอง ...

source: And then slit him open with my sword.
th_th: จากนั้นก็ผ่าเขาออกด้วยดาบของข้า

source: Yeesh. You Shek just don't ease up do you? How about a new non-slitty hobby, eh? Cooking maybe?
th_th: เฮ้อ shek อย่างเจ้านี้ผ่อนคลายไม่เป็นรึไงนะ? ลองหางานอดิเรกเบาๆ ใหม่ๆ ทำดูเป็นไง ฮืม? อย่างทำอาหารไรงี้

source: ... Not much of a cook, eh...
th_th: ...ทำอาหารไม่บ่อยสินะ ฮืม...

source: Bet the Bugmaster just needs some tail, that's all. Release some tension, heh...
th_th: พนันได้เลยว่า Bugmaster แค่ต้องการร่วมสังวาสสักหน่อย ก็นั่นไง ปลดปล่อยความเครียดน่ะ ฮืม...

source: Stuck travelling with the company of a degenerate. Mercy, Okran...
th_th: ต้องมาติดอยู่กับเดินทางกับบริษัทแห่งความเสื่อมทราม ขององค์Okran ทรงอภัย...

source: Oop, better not upset the unsullied Okranite, eh? Heheh...
th_th: อุ๊ป อย่าโกรธไปดีกว่า Okranite ผู้บริสุทธิ์ ฮืม? เหะเหะ...

source: Of course. All of life's problems boil down to 'getting tail'. So deep and eloquent, this one...
th_th: แน่นอน ปัญหาชีวิตทุกอย่างก็คือการ 'ร่วมสังวาส' ช่างลึกล้ำและมีคารมคมคายนัก เจ้านี่น่ะ....

source: About that... Have I mentioned that I don't like bugs? Or mass murdering bug gods either funnily enough.....
th_th: เกี่ยวกับที่ ... ข้าเคยพูดว่าข้าไม่ชอบแมลง หรือไม่? หรือการฆ่าเทพแมลง ก็สนุกพอสมควร .....

source: So... why are we here? I mean, those pointy rocks have death written all over them as it is...
th_th: แล้ว... ทำไมเรายังอยู่ที่นี่? ฉันหมายถึงก้อนหินที่แหลมเหล่านั้นมีความตายเขียนอยู่เหนือมันตามที่ ...

source: Some say he's immortal, some say he's a monster. The stories are endless...
th_th: บางคนบอกว่าเขาเป็นอมตะบางคนบอกว่าเขาเป็นสัตว์ประหลาด เรื่องราวไม่มีที่สิ้นสุด ...

source: And they all end with death.
th_th: และพวกเขาทั้งหมดจบลงด้วยความตาย

source: But they don't matter. Because nobody ever lives to tell the reality.
th_th: แต่พวกเขาไม่สำคัญ เพราะไม่มีใครมีชีวิตอยู่เพื่อบอกความจริง

source: The Crater... every treasure hunter's dream and every treasure hunter's doom.
th_th: ปล่องภูเขาไฟ ... ทุกความฝันของนักล่าสมบัติและการลงโทษต่อนักล่าสมบัติทุกคน

source: Rumour has it the Bugmaster keeps endless riches holed up in his tower here, enough to buy every city in the outlands...
th_th: มีข่าวลือว่า Bugmaster เก็บความมั่งคั่งอันไม่รู้จบไว้ในหอคอยของเขา พอที่จะซื้อทุกเมืองในพื้นที่ห่างไกล ...

source: Can't say I'd mind risking my own doom for a piece of that.
th_th: พูดไม่ได้ว่าข้ารังเกียจที่จะต้องมาเสี่ยงโชคของตัวเอง.

source: This is where the Shek elders seek their final passage to the afterlife, Gateway. Through the undefeated Bugmaster...
th_th: นี่คือจุดที่ Shek อาวุโส แสวงหาเส้นทางสุดท้ายของพวกเขาสู่ชีวิตหลังความตาย สรวงสวรรค์ ผ่าน Bugmaster ผู้ไร้พ่าย...

source: If it's an early death sentence /IMWERE/ after, we've found it right here.
th_th: หากนี่เป็นการลงโทษประหารชีวิต/IMWERE/ล่ะก็ เราได้เจอมันแล้วล่ะ

source: This... This is the Crater... There are more rumours of this place than there are visitors to have survived it...
th_th: มีข่าวลือของที่นี่มากกว่าคนที่เข้ามาแล้วรอดกลับไปได้เสียอีก...

source: It's where the notorious Bugmaster dwells... Some say he's an insect god, other's say he's the sole living survivor from the ancient race...
th_th: มันเป็นที่ที่ Bugmaster ผู้มีชื่อเสียงอาศัยอยู่ ... บางคนบอกว่าเขาเป็นเทพแมลง ส่วนอีกคนบอกว่าเขาเป็นผู้รอดชีวิตเพียงคนเดียวจากเผ่าพันธุ์โบราณ ...

source: Some say he holds the most prized treasure in all the lands, protected by his personal insect horde...
th_th: บางคนบอกว่าเขาเก็บสมบัติล้ำค่าที่สุดในดินแดนไว้ทั้งหมด, ได้รับการคุ้มครองโดยฝูงแมลงส่วนตัวของเขา ...

source: Only one thing's for certain though... He ain't welcoming to guests.
th_th: มีเรื่องเดียวที่มั่นใจได้แน่ๆ ...เขาไม่ต้อนรับแขก.

source: I'm just curious as to what the hell happened to the Bugmaster to get his loin cloth so bunched in a knot...
th_th: ข้าแค่ใคร่สงสัยว่าเกิดห่าอะไรขึ้นกับเจ้า Bugmaster ทำไมมันต้องเอาผ้าผืนเดียวมามัดเป็นปมด้วย...

source: You could try askin' him yourself. I'll be stood a nice safe distance away while you do it *snort*
th_th: แกก็ลองถามเขาด้วยตัวเองสิ ข้าจะดูอยู่ห่างๆ จากที่ปลอดภัยในขณะที่แกทำนะ *พ่นลมหายใจ*

source: ... Just forget I ever asked.
th_th: ...ลืมเรื่องที่ข้าถามไปเถอะ.

source: Well, now's your chance to ask him yourself...
th_th: แหม นี่เป็นโอกาสที่จะได้ถามหมอนั่นกับตัวเลยนะ...

source: Ah! The Bugmaster's lair is this way!
th_th: อา! ที่ซ่อนของ Bugmaster อยู่ทางนี้!

source: Bugman, bugman, he took a sword to the noggin'...
th_th: มนุษย์แมลง มนุษย์แมลง หยิบดาบวิ่งเข้าแทง...

source: But the bugs... saved him uh... *mumble mumble*... floggin'!...
th_th: แต่เหล่าแมลง... ช่วยเขา เอ่อ... *งึมงัมๆ* ...ฟาดเต็มแรง!...

source: And a bug king was born, against mankind forsworn...
th_th: แล้วราชาแมลงก็อุบัติ สาบานว่าจะให้มนุษยชาติวิบัติ...

source: And... uh... something about the human race being exterminated as festering vermin...
th_th: และ ... เอ่อ ... บางสิ่งบางอย่างเกี่ยวกับเผ่าพันธุ์มนุษย์กำลังถูกกำจัดเหมือนสัตว์ที่น่ารังเกียจ ...

source: Yadda, yadda, you get the idea.
th_th: ช่าย ช่าย มีหัวคิดดีนี่.

source: ... You're the worst bard ever.
th_th: ...แกนี้มันเป็นนักกวีที่ห่วยแตตลอดกาลเลยว่ะ.

source: So...
th_th: แล้ว...

source: How about we agree never to speak of the bugmaster's treasure again?
th_th: เอาเป็นว่าเราตกลงกันแล้วนะว่าจะไม่พูดเรื่องสมบัติของ Bugmaster อีกน่ะ?

source: Dogshit! THAT was the Bugmaster's so-called treasure?!
th_th: ระยำหมาเอ้ย! ไอ้นั่นคือสิ่งที่เคยเรียกว่าสมบัติของ Bugmaster เหรอวะ?!

source: It's all lies, EVERYTHING'S a /GODDAMN/ lie!... Believe nothing.
th_th: ทั้งหมดแม่งคือเรื่องโกหก ทุกอย่ามันเป็นเรื่องโกหก/GODDAMN/!...เชื่อไม่ได้สักอย่าง

source: You only just learned this?...
th_th: พึ่งจะรู้รึไงกัน?...

source: Welcome to the outlands.
th_th: ยินดีต้อนรับสู่ Outlands.
