Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome entries tinfist world state.po
Languages: th_th

source: Say goodbye to the days of pantless dreg, say hello to noble status!
th_th: บอกลาช่วงเวลาที่เป็นเพียงคนธรรมด๊าธรรมดาแล้ว ทักทายบรรดาศักดิ์ขุนนางใหม่หน่อยซิ!

source: We'll go down as heroes for taking down the Iron Brute.
th_th: พวกเราจะถูกจารึกว่าเป็นวีรชนที่ปราบ Iron Brute ลงได้

source: Don't be so naive... The nobles are as fickle as fish.
th_th: อย่าซื่อบื้อไปหน่อยเลย...พวกขุนนางก็เน่าพอ ๆ กับปลานั่นแหละ.

source: You'll be forgotten in a month, on with the next new fad...
th_th: ในเวลาไม่ถึงเดือน เจ้าจะถูกลืมเลือน แล้วพวกเขาก็สนใจในเรื่องใหม่ ๆ ต่อไป...

source: Haha... did you just get called naive by a child?
th_th: ฮ่าฮ่า...นี่เจ้าถูกเด็กคนหนึ่งเรียกว่าซื่อบื้องั้นเหรอ?

source: Tinfist was the last of us to try and change the world...
th_th: Tinfist คือพวกเราคนสุดท้ายที่ลุกขึ้นสู้เพื่อเปลี่ยนแปลงโลกนี้...

source: Perhaps he should have known better than to fight human battles...
th_th: บางทีเขาน่าจะรู้ดีว่าไม่ควรเข้าไปเกี่ยวข้องกับการต่อสู้ของพวกมนุษย์...

source: Or perhaps he'd lived long enough to risk it all for what he believed.
th_th: หรืออาจเป็นเพราะเขามีชีวิตอยู่มานานพอ จนกล้าเอาชีวิตไปเสี่ยงแลกกับสิ่งที่เขาเชื่อ

source: Mm. Pride, kin.
th_th: อืม จงภูมิใจเถิด พี่น้องเอ๋ย

source: A legend is replaced by the new...
th_th: ตำนานถูกแทนที่ด้วยตำนานบทใหม่...

source: I guess we put an end to his terrorism...
th_th: ข้าคิดว่าเราหยุดยั้งการก่อการร้ายของเขาสำเร็จนะ...

source: You're proud of what we did? Tinfist was the people's only hope...
th_th: เจ้าภูมิใจกับสิ่งที่พวกเราทำไปเหรอ? Tinfist เป็นความหวังเดียวของพวกประชาชนนะ...

source: I don't even know what I'm fighting for anymore.
th_th: ข้าไม่รู้แล้วว่าข้ากำลังต่อสู้เพื่ออะไร.

source: He was a terrorist.
th_th: เขาเป็นผู้ก่อการร้าย.

source: We do what we've gotta do to survive.
th_th: เราทำในสิ่งที่ต้องทำเพื่อมีชีวิตรอด.

source: If it keeps us alive, who cares if it's pretty.
th_th: ใครจะสนว่ามันสวยงามหรือเปล่ากันล่ะ ถ้ามันทำให้พวกเรารอดได้

source: We picked the winning side, and we joined it.
th_th: เราแค่เลือกฝ่ายที่ชนะ แล้วก็เข้าร่วม ก็แค่นั้น

source: Nothing wrong with surviving.
th_th: ไม่มีอะไรผิดที่จะเอาชีวิตรอดหรอกนะ.

source: He fought for people like me. Label him a brute but...
th_th: เขาต่อสู้เพื่อคนแบบข้า แล้วไปเรียกเขาว่าสัตว์ป่านี่มัน...

source: He was on my side and I helped destroy him.
th_th: เขาอยู่ฝั่งเดียวกับข้า และข้าช่วยทำลายเขากับมือ.
