Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome vain.po
Languages: th_th

source: Vain. The hivers may seem harmless enough but don't let that fool you...
th_th: เมือง Vain พวก Hive ดูเหมือนไม่มีอันตรายใด ๆ แต่อย่าโดนมันหลอกล่ะ...

source: Those guys are plain sneaky.
th_th: พวกนั้นขี้โกงเป็นสันดานเลย

source: Hey, what about me?
th_th: เฮ้ แล้วข้าละ?

source: Ouch, that hurts, you know...
th_th: โอ๊ย นั่นโหดร้ายมาก เจ้าก็รู้นี่...

source: Oh, don't overreact. You know I don't mean you, no-hive. Heh.
th_th: โอ้ อย่ามีปฏิกิริยาเกินจริงไปหน่อยเลย เจ้าก็รู้ว่าข้าไม่ได้หมายถึงเจ้า เจ้าตัวไร้รังเอ๋ย

source: Oh don't get soft on me. You're not one of them anymore, eh no-hive?
th_th: โอ้ อย่าตัดพ้อข้าหน่อยเลย เจ้าไม่ใช่พวกมันแล้วนะ ไม่ใช่รึ เจ้าตัวไร้รัง?

source: We're close to a hive here... I hate nothing more than visiting the hives...
th_th: เราเกือบถึงรังแล้ว...ข้าไม่เคยเกลียดอะไรเท่ากับการมาเยือนรังเลย...

source: But it's home, isn't it? You don't miss it?
th_th: แต่มันก็เป็นบ้านไม่ใช่รึ? เจ้าไม่คิดถึงบ้านเหรอ?

source: ... Seeing the mindless drones at work brings back bad memories.
th_th: ...พอเห็นพวกผึ้งงานที่ไร้จิตใจก้มหน้าก้มตาทำงานแล้วทำให้ข้านึกถึงความทรงจำแย่ๆ น่ะ

source: ... It's a reminder of the braindead hell before my awakening... Nothing more.
th_th: ...มันทำให้ข้านึกถึงนรก ไร้ซึ่งสมอง ก่อนที่ข้าจะลืมตาตื่น... ไม่มีอะไรมากกว่านั้น

source: Hive territory. It's been a while since I left...
th_th: ดินแดนในเขต Hive ข้าไม่ได้กลับมาที่นี่ซักพักใหญ่แล้วนะนี่...

source: In the Hive, nothing matters, nothing exists, nothing is desired...
th_th: ในรัง ไม่มีอะไรทั้งนั้น ไม่มีอะไรมีตัวตน ไม่มีความปรารถนาใด ๆ ...

source: Nothing but loyalty for the Queen...
th_th: ไม่มีอะไรเลยนอกจากความภักดีต่อราชินี...

source: ... I don't look forward to my welcome home.
th_th: ...ข้าไม่คิดว่าจะได้รับการต้อนรับกลับบ้านหรอกนะ

source: So, uh, you know we gotta get one of them lanterns while we're in Vain...
th_th: อ้อ เจ้ารู้นี่ว่าพวกเราต้องหาตะเกียงตอนที่เราอยู่ในเมือง Vain นี่...

source: Lanterns? What lanterns?
th_th: ตะเกียง? ตะเกียงอะไร?

source: You know, them Lanterns of Raidians. It would be like going to the swamps and not buying drugs or fish...
th_th: แบบว่า ตะเกียงแห่ง Raidians อ่ะ ไม่งั้นก็เหมือนที่เจ้าไป swamps แล้วไม่ได้ซื้อยาหรือซื้อปลาอ่ะ...

source: You gotta buy a lantern.
th_th: เจ้าต้องซื้อตะเกียง

source: *slap*
th_th: *เผียะ*

source: Why are you slapping your head? Are there flies? I hate flies!
th_th: เจ้าตบหัวตัวเองทำไม? มีแมลงวันเหรอ? ข้าเกลียดแมลงวัน!

source: Just don't. Don't even go there...
th_th: พอที พอได้แล้ว...

source: Don't even get me started on those fucking Lanterns of Radiance.
th_th: อย่าให้ข้าเริ่มพูดเกี่ยวกับตะเกียงแห่งความสว่างไสวบ้าบอนี่นะ

source: More like the buzzing of memories from an old life, am I right?
th_th: เหมือนเป็นเสียงกระซิบแห่งความทรงจำจากชีวิตสมัยก่อนสินะ ใช่มั้้ย?

source: I... may have sold a few lanterns. Don't judge me.
th_th: ข้า...อาจจะเคยขายตะเกียงมาหลายอัน อย่ามาตัดสินข้านะ

source: ... You mean Lantern of Radiance.
th_th: ...เจ้าหมายถึงตะเกียงแห่งความสว่างไสว

source: Yeah yeah yeah, Lantern Of Rodents.
th_th: ช่าย ช่ายแล้ว ตะเกียงของพวกสัตว์กัดแทะ

source: ... Great. Vain.
th_th: ...ยอดเยี่ยมไปเลย เมือง Vain

source: I wouldn't buy a loaf of bread from a bug merchant if I was starving to death.
th_th: ต่อให้ข้ากำลังอดตายข้าก็จะไม่มีวันซื้อขนมปังแม้แต่แถวเดียวจากพ่อค้าที่เป็นแมลงหรอก

source: Scamming bastards.
th_th: พวกโสโครกจอมต้มตุ๋น

source: ... Scamming adorable bastards.
th_th: ...พวกโสโครกจอมต้มตุ๋นที่น่าเอ็นดู

source: Yeah but we gotta buy one of those lanterns while we're here though. It goes without saying.
th_th: ใช่ แต่ยังไงเราก็ต้องซื้อตะเกียงซักอันตอนที่เราอยู่ที่นี่นะ ไม่ต้องเถียงกันแล้ว

source: I'm right here, you know.
th_th: ข้าก็อยู่ที่นี่นะเฮ้ย

source: Don't act so innocent. You got a lot of repenting to do, I bet.
th_th: อย่ามาทำใสซื่อ เจ้ามีเรื่องให้ต้องไถ่โทษหลายเรื่องเลยสิท่า ข้าพนันได้เลย

source: Well your kind aren't so perfect either!
th_th: แหม พวกเจ้าก็ไม่ได้สมบูรณ์แบบเหมือนกันละว้า!

source: Knock it off. You both breath, you both eat. To me, you're one and the same.
th_th: พอที พวกเจ้าทั้งคู่หายใจและกินได้เหมือนกัน สำหรับข้า พวกเจ้าก็เหมือนกันนั่นแหละ

source: The same imperfect, defective clones.
th_th: พวกไม่สมบูรณ์แบบเหมือนกัน ร่างโคลนที่บกพร่อง

source: Ouch.
th_th: โอ๊ยย
