Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome Bast arrival.po
Languages: th_th

source: Can this truly be no man's land of the north?
th_th: นี่สามารถเป็นดินแดนไร้ผู้คนของทางเหนือได้จริงไหมเนี่ย?

source: Hm hm hm. Perhaps we will find good battle here.
th_th: ฮืม ฮืม ฮืม บางทีเราอาจเจอการต่อสู้เจ๋งๆ ได้ที่นี่นะ.

source: Exciting.
th_th: น่าตื่นเต้นจัง.

source: ... Sure... Getting caught between the sword of a samurai and the preaching of a paladin sounds like a real blast...
th_th: ...แหงสิ... ระหว่างโดนพวกซามูไรจับกับโดนพวกพาลาดินแสดงพระธรรม ฟังดูแล้วโคตรปังอ่ะ...

source: Mmh, agreed, comrade! Ready your blade, today will be a day of doom!
th_th: ฮึ่ม ย่อมได้ สหาย! จับดาบให้มั่น วันนี้จักเป็นวันแห่งวิบัติ!

source: ... They don't have sarcasm in the Shek Kingdom, huh...
th_th: ...ในอาณาจักร Shek นี้ไม่มีคำพูดเสียดสีงั้นสินะ หือ...

source: Still being pummeled by the Holy Nation up here...
th_th: ก็ยังมีการซ้อมจากพวก Holy Nation อยู่นี่...

source: I guess the years haven't been any kinder to Bast...
th_th: ข้าเดาว่าปีที่ผ่านมาไม่ได้มีเมตตาต่อ Bast แหง...

source: Idea: Once we slit Tengu like a gutter, we take down the Phoenix.
th_th: ขอออกความเห็น : พอเราสับ Tengu เป็นท่อนๆ แล้วเราจะไปโค่นล้ม Phoenix ต่อ.

source: The Okranite dog? Challenge accepted.
th_th: สุนัขรับใช้ Okranite รึ? น้อมรับคำท้า.

source: Sounds like a plan, Uncle Lu... I'll cheer you on from a safe distance.
th_th: ฟังดูเป็นแผนดีนะ ลุงLu... ข้าจะเชียร์ท่านจากที่ปลอดภัยห่างๆ แล้วกัน.

source: I've heard of this place, a whole city wiped out in a single day by the Holy Nation.
th_th: ข้าเคยได้ยินเรื่องเมืองนี้มา ว่าเมืองนี้โดน Holy Nation ถล่มยับในวันเดียว.

source: They roasted the head noble alive in the name of Okran and carted the youngsters off to Rebirth...
th_th: พวกมันย่างผู้นำขุนนางทั้งเป็นภายในนามของ Okran แล้วขนพวกคนหนุ่มสาวไปยัง Rebirth...

source: Yeesh. I mean, I hate nobles as much as the next guy but...
th_th: ช่ายย ข้าหมายถึง ข้าเกลียดพวกขุนนางพอๆ กับเจ้าคนต่อไปแต่ว่า...

source: But...
th_th: แต่...

source: Actually, he probably deserved it.
th_th: ที่จริง มันก็อาจสมควรโดนแล้วล่ะ.

source: Ruins... ruins... ruins...
th_th: มีแต่ซาก...ซาก...ซาก...

source: Every age, every where: ruins.
th_th: ทุกยุค ทุกที่ : เป็นซาก

source: Puh-lease! Change the page already...
th_th: ขอล่ะ! เปลี่ยนหน้าทีเถอะ...

source: If you don't like the ruins then turn around. Look somewhere else...
th_th: ถ้าเจ้าไม่ชอบซากปรักหักพังก็หันไปสิ ไปดูอย่างอื่นไป...

source: Okay, I will... *Sigh*
th_th: โอเค ได้...*ถอนหายใจ*

source: Great... Dead trees. Rocks... More rocks.
th_th: งั้นก็มองขึ้นไปสิ! มองขึ้นไปถ้าเกลียดชีวิตบนดินนักน่ะ!

source: Sky. Moons. This is better...
th_th: ท้องฟ้า พวกดวงจันทร์ ดีขึ้นเยอะ...

source: I shall keep looking at the skies, rock tripping hazards be damned.
th_th: ข้าจะคอยมองท้องฟ้า ช่างหัวอันตรายจากการสะดุดหิน

source: Poor poor Bast... A land where life is wiped clean as soon as it starts to grow...
th_th: Bast ที่น่าสงสาร... ดินแดนที่ชีวิตถูกทำลายตั้งแต่พึ่งได้เริ่มเติบโต...

source: Oh, like a trampled seedling, so tragic...
th_th: โอ้ เหมือนต้นอ่อนที่โดนเหยียบย่ำ น่าอนาถ...

source: Neither the Holy Nation nor the Empire can get a foothold here...
th_th: ไม่ว่า Holy Nation หรือจักวรรดิก็สามารถตั้งถิ่นฐานที่นี่ได้...

source: But perhaps one day they'll wipe eachother out and we can all marry ourselves slave wenches.
th_th: แต่บางทีซักวันหนึ่งพวกมันทำลายกันและกันเอง แล้วทีนี้เราก็จะสามารถแต่งงานกับสาวใช้ทาสของเราได้ทุกคน.

source: Bullshit! Not before WE take 'em down first...
th_th: ไร้สาระ! ไม่จนกว่าเราก็โค่นพวกมันได้ก่อน...

source: Right? Eh?
th_th: ใช่ไหมล่ะ? ฮืม?

source: So excited you can't even talk. I'm proud of you guys.
th_th: เป็นเรื่องน่าตื่นเต้นมากที่เจ้าไม่เคยพูดด้วยซ้ำ ข้าภูมิใจในตัวพวกเจ้าจริงเชียว.

source: Damn right!
th_th: ใช่ที่สุด!

source: ... We're all gonna die...
th_th: ...ตายห่ากันหมดแหง...
