Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome- bonefields.po
Languages: th_th

source: The Bonefields are not meant for humanoid life
th_th: Bonefields ไม่ได้มีไว้สำหรับชีวิตมนุษย์

source: This is animal territory, a different world. Even the empire is starting to fade away from here
th_th: นี่คืออาณาเขตสัตว์ โลกที่แตกออกไป แม้แต่จักรวรรดิก็เริ่มที่จะไม่ยุ่งกับที่นี่

source: Not surprised with all the beak things around. And that immortal fish guy.
th_th: ไม่แปลกใจเลยว่าทำไมมีพวก beak things อยู่แถวนี้ แล้วก็มนุษย์ปลาอมตะนั่นด้วย.

source: "Immortal fish guy"? What?
th_th: "มนุษย์ปลาอมตะ"? อะไรล่ะนั่น?

source: Don't go there. There's nothing worthwhile in it.
th_th: อย่าไปที่นั่น ไม่มีอะไรคุ้มค่าหรอก

source: Go where?
th_th: ไปไหน?

source: Don't go to the south
th_th: อย่าไปทางใต้

source: Now I want to go to the south
th_th: ตอนนี้ชักอยากลงใต้แล้วสิ

source: DON'T GO TO THE SOUTH
th_th: อย่า, ไป, ทาง, ใต้

source: Yeah me too now
th_th: ใช่ ตอนนี้ข้าก็อยากเหมือนกัน

source: This is why humans are dying out
th_th: เพราะงี้ไงพวกมนุษย์ถึงตายกันน่ะ

source: I am interested in the fish guy. Is he made of fish?
th_th: ข้าสนใจเจ้ามนุษย์ปลาน่ะ มันทำมาจากปลาเหรอ?

source: Is he... is he made of fish?
th_th: มัน...มันทำมาจากปลาเหรอ?

source: We already killed the fish guy
th_th: พวกเราฆ่ามนุษย์ปลาไปเรียบร้อยแล้วนี่

source: Oh yeah...
th_th: โอ้ใช่...

source: Ha!
th_th: ฮ่า!

source: Remember when we killed that giant fishman king?
th_th: จำตอนเราฆ่าราชามนุษย์ปลายักษ์ได้ไหมล่ะ?

source: That was fun.
th_th: สนุกใช้ได้

source: We won't see many more of those fishmen gurgler things raiding the south cost now
th_th: เราคงจะไม่ได้เห็นพวกมนุษย์ปลา gurgler กำลังบุกทางใต้กันแล้วล่ะตอนนี้
