Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome Holy Nation.po
Languages: th_th

source: Holy Nation land is no place for a Skeleton…
th_th: ดินแดน Holy Nation ไม่ใช่ที่สำหรับ Skeleton...

source: I’m a Skeleton. I really shouldn’t be here...
th_th: ข้าเป็น Skeleton ข้าไม่ควรอยู่ที่นี่...

source: This is a bad idea...
th_th: นี่เป็นความคิดที่แย่มาก...

source: I shouldn't be here...
th_th: ข้าไม่ควรอยู่ที่นี่...

source: Is this really a good idea? Travelling through Holy Nation territory?
th_th: นี่คิดดีแล้วเหรอ? เดินผ่านเขตพวก Holy Nation น่ะ?

source: Is it really wise for me to be travelling around Holy Nation territory?
th_th: นี่มันฉลาดแล้วเหรอกับการเดินไปมาในเขตพวก Holy Nation?

source: They despise Skeletons… I'll be burned at the stake just for moving...
th_th: พวกมันรังเกียจพวกSkeleton... ถ้าข้าไปคงโดนจับเสียบไม้เผาแน่...

source: They possess a desperate fear of Skeletons… I'll be killed on sight...
th_th: พวกมันควบคุมความกลัวของพวก Skeleton ไว้แล้ว...โดนเจอล่ะก็ตายแน่...

source: Land of the Holy Nation, home of the god prince…
th_th: ดินแดนแห่ง Holy Nation ปิตุภูมิแห่งองค์ชายเทพ...

source: So this is the land of the Holy Nation, birthplace of the Phoenix...
th_th: งั้นนี่ก็คือดินแดนแห่ง Holy Nation ที่ประสูติของ Phoenix...

source: Isn’t this where hundreds of Shek and Hivers ‘disappear’?
th_th: ไม่ใช่ที่ที่ Shek กับพวก Hive 'หายตัวไป'เหรอ?

source: The place where non-humans go, never to return...
th_th: ที่ที่พวกอมนุษย์จะไม่มีวันได้กลับออกไป...

source: ... Lucky me...
th_th: ...ข้านี้โชคดีจริงๆ...

source: Well, isn't this just my lucky day...
th_th: เยี่ยม ก็แค่วันโชคไม่เข้าข้าง...

source: Is it really wise for us to travel Holy Nation territory?
th_th: ฉลาดแล้วเหรอที่พวกเรามาเดินในเขต Holy Nation น่ะ?

source: Holy Nation land. I have a bad feeling about this…
th_th: ดินแดน Holy Nation รู้สึกไม่ดีกับที่นี่เลย...

source: You know, what with them despising any other race to them…
th_th: เจ้ารู้ไหม ว่าพวกเขาดูถูกเผ่าพันธุ์อื่นนอกจากพวกเขา...

source: I hear they're not too fond of non-humans...
th_th: ข้าได้ยินมาว่าพวกเขาไม่ได้รักพวกอมนุษย์...

source: The locals here aren't too friendly with non-humans. And that's an understatement.
th_th: ถิ่นเนี่ยไม่เป็นมิตรกับพวกอมนุษย์หรอกนะ พูดแค่นี้ยังน้อยไปด้วยซ้ำ.

source: So this is the homeland of the Phoenix...
th_th: งั้นนี่ก็คือปิตุภูมิแห่ง Phoenix...

source: Birthplace to the messenger reincarnate of Okran...
th_th: ที่ประสูติแห่งผู้ส่งสารจาก Okran ที่ลงมาจุติใหม่...

source: The Holy Nation are a temperamental bunch, I hear…
th_th: ข้าได้ยินมาว่า Holy Nation เป็นที่กระจุกของพวกอารมณ์ไม่แน่นอน

source: The Phoenix and his grand paladins... Fiery bunch I hear…
th_th: ข้าได้ยินมาว่า...ฟินิกซ์กับเหล่าพาลาดินชั้นสูงของเขาน่ะเป็นที่กระจุกของพวกเร่าร้อนล่ะ...

source: Just act holy and I'm sure we’ll all be fine.
th_th: ทำตัวให้ดูศักดิ์สิทธิ์เข้าไว้ ข้ามั่นใจว่าเราจะไม่เป็นไรแน่.

source: Easy for you to say, human... The bigots will slaughter me on sight...
th_th: เจ้าพูดมันก็ง่ายล่ะ เจ้ามนุษย์...พวกคลั่งศาสนานั่นได้วิ่งเข้ามาเชือดข้าตั้งแต่แรกเห็นแน่...

source: ... I have a bad feeling about this.
th_th: ...ข้ารู้สึกไม่ดีกับที่นี่เลย.

source: Just act holy, they say, It will be easy, they say...
th_th: ทำตัวให้ดูศักดิ์สิทธิ์ไว้ เขาว่ากันงั้น เดี๋ยวก็ผานไปเอง เขาว่ากันงั้น...

source: Home of the sacred flame of Okran...
th_th: ปิตุภูมิแห่งพระเพลิงศักดิ์สิทธิ์แห่ง Okran...

source: Word has it, the flame’s been burning for five thousand years…
th_th: ตำราว่าไว้ เพลิงนั้นยังคงลุกไหม้มากว่าห้าพันปี...

source: I mean, that’s gotta be the work of a god, right?
th_th: ข้าหมายถึง มันต้องเป็นผลงานของพระเจ้าแน่เลย ใช่ไหม?

source: Hmph, I'll believe in the work of god when I see it with my own two eyes...
th_th: ฮึ่ม ข้าจะเชื่อว่ามันเป็นผลงานของพระเจ้าก็ต่อเมื่อข้าได้เห็นมันกับตาตัวเอง...

source: Holy Nation land, home of the race-mad religious zealots.
th_th: ดินแดน Holy Nation บ้านของพวกคลั่งศาสนาเหยียดเผ่า

source: You know these religious zealots are pretty much anti-everything, right?
th_th: เจ้าก็รู้ว่าพวกคลั่งศาสนามันต่อต้านไปซะทุกสิ่ง ถูกไหม?

source: Anyone different to them, they attack in the name of their god...
th_th: ใครที่ต่างไปจากมัน ก็เข้าโจมตีในนามของพระเจ้าของมัน...

source: They have race-madness... fear anybody different to themselves...
th_th: พวกมันคลุ้มคลั่งเรื่องเผ่า... กลัวใครก็ตามที่ต่างไปจากพวกมันเอง...

source: Yay.
th_th: ช่าย

source: ... Why are we here again?
th_th: ...ทำไมเรามานี่อีกแล้วเนี่ย?

source: Holy Nation land? Well isn't this just my lucky day...
th_th: ดินแดน Holy Nation? เยี่ยม ดูท่าวันนี้โชคจะไม่เข้าข้าง...

source: Holy Nation land? You've just got to be kidding me...
th_th: ดินแดน Holy Nation? เจ้าต้องล้อข้าเล่นแน่...

source: This woman-hating hell hole is no place for a lady...
th_th: หลุมนรกที่เกลียดผู้หญิง ไม่มีที่ให้ผู้หญิง...

source: Holding my tongue in this woman-hating hell hole will be the ultimate test of patience...
th_th: การที่ต้องอยู่เงียบๆ ในหลุมนรกที่เกลียดผู้หญิงนี้ เป็นการทดสอบขั้นสุดท้ายของความอดทน...

source: The Holy Nation, one of the oldest civilisations still in existence...
th_th: The Holy Nation หนึ่งในอารยธรรมที่เก่าแก่ที่สุดยังคงมีอยู่...

source: In the beginning, they kept to themselves. The first of the Phoenixes intentions were noble...
th_th: ในตอนเริ่มต้น พวกเขารักษาพวกพ้องตนเอง ฟินิกซ์องค์แรกมีความมุ่งหมายอันสง่างาม...

source: ... Then their values grew distorted, their fear of the unholy only fueled their hunger for destruction...
th_th: ...จากนั้น ความเคารพของพวกเขาก็บิดเบี้ยว พวกเขากลัวแค่สิ่งที่ไม่ศักดิ์สิทธิ์ เติมเชื้อเพลิงให้แก่ความหิวโหยในการทำลายล้าง...

source: Until it consumed them completely... Countless Skeletons lose their lives here under the crusade of the Phoenix.
th_th: จนกว่าจะเผาผลาญพวกเขาจนหมดสิ้น ... เหล่า Skeleton นับไม่ถ้วนเสียชีวิตที่นี่ ภายใต้สงครามครูเสดแห่งฟีนิกซ์

source: Man possessed by his own fear, it is more destructive than any storm...
th_th: มนุษย์ที่โดนครอบงำด้วยความกลัวของตนเอง ทำลายสิ่งต่างๆ ได้มากกว่าพายุเสียอีก...

source: The Holy Lands? Where women are the spawn of Narko? Great, not like I can charm my way out of trouble here...
th_th: The Holy Lands? ที่ที่ผู้หญิงเกิดจาก Narko? เจ๋ง ดูท่าข้าจะหว่านเสน่ห์หนีปัญหาที่นี่ได้นะเนี่ย...
