Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome- beep random 1.po
Languages: th_th

source: Now that Beep is the strongest warrior ever, Beep needs to find a worthy foe.
th_th: ตอนนี้บิ๊บเป็นนักรบที่เก่งกาจที่สุดตลอดกาลแล้ว บิ๊บต้องการหาคู่ต่อสู้ที่สมน้ำสมเนื้อ.

source: You're not the strongest warrior Beep.
th_th: เจ้าไม่ใช่นักรบที่เก่งกาจที่สุดนะบิ๊บ

source: And some treasure.
th_th: แล้วก็สมบัตินิดหน่อย.

source: You're not even all that strong at all really, you need to be careful, your limbs get chopped off too easily.
th_th: ที่จริงแล้วเจ้าก็ไม่ได้แข็งแกร่งอะไรเลยนะ เจ้าจำเป็นต้องระวังไว้ แขนขาเจ้าน่ะโดนสับขาดง่ายนัก

source: And some beautiful human ladies. FEMALE human ladies. Yes. I would like to see one of these.
th_th: แล้วก็มนุษย์ผู้หญิงสวยๆ มนุษย์'ผู้หญิง' ใช่แล้ว ข้าอยากเห็นสักคนนึงดู.

source: Hey! I'm a beautiful human female lady!
th_th: นี่! ฉันนี่ไงมนุษย์ผู้หญิงแสนสวยน่ะ!

source: BEEEEEP!?!?!
th_th: บิ๊บบบบ!?!?!

source: What's that supposed to mean?!?
th_th: นั่นหมายความว่าไง?!?

source: *swallows nervously*
th_th: *กลืนน้ำลายอย่างกังวล*

source: Answer me Beep!
th_th: ตอบข้ามานะ บิ๊บ!

source: ....I... I did not know this....
th_th: ...ข้า...ข้าไม่รู้เรื่องนี้นะ...

source: Shut it, you!
th_th: เจ้าน่ะเงียบไปเลย!

source: Who....
th_th: ใคร...

source: *beep*
th_th: *บิ๊บ*

source: ....w-who else is female?
th_th: ...คะ ใครคือผู้หญิง?

source: ....I'm female
th_th: ...ข้าไงผู้หญิง

source: Beep is so confused!
th_th: บิ๊๊บสับสนหนักมาก!

source: I am, you /IDIOT/!
th_th: ข้านี่ไง เจ้า/IDIOT/!

source: BEEEEP!?!?!
th_th: บิ๊บบบบ!?!?!

source: *Hrk!*
th_th: *ฮึก*
