Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Biome Sinkuun arrival.po
Languages: th_th

source: A lot of hungry people get pushed out of the Empire... And they end up in Sinkuun.
th_th: ราษฎรที่หิวโหยมากมายถูกผลักไสออกจากจักรวรรดิ...แล้วพวกเขาก็มาลงเอยที่ Sinkuun

source: Last thing we need right now is a desperate mob of starvers raiding our pockets....
th_th: สิ่งสุดท้ายที่เราต้องการคือกลุ่มคนหิวโหยที่สิ้นหวังที่จะมาชิงเอาของของเราไป...

source: Those poor souls... Okran protect us all.
th_th: เหล่าวิญญาณที่น่าสงสารทั้งหลาย...ขอให้ Okran จงปกปักรักษาพวกเราทั้งมวลด้วยเถิด

source: More bandits, you say? Well, how refreshing, it must have been all of about five hours since I saw my last one...
th_th: มีโจรอีกแล้วรึ? โอ้ ช่างน่าสดชื่นเหลือเกิน น่าจะผ่านไปได้ 5 ชั่วโมงแล้วหลังจากที่ข้าพบโจรคนก่อน...

source: /QUICKLAUGH/, I'd like to see them try. They're just farmers. They couldn't slit a sitting cactus with their sword skills...
th_th: /QUICKLAUGH/ ข้าก็อยากเห็นความพยายามของพวกมันเหมือนกัน พวกมันเป็นแค่ชาวนา ทักษะดาบของมันคงฟันต้นกระบองเพชรไม่ขาดด้วยซ้ำ...

source: My blade is ready. I'll give them a merciful death.
th_th: ดาบของข้าพร้อมแล้ว ข้าจะมอบมรณาที่ปราณีแก่พวกมัน

source: A lot of hungry Empire peasants live out here... It's likely we'll meet some of them...
th_th: ชาวบ้านของจักรวรรดิที่หิวโหยจำนวนมากมายแาศัยอยู่ที่นี่...เราต้องได้พบพวกเขาบางส่วนแน่นอน...

source: They'll want our food and they won't ask nicely for it.
th_th: พวกเขาต้องการอาหารของเรา และพวกเขาคงไม่ได้ขอดี ๆ แน่นอน

source: Slavery, taxation and poverty laws have pushed most of the honest working farmers to banditry here...
th_th: ระบบทาส ภาษี และกฎหมายเกี่ยวกับความยากจน เป็นสาเหตุหลักที่ทำให้ชาวนาที่ทำอาชีพสุจริตต้องผันตัวมาเป็นโจร...

source: These are just normal people, with normal families and normal lives... taken to the sword just so they can find their next meal...
th_th: พวกนั้นเป็นแค่ชาวบ้านธรรมดา มีครอบครัวและชีวิตที่ปกติ...ต้องจับดาบขึ้นต่อสู้เพื่ออาหารมื้อต่อไปของพวกเขา...

source: Sad... but dangerous also. Watch out.
th_th: น่าเศร้า...แต่ก็อันตรายเช่นกัน พึงระวังให้ดีด้วย
