Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/biome- venge.po
Languages: th_th

source: Ah Venge. This is where the gutters come to hunt for spiders.
th_th: อา Venge ที่นี่คือที่ที่พวกรางน้ำมาตามล่าแมงมุมกัน

source: Not a safe place to be.
th_th: ไม่ใช่ที่ที่ปลอดภัยเลยล่ะ

source: What's a gutter?
th_th: อะไรคือรางน้ำ?

source: /HE/ means the "beak things". That's what they're supposed to be called.
th_th: /HE/หมายถึง "beak things" น่ะ อันที่จริงนั่นคือชื่อที่พวกมันควรถูกเรียก

source: Oh right, beak things.
th_th: อ้อ ใช่แล้ว beak things

source: Wait, spiders!?
th_th: เดี๋ยวนะ แมงมุมเหรอ?!

source: The other one is still running here. Watch out for the sky.
th_th: ยังมี the other one ที่วนเวียนอยู่แถวนี้ คอยมองฟ้าไว้ให้ดี

source: The other what?
th_th: the other อะไรนะ?

source: The other Eye. We can't survive here for long. Have to move quickly.
th_th: ตัวที่เรียกว่า Eye เราคงเอาตัวรอดที่นี่ได้ไม่นาน ต้องไปเร็วหน่อยนะ

source: Why don't you guys ever explain anything properly?
th_th: ทำไมพวกเจ้าไม่อธิบายให้มันรู้เรื่องสักทีฟระ?

source: Damn you, "The other one"!
th_th: เวรแล้ว "The other one"!
