Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Black Dog extortion pt 3.po
Languages: th_th

source: My contract is up. I'll need a 500 Cat exit fee, plus 200 Cats compulsory gratuity...
th_th: สัญญาจ้างของข้าสิ้นสุดแล้ว ข้าต้องการค่าจ้างออก 500 Cat แล้วก็บำเหน็จอีก 200 Cats...

source: Wait, what? I already paid...
th_th: เดี๋ยว, อะไรนะ? ข้าก็ได้จ่ายไปแล้ว...

source: 700 Cats is the balance I'm owed, the standard exit fee is there to cover my passage back home... Are you trying to rob me? You'll pay me my dues or I'll take my dues...
th_th: เจ้าติดข้าอยู่ 700 Cats เป็นค่าจ้างออกปกติที่ต้องครอบคลุมค่าเดินทางกลับบ้านของข้าด้วย...เจ้าจะโกงข้าเหรอ? เจ้าจะจ่ายข้ามาดี ๆ หรือให้ข้าเอามันมาจากเจ้าล่ะ...

source: 700 Cats extra? Don't get smart with me...
th_th: เพิ่มอีก 700 Cats เรอะ? อย่ามาอวดฉลาดกับข้านะ...

source: We already agreed 2500 Cats...
th_th: เราตกลงกันแล้วที่ 2500 Cats...

source: Yeah, a 2500 Cat base fee. I'm not a charity, the standard exit fee is there to cover my passage back home. Now, you'll pay me my dues or I'll take my dues...
th_th: ใช่ ค่าเช่าฐาน 2500 Cats ข้าไม่ใช่องค์กรการกุศล เป็นค่าจ้างออกปกติที่ต้องครอบคลุมค่าเดินทางกลับบ้านของข้าด้วย เจ้าจะจ่ายข้ามาดี ๆ หรือให้ข้าเอามันมาจากเจ้าล่ะ...

source: I don't have 700 Cats!
th_th: ข้าไม่มี 700 Cats!

source: Tough luck for you. You cut me short and I'm gonna have to make up for my loss somehow, aren't I? One last chance, cough it up or I take the value from your unconscious body.
th_th: โชคร้ายหน่อยนะ เจ้ารีดข้าหมดตูดและข้าก็ต้องหาทางชดเชยความเสียหายสักหน่อยน่ะ ใช่มั้ย? เอาล่ะโอกาสสุดท้ายนะ ส่งเงินมาดี ๆ หรือจะให้ข้าค้นเอาจากร่างที่หมดสติของเจ้า

source: I really don't have it...
th_th: ข้าไม่มีจริง ๆ...

source: Beat /HIM/ down. Strip /HIS/ stuff. Penniless worm.
th_th: เล่น/HIM/ซะ เอาของ/HIM/ให้หมด ไอ้หนอนไร้ค่า

source: Scamming snake! (Attack)
th_th: ไอ้งูจอมต้มตุ๋น! (โจมตี)

source: You'll regret crossing /MEUS/! The Black Dog mercs rule these outlands!
th_th: เจ้าจะเสียใจที่มาหือกับ/MEUS/! ทหารรับจ้างBlack dog ครอบครองเขตนี้

source: ... Here
th_th: ...เอาไป

source: Pleasure doin' business with you!
th_th: ยินดีที่ได้ทำธุรกิจกับเจ้า!

source: I want to hire you for longer.
th_th: ข้าต้องการจ้างเจ้าให้นานกว่านี้.

source: Alright. That'll be 2500 Cats.
th_th: ตกลง. ทั้งหมด 2500 Cats.

source: Stick around, mercs! We're not done here.
th_th: อยู่แถวนี้ล่ะ นักรบรับจ้าง! เรายังไม่จบเรื่องกัน

source: I've changed my mind.
th_th: ข้าเปลี่ยนใจละ.

source: Would you make up your mind! Then I'll need my exit fee, 700 Cats.
th_th: ตัดสินใจให้ไวเลย! ข้าต้องการค่าจ้างออก 700 Cats.

source: On second thought, I don't have enough money...
th_th: หลังจากที่คิดแล้วคิดอีก, ข้าคงมีเงินไม่พอหรอก...
