Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Black dog random extortion.po
Languages: th_th

source: It's dangerous ahead here, /OUTLANDER/. The place is riddled with skull collectors, gorillos, bandits.. you name it. You're gonna need mercs with you if you wanna live...
th_th: แถวนี้อันตรายนะ, /OUTLANDER/.ที่นี่เต็มไปด้วยนักเก็บหัวกะโหลก gorillos, โจร, อะไรพวกนั้น. เจ้าต้องการทหารรับจ้างไปกับเจ้า ถ้าเจ้าตองการมีชีวิต

source: It's dangerous up ahead, /OUTLANDER/, no place for a small group like yourself. Round here we got blood bandits, gutters, bonedogs... just about everything that wants you dead... You're gonna need yourself some mercs.
th_th: ข้างหน้านั่นอันตรายนะ, /OUTLANDER/,ไม่มีที่สำหรับกลุ่มเล็กๆอย่างเจ้าหรอก รอบ ๆ นี้มี blood bandits, gutters, bonedogs...อะไรก็ตามที่อยากฆ่าเจ้า...เจ้าต้องการทหารรับจ้าง

source: You'll never make it alone, I tell ya, I've seen some ugly sights around here. /IWE/ can handle anything though, you're safe with /MEUS/. Do the right thing and hire yourself some mercs...
th_th: เจ้าไม่สามารถรอดชีวิตคนเดียวได้หรอก จะบอกให้ ข้าเห็นสิ่งน่าเกลียดรอบ ๆ นี้ /IWE/สามารถรับมือได้ทุกสิ่งทุกอย่าง เจ้าจะปลอดภัยถ้าไปกับ/MEUS/ทำในสิ่งที่ถูกต้องแล้วจ้างเราซะ...

source: I can take care of myself.
th_th: ข้าดูแลตัวเองได้

source: You're lookin' at one of the best mercs in the land... and you don't think /IMWERE/ good enough to protect you? Is that what you're sayin'?
th_th: เจ้ากำลังมองทหารรับจ้างที่ดีที่สุดในแผ่นดิน...แล้วเจ้าไม่คิดเหรอว่า/IMWERE/จะแกร่งพอจะปกป้องเจ้า?เจ้ากำลังพูดอย่างนั้นอยู่ใช่มั้ย

source: I'm saying I don't NEED your protection.
th_th: ข้ากำลังพูดว่า ข้าไม่ต้องการการคุ้มครองของเจ้า

source: So arrogant that you can't even answer me back, huh? You let me walk all the way over to you for nothing, you wasted my time. How about some compensation for that, huh?!
th_th: หยิ่งถึงขนาดไม่ตอบคำถามข้าเหรอ เจ้าทำให้ข้าเสียเวลาเดินมาหาเจ้า ทำไมไม่จ่ายค่าชดใช้มาล่ะ,ฮะ?

source: Can't talk? What's wrong with you, huh? If you're not a customer, then what are you to me, /WORM/?
th_th: พูดไม่ได้เหรอ?เป็นอ่ะไรล่ะ,ฮ่ะ?ถ้าเจ้าไม่ใช่ลูกค้า งั้นเจ้าเป็นอ่ะไรล่ะ, /WORM/?

source: Don't even bother answering. I've lost all my patience with you already!
th_th: ไม่แม้แต่จะตอบข้าเหรอ ข้าหมดความอดทนกับเจ้าแล้วหล่ะ

source: Okay, okay, how much are you charging?
th_th: เอาล่ะ เอาล่ะ เท่าไรหล่ะ?

source: 2500 Cats per day.
th_th: 2500 Cats ต่อวัน

source: I can't afford that. It's too much.
th_th: ข้าจ่ายไม่ได้หรอก มันแพงไป

source: Yep. Pretty much.
th_th: เฮ้อ เอาเถอะ

source: 2500 Cats per day. /IWE/ can handle just about anything for you out here.
th_th: 2500 ต่อวัน ข้าสามารถจัดการทุกอย่างข้างนอกนี่

source: It's too much, I can't afford that.
th_th: มันแพงไป ข้าจ่ายไม่ได้

source: I changed my mind, I'm not interested.
th_th: ข้าเปลี่ยนใจแล้ว ข้าไม่สนใจ

source: Not interested, thanks.
th_th: ข้าไม่สนใจ ขอบใจ

source: Don't be a fool. Look at you, you couldn't swat a rat with that sword. I won't be around to peel you off the floor for free when the gutters are eatin' you alive, I'm telling you that now...
th_th: อย่าเป็นไอ้โง่หน่อยเลย ดูเจ้าสิ ดาบของเจ้าฆ่าหนูไม่ได้ด้วยซ้ำ ข้าไม่เดินไปทั่วแล้วช่วยแซะเจ้าจากพื้นฟรีๆถ้าguttersกำลังกินเจ้าอยู่ ข้าจะบอกอะไรให้...

source: ... Who are you calling fool?
th_th: ...เจ้าเรียกไครว่าไอ้โง่นะ

source: Only a fool would travel here without protection. Seems like you're keen to pick a fight with your friendly neighbourhood mercs though, am I right? Well you're makin' a big mistake. And you've wasted enough of my time.
th_th: มีแต่ไอ้โง่เท่านั้นแหละที่เดินไปแถวนี้โดนไม่มีการคุ้มครอง ดูเหมือนนายอยากจะหาเรื่องกับเพื่อนทหารรับจ้างที่ดีของนายนะ ใช่มั้ย? เจ้ากำลังทำผิดอย่ายิ่งใหญ่ และเจ้ากำลังทำให้เราเสียเวลา

source: Then let's make this quick. (Attack)
th_th: งั้นรีบมาจบเรื่องกันเลยดีกว่า(โจมตี)

source: I said no.
th_th: บอกว่าไม่ไง

source: So, you let me walk all the way over to you for nothing? You waste my time? All this time you distract me, you benefit from my protection. How about some compensation for that, huh?!
th_th: เจ้าให้ข้าเดินมาหาเจ้าแล้วไม่ให้อะไรข้าหรอ? เจ้าทำให้ข้าเสียเวลาใช่มั้ย? ตลอดเวลาที่เราคุยกัน ข้าก็กำลังคุ้งครองเจ้าอยู่จ่ายค่าคุ้มครองมาซะ

source: No. This is ridiculous, I didn't ask for this...
th_th: ไม่ นี่มันเกินไปแล้ว ข้าไม่ได้ขอให้เจ้าช่วย

source: So if you aren’t a customer, what use are you to us, /WORM/? (Places hand on sword)
th_th: เจ้าก็ไม่ใช่ลูกค้า งั้นเจ้าเป็นอะไรล่ะ, /WORM/? (วางมือลงบนดาบ)

source: Beat /HIM/ down. Strip /HIS/ stuff. Penniless worms.
th_th: เล่น/HIM/ซะ เอาของ/HIM/ให้หมด ไอ้หนอนไร้ค่า

source: Easy. Okay, we'll settle this with Cats.
th_th: ใจเย็น เอาหล่ะ เราจะจ่ายเงิน

source: 200 Cats should be enough to cover my time here. Pay up.
th_th: 200 คงจะพอกับค่าเสียเวลา จ่ายมาซะ

source: Pah. Good luck surviving without /MEUS/.
th_th: เชอะ ขอให้รอดชีวิตแล้วกัน ถ้าไม่มี/MEUS/

source: On second thought... No.
th_th: คิดดูอีกที ไม่ดีกว่า

source: If it's a fight you want, I'll give you one!
th_th: ถ้าเจ้าตองการสู้ เราก็จะจัดให้เจ้า

source: Fine. How about 200 Cats for your time?
th_th: เอาล่ะ เราจะจ่าย200ค่าเสียเวลา

source: Then hand it over. Penniless fool.
th_th: งั้นก็ส่งมาซะ ไอ้โง่ไร้ค่า

source: You'll be eaten alive by wild beasts by sundown...
th_th: เจ้าจะถูกกินทั้งเป็นโดยไอ้สัตว์พวกนั้น ตอนพระอาทิตย์ตก

source: How about you compensate the end of my sword?
th_th: ทำไมไม่มาชดเชยกับปลายดาบของข้าล่ะ

source: Remember our name! I'll etch it deep into your flesh!
th_th: จำชื่อของข้าไว้ ข้าจะสลักมันบนเนื้อของเจ้า

source: Look, I'll hire you instead. How much?
th_th: เอาล่ะ ข้าจะจ้างเจ้าแล้วกัน เท่าไรล่ะ

source: I can't afford that, it's too much.
th_th: ข้าจ่ายไม่ได้ มันแพงไป

source: On second thoughts, nevermind.
th_th: คิดดูอีกที ไม่ดีกว่า

source: Fine... how much?
th_th: เอาล่ะ...เท่าไร

source: Hold on, I see a rat that needs swatting! (Attack)
th_th: เดี๋วก่อน ข้าเห็นหนูกำลังจะโดนฆ่า(โจมตี)
