Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Black dog base announcement 1st contact.po
Languages: th_th

source: /HI/ neighbour/S/!
th_th: /HI/ เพื่อนบ้านทั้งหลาย!

source: /HI/ friend/S/...
th_th: /HI/ เพื่อนทั้งหลาย...

source: /HI/ outlander/S/!
th_th: /HI/ คนแปลกหน้าทั้งหลาย!

source: /HI/ settler/S/!
th_th: /HI/ พวกตั้งรกรากทั้งหลาย!

source: /HI/ there...
th_th: เฮ้ ไงพวก...

source: Where's your leader?
th_th: ใครคือหัวหน้าของเจ้า?

source: Can I see your leader?
th_th: ขอข้าพบหัวหน้าของเจ้าได้หรือไม่?

source: Can you show me to your leader?
th_th: เจ้าช่วยพาข้าไปพบหัวหน้าของเจ้าหน่อยได้หรือไม่?

source: Is your leader around?
th_th: หัวหน้าของเจ้าอยู่แถวนี้หรือเปล่า?

source: Got a leader kickin' around here?
th_th: หัวหน้าของเจ้าวนเวียนอยู่แถวนี้หรือเปล่า?

source: I've come to have a chat with 'em...
th_th: ข้ามาเพื่อพูดคุยกับพวกเขา...

source: I just wanna have a chat with 'em...
th_th: ข้าต้องการพูดคุยกับพวกเขา...

source: I'm here for a chat with 'em...
th_th: ข้าอยู่ที่นี่เพื่อพูดคุยกับพวกเขา...

source: I just need to have a word with 'em...
th_th: ข้ามีเรื่องอย่างพูดกับพวกเขานิดหน่อย...

source: Real quick I'll be...
th_th: ข้าจะรีบ...

source: I'll only be a couple of minutes...
th_th: แค่ไม่กี่นาทีหรอก...

source: It won't take long...
th_th: ใช้เวลาไม่นานหรอก...

source: Just got a bit of business to discuss...
th_th: แค่่มีเรื่องธุรกิจนิดหน่อยที่อยากคุยด้วย...

source: Anybody home?
th_th: มีใครอยู่ไหม?

source: Anybody in?
th_th: มีใครอยู่ข้างในบ้าง?

source: Don't be shy...
th_th: ไม่ต้องอายไป...

source: I don't like being ignored, neighbours...
th_th: เพื่อนบ้านเอ๋ย ข้าไม่ชอบถูกเมินเฉยนะ...

source: This is getting rude now, neighbours...
th_th: เพื่อนบ้านเอ๋ย นี่มันเริ่มหยาบคายแล้วนะ....

source: I'm starting to feel rather offended now, neighbours...
th_th: เพื่อนบ้านเอ๋ย ข้าเริ่มรู้สึกว่าถูกหาเรื่องแล้วนะ...

source: Come on, it's hot standing around out here...
th_th: สักทีน่า ยืนอยู่ข้างนอกนี่ร้อนนะ...

source: This is starting to get a little insulting now, neighbours...
th_th: เพื่อนบ้านเอ๋ย ข้ารู้สึกว่าเจ้ากำลังหาเรื่องข้านะ...

source: And my men are starting to get impatient
th_th: และพรรคพวกของข้าเริ่มหมดความอดทนแล้วด้วย

source: And my men are getting testy
th_th: และพรรคพวกของข้าเริ่มหงุดหงิดแล้วด้วย

source: And you're starting to make my men irritable
th_th: และเจ้ากำลังทำให้พรรคพวกของข้าหงุดหงิดแล้วด้วย

source: And my men are starting to get on edge
th_th: และพรรคพวกของข้าเริ่มไม่พอใจแล้วด้วย

source: You won't like them when they're angry...
th_th: เจ้าไม่ชอบหรอก เวลาที่พวกเขาโกรธน่ะ...

source: You don't wanna make them mad...
th_th: เจ้าไม่ชอบหรอก เวลาที่พวกเขาอารมณ์บูดน่ะ...

source: You don't wanna make them angry, do you?
th_th: เจ้าไม่อยากให้พวกเขาโกรธหรอก ใช่มั้ย?

source: You don't wanna disrespect my men now, do you?
th_th: เจ้าไม่อยากให้พวกเขารู้สึกว่าเจ้าไม่เคารพเขาหรอก ใช่มั้ย?

source: You'll regret ignoring me, /OUTLANDER/.
th_th: เจ้าจะเสียใจที่เมินข้า /OUTLANDER/

source: Guess I'll be bringing some friends over for another visit soon.
th_th: ข้าคงต้องพาเพื่อน ๆ มาเยี่ยมใหม่เร็ว ๆ นี้แล้วล่ะ

source: The base isn't gonna like hearing that you ignored us, /OUTLANDER/.
th_th: ที่ฐานคงไม่พอใจที่ได้ยินว่าเจ้าเมินพวกข้าแหง ๆ /OUTLANDER/

source: Be seeing you again real soon then, /OUTLANDER/. Next time with a few more friends...
th_th: แล้วเจอกันเร็ว ๆ นี้นะ /OUTLANDER/ ครั้งต่อไปจะมีพรรคพวกมาอีกหลายคนเลย...
