Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Black dog negotiate.po
Languages: th_th

source: /HI/ neighbour, not been here long I see... Well, let me introduce myself! We're the Black Dog mercenaries, me and my boys, we keep the area safe from those grisly cannibals and nuisance wolves...
th_th: /HI/ เพื่อน,อยู่แถวนี้ไม่นานสินะ...เอาหล่ะ,ขออนุญาติแนะนำตัว! เราคือทหารรับจ้าง Black dog,เราและพี่น้องเรา, เราทำให้บริเวณรอบๆนี้ปลอดภัยจากพวกมนุษย์กินคนและหมาป่าพวกนั้น...

source: Now that you're benefitting from our presence, we kindly ask that you chip in like everyone else. For a small fee we'll guard your base and take care of all your vermin problems.
th_th: เจ้าได้ผลพลอยได้จากการทำงานของเรา, เราขอให้เจ้าจ่ายเงินเหมือนคนอื่น ๆ ด้วยค่าจ้างเล็กน้อย เราจะคุ้มกันฐานของเจ้า และจัดการกับปัญหาของเจ้า

source: Sure, I guess that's only fair.
th_th: แน่นอน, ข้าคิดว่ามันยุติธรรมดี

source: That sounds fair I suppose.
th_th: ข้าคิดว่าฟังดูยุติธรรมดี

source: Glad we have an understanding. 4000 Cats will cover two days of our labour. We earn our living, you stay safe, everyone's happy...
th_th: ข้าดีใจที่เรามีความเข้าใจตรงกัน 4000 Cats จะครอบคลุมค่าแรงทั้งหมดสองวัน พวกเราได้รับสิ่งที่จำเป็นสำหรับพวกเรา ส่วนเจ้าจะรับการคุ้มครอง ทุกคนมีความสุข...

source: Can /IWE/ get a discount?
th_th: /IWE/ ขอส่วนลดหน่อยได้ไหม?

source: Tight on Cats, eh? Sure, we can work something out. We're not heartless afterall, we just wanna help out our neighbours. How much are you thinkin'?
th_th: มีเงินน้อยล่ะสิ? ได้,เราสามารถตกลงกันได้.เราไม่ได้แล้งน้ำใจขนาดนั้น เราแค่อยากช่วยเพื่อนของเรา เจ้าคิดว่าเราจะตกลงกันที่เท่าไรล่ะ?

source: Short on Cats, eh? Sure, I'm a reasonable /MEMAN/, we can work something out. How much can you chip in?
th_th: มีเงินน้อยล่ะสิ? ได้,เราสามารถตกลงกันได้.เราเป็นคนมีเหตุผล /MEMAN/ เราตกลงกันได้ เจ้าคิดว่าเราจะตกลงกันที่เท่าไรล่ะ?

source: ... If that's all you got, then that's all you got. I'll give you your discount.
th_th: ....ถ้าเจ้ามีแค่นั้น เราก็เอาแค่นั้น ข้าจะลดราคาให้เจ้า

source: And that's a BIG discount I just gave you, neighbour. Hope you appreciate it.
th_th: และนั่นคือส่วนลดสำหรับเจ้าเท่านั้น เพื่อน เจ้าน่าจะดีใจนะ

source: That's a little insulting don't you think, neighbour? But if you're not willing to pay us fairly, we've no choice but to be unfair back to you...
th_th: นั่นเหมืนกับดูถูกพวกเรานะ เจ้าว่ามั้ย เพื่อน? ถ้าเจ้าตัดสินใจจะจ่ายเราอย่างไม่เป็นธรรม งั้นเราก็จะไม่เป็นธรรมกับเจ้าเช่นกัน...

source: Take it or leave it. I can't pay more.
th_th: รับไป ไม่ก็ออกไปซะ. ข้าไม่สามารถจ่ายได้มากกว่านี้แล้ว..

source: ... Alright. I can work with that.
th_th: ...เอาล่ะ ข้ารับกับราคานั้นได้

source: On second thoughts, I'll pay the 4000 Cats.
th_th: คิดดูอีกที ข้าจ่าย4000ดีกว่า

source: ... Deal!
th_th: ...ตกลง!

source: Sure. Here.
th_th: แน่นอน. เอ้านี่.

source: Appreciate the donation, neighbour...
th_th: ขอบคุณสำหรับเงินที่ให้, เพื่อนบ้าน . .

source: Stay safe now!
th_th: ตอนนี้เจ้าปลอดภัยแล้ว!

source: That's way too much. Forget it.
th_th: นั้นมันมากเกินไป. ลืมไปซะ.

source: Ok, whatever you want, but I can't protect you from my hungry, sober men if I don't got any rum money...
th_th: เอาหล่ะ ตามใจเจ้าแล้วกัน แต่เราไม่สามารถปกป้องเจ้าจากผู้คนที่หิวโหยและความกระหายของเรา ถ้าเจ้าไม่ให้ค่าเหล้าแก่เขา

source: You deaf? I said forget it.
th_th: หูหนวกหรือไง? ข้าบอกให้ลืมมันซะ

source: That's your final answer, eh?
th_th: หูหนวกหรือไง? ข้าบอกให้ลืมมันซะ

source: Watch yourself, /OUTLANDER/. We'll be back.
th_th: ระวังตัวให้ดี, /OUTLANDER/ เราจะกลับมา

source: You haven't seen the last of us.
th_th: เจ้ายังไม่ได้เห็นฤทธิ์ของเรา

source: Be seeing you real soon, settler.
th_th: แล้วเจอกันเจ้าผู้มาอาศัย

source: ... Fine
th_th: ... เออ

source: Well, can /IWE/ at least pay a fairer price?
th_th: เอาล่ะ อย่างน้อย/IWE/ น่าจะจ่ายอย่างสมเหตุสมผลนะ

source: Well that's a shame, but I can't protect you from my hungry, sober men if I don't got any rum money for them...
th_th: น่าเสียดาย แต่เราไม่สามารถปกป้องเจ้าจากคนของเราที่หิวโหยและกระหาย ถ้าเจ้าไม่จ่าค่าเหล้าให้พวกเขา

source: I've don't have enough money for that.
th_th: เราไม่มีเงินพอสำหรับสิ่งนั้น

source: We don't need your help. We can take care of ourselves.
th_th: เราไม่่ต้องการความช่วยเหลือ เราดูแลตัวเองได้

source: I don't need your help. I can take care of myself.
th_th: ข้าไม่ต้องการความช่วยเหลือข้าดูแลตัวเองได้

source: Thanks for the offer, but /IWE/'ll pass.
th_th: ขอบคุุณสำหรับข้อเสนอ แต่ /IWE/ขอผ่าน

source: ... It wasn't an offer. We need work, you need protection. How about you don't be a /MISER/ and pay up the 4000. Us mercs work our asses off keeping the lands safe out here.
th_th: ...นี่ไม่ใช่ข้อเสนอ.เราต้องการงาน,เจ้าต้องการการปกป้อง ทำไมเจ้าไมเลิกทำตัวเป็น/MISER/แล้วจ่ายเรา 4000 พวกเราทหารรับจ้างเสี่ยงชีวิตเพื่อทำให้แถวนี้ปลอดภัย

source: Not interested. Now get the hell off my land.
th_th: ข้าไม่สนใจ ทีนี้ไสหัวไปจากดินแดนของข้า

source: Ouch! How rude!
th_th: โฮ่!หยาบคายจัง

source: What's with all the hostility?
th_th: ทำไมถึงไม่เป็นมิตรอย่างนั้นล่ะ

source: I find your tone very inhospitable, neighbour...
th_th: เราคิดว่าน้ำเสียงนั่นไม่ค่อยเป็นมิตรเลยนะ เพื่อน

source: How unwelcoming!
th_th: ไม่เป็นมิตรเลย
