Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Blessings!.po
Languages: th_th

source: Blessings from the Holy Lord Phoenix Himself, blessed be his name.
th_th: คำอำนวยพรจาก Lord Phoenix ผู้ศักดิ์สิทธิ์จริงแท้ ขอคำสรรเสริญจงสถิตย์อยู่กับท่าน

source: Love and devotion to the lord of light, Okran.
th_th: ความรักและความศรัทธาแด่เทพแห่งแสง Okran

source: The Divine Will of Okran will have all heretics purged in his holy light.
th_th: เจตนารมณ์อันศักดิ์สิทธิ์แห่ง Okran จะลบล้างเหล่าขบถนอกรีตด้วยลำแสงศักดิ์สิทธิ์ของพระองค์

source: The Divine Will of Okran will have all darkness purged in his holy light.
th_th: เจตนารมณ์อันศักดิ์สิทธิ์แห่ง Okran จะลบล้างความมืดด้วยลำแสงศักดิ์สิทธิ์ของพระองค์

source: Children of Okran, bask in the protection of the divine flame’s light.
th_th: บุตรแห่ง Okran ทั้งหลาย จงให้แสงแห่งไฟศักดิ์สิทธิ์อาบไล้และปกป้องคุ้มครองเจ้า

source: Let the light of our father purify us.
th_th: ขอให้แสงจากพระบิดาชำระล้างมลทินของพวกเราด้วยเถิด

source: Divine light, protect the children of Okran from the dark abyss.
th_th: แสงศักดิ์สิทธิ์ ได้โปรดคุ้มครองบุตรแห่ง Okran จากความมืดดำแห่งขุมนรกด้วยเถิด

source: Blessings upon the Holy Lord Phoenix Himself, blessed be his name for all eternity.
th_th: ได้รับคำอำนวยพรจาก Lord Phoenix ผู้ศักดิ์สิทธิ์จริงแท้ ขอคำสรรเสริญจงสถิตย์อยู่กับท่านไปตลอดกาล

source: Love and devotion to the Holy Lord Phoenix Himself, blessed be his name.
th_th: ความรักและความศรัทธาแด่ Lord Phoenix ผู้ศักดิ์สิทธิ์จริงแท้ ขอคำสรรเสริญจงสถิตย์อยู่กับท่าน

source: Let the Divine Flame’s light protect our holy people! Bless the Lord Okran.
th_th: ขอให้แสงจากไฟศักดิ์สิทธิ์ปกป้องคุ้มครองชาว Holy ด้วยเถิด! คำสรรเสริญจงมีแด่ Lord Okran

source: (Say nothing)
th_th: (ไม่พูดอะไร)

source: (Stay silent)
th_th: (อยู่เงียบ ๆ)

source: (Look down)
th_th: (มองลงข้างล่าง)

source: (Avoid eye contact)
th_th: (หลบสายตา)

source: Lost your faith, /TEMPTRESS/!?
th_th: สูญสิ้นศรัทธารึ /TEMPTRESS/!?

source: Where is your faith, /TEMPTRESS/?!
th_th: ความศรัทธาของเจ้าอยู่ที่ใดกัน /TEMPTRESS/!?

source: Have you no sanctity, /TEMPTRESS/!?
th_th: เจ้าไม่เหลือความสะอาดบริสุทธิ์บ้างรึ /TEMPTRESS/!?

source: Have you no piety, /TEMPTRESS/!?
th_th: เจ้าไม่่ละอายบ้างรึ /TEMPTRESS/!?

source: Where is your tongue, /TEMPTRESS/?! Can you not show simple devotion to our holy lord?
th_th: เจ้าไม่มีปากหรืออย่างไร /TEMPTRESS/!? ไฉนจึงไม่แสดงความเคารพศรัทธาแด่พระเจ้าผู้ศักดิ์สิทธิ์ของพวกเรา?

source: You seem to have lost your faith, woman.
th_th: เหมือนเจ้าจะสิ้นศรัทธาแล้ว นางผู้หญิง

source: Its seems you have lost your sanctity, woman.
th_th: ดูเหมือนเจ้าจะไม่เหลือความสะอาดบริสุทธิ์แล้ว นางผู้หญิง

source: Keep your religious bullcrap to yourself, zealot!
th_th: เก็บคำสอนบ้าบอทางศาสนาไว้กับตัวเจ้าเถอะ เจ้าคนคลั่งศาสนา!

source: What are you /TALKINGABOUT/?
th_th: เจ้ากำลัง/TALKINGABOUT/อะไร?

source: I have no idea what you're /TALKINGABOUT/...
th_th: ข้าไม่รู้ว่าเจ้ากำลัง/TALKINGABOUT/...

source: /GREASY/ woman! Know you no praise for your holy lord?!
th_th: นางผู้หญิง/GREASY/! นี่เจ้าไม่มีความเคารพต่อพระเจ้าผู้ศักดิ์สิทธิ์ของเจ้ารึ?!

source: /DUMB/ woman! Know you no praise for your holy lord?!
th_th: นางผู้หญิง/DUMB/! นี่เจ้าไม่มีความเคารพต่อพระเจ้าผู้ศักดิ์สิทธิ์ของเจ้ารึ?!

source: /GREASY/ woman! Your ears are too full of LAZINESS to hear a simple praise for the holy lord!
th_th: นางผู้หญิง/GREASY/! หูของเจ้านี่ช่างเต็มไปด้วยเรื่องเกียจคร้านจนไม่สามารถได้ยินเสียงสรรเสริญพระเจ้าได้สินะ!

source: /GREASY/ woman! Your mind is too distracted with thoughts of fornication to recognise even a simple prayer!
th_th: นางผู้หญิง/GREASY/! จิตใจของเจ้าเต็มไปด้วยเรื่องผิดประเวณีจนไม่สามารถได้ยินเสียงสวดภาวนาเลยสินะ!

source: /GREASY/ woman! How can you not understand a simple prayer to your holy lord?
th_th: นางผู้หญิง/GREASY/! ไฉนเจ้าจึงไม่สามารถเข้าใจเสียงสวดภาวนาต่อพระเจ้ากันเล่า?

source: /GREASY/ woman! Have you no devotion for your holy lord?!
th_th: นางผู้หญิง/GREASY/! เจ้าไม่มีความศรัทธาและอุทิศตนเพื่อพระเจ้าผู้ศักดิ์สิทธิ์รึ?

source: Take /HIM/ to Rebirth!
th_th: เอาตัว/HIM/ไป Rebirth!

source: This one needs cleansing. Take /HIM/ away.
th_th: เจ้านี่ต้องถูกชำระล้าง เอา/HIM/ไป

source: /SEIZE/ /HIM/! /HE/ will need rebirthing.
th_th: /SEIZE/ /HIM/! /HE/ต้องได้รับการกำเนิดใหม่

source: /HE/ can still be cleansed. Take /HIM/ for Rebirth.
th_th: /HE/ยังสามารถได้รับการชำระล้างได้ พา/HIM/ไปที่ Rebirth

source: Okran is merciful. Send /HIM/ to Rebirth.
th_th: Okran ทรงเมตตา ส่ง/HIM/ไป Rebirth

source: /GREASY/ heretic! Know you no praise for your holy lord?!
th_th: /GREASY/ นอกรีต! นี่เจ้าไม่มีความเคารพต่อพระเจ้าผู้ศักดิ์สิทธิ์ของเจ้ารึ?!

source: /GREASY/ heretic! How can you not understand a simple prayer to your holy lord?
th_th: /GREASY/ นอกรีต! ไฉนเจ้าจึงไม่สามารถเข้าใจเสียงสวดภาวนาต่อพระเจ้ากันเล่า?

source: /DUMB/ heretic! Know you no praise for your holy lord?!
th_th: /DUMB/ นอกรีต! นี่เจ้าไม่มีความเคารพต่อพระเจ้าผู้ศักดิ์สิทธิ์ของเจ้ารึ?!

source: /GREASY/ heretic! Have you no devotion for your holy lord?!
th_th: /GREASY/ นอกรีต! เจ้าไม่มีความศรัทธาและอุทิศตนเพื่อพระเจ้าผู้ศักดิ์สิทธิ์รึ?

source: Lost your faith, heretic!?
th_th: สูญสิ้นศรัทธารึ เจ้าคนนอกรีต!?

source: Where is your faith, heretic?!
th_th: ความศรัทธาของเจ้าอยู่ที่ใดกัน เจ้าคนนอกรีต!?

source: Have you no sanctity, heretic!?
th_th: เจ้าไม่เหลือความสะอาดบริสุทธิ์บ้างรึ เจ้าคนนอกรีต!?

source: Have you no piety, heretic!?
th_th: เจ้าไม่่ละอายบ้างรึ เจ้าคนนอกรีต!?

source: Where is your tongue, heretic?! Can you not show simple devotion to our holy lord?
th_th: เจ้าไม่มีปากหรืออย่างไร เจ้าคนนอกรีต!? ไฉนจึงไม่แสดงความเคารพศรัทธาแด่พระเจ้าผู้ศักดิ์สิทธิ์ของพวกเรา?

source: You seem to have lost your faith, brother.
th_th: ดูเหมืือนเจ้าจะสูญสิ้นศรัทธาแล้ว ภราดา

source: Its seems you have lost your sanctity, brother.
th_th: ดูเหมืือนเจ้าจะไม่เหลือความสะอาดบริสุทธิ์แล้ว ภราดา

source: ... Burn all the heretics!
th_th: ...เผาพวกนอกรีตทิ้งให้หมด!

source: ... Purge the heretics!
th_th: ...กำจัดพวกนอกรีตซะ!

source: ... All heretics be purged!
th_th: ...พวกนอกรีตต้องถูกกำจัด!

source: ... Burn the heretics! Burn them all!
th_th: ...เผาพวกนอกรีตทิ้งให้หมด! เผาให้หมด!

source: ... Let the heretics burn in a holy ball of flames!
th_th: ...พวกนอกรีตจงถูกเผาผลาญด้วยลูกไฟศักดิ์สิทธิ์!

source: ... Let the heretics be purged in a blaze of fire!
th_th: ...พวกนอกรีตจงถูกกำจัดด้วยเปลวไฟ!

source: ... A firey doom to all heretics of the Holy Empire!
th_th: ...พวกนอกรีตใน Holy Empire ต้องพินาศด้วยเปลวเพลิง!

source: The flame of the holy light will protect us from the heretics of the dark abyss.
th_th: เปลวไฟจากแสงศักดิ์สิทธิ์จะคุ้มครองพวกเรา จากความมืดดำของพวกนอกรีต

source: All heretics will be purged in the Divine Flame of Okran.
th_th: พวกนอกรีตทั้งหมดจะถูกกำจัดโดยไฟศักดิ์สิทธิ์แห่ง Okran

source: Heretics be purged from our holy soil! Bask in the glow of the Divine Flame.
th_th: พวกนอกรีตทั้งหมดจะถูกกำจัดไปจากแผ่นดินศักดิ์สิทธิ์นี้! จงให้แสงแห่งไฟศักดิ์สิทธิ์อาบไล้เจ้า

source: The enemy must be purged with fire. Purged from these holy lands.
th_th: ศัตรูต้องถูกกำจัดด้วยเปลวไฟ กำจัดมันไปให้พ้นจากดินแดนศักดิ์สิทธิ์นี้

source: And so the enemy shall be purged with fire, by the Will of Okran.
th_th: และพวกศัตรูต้องถูกกำจัดด้วยเปลวไฟ ด้วยเจตนารมณ์แห่ง Okran

source: It is Okran's will that the darkness be burned from these lands.
th_th: การเผาทำลายความมืดให้หายไปจากแผ่นดินคือเจตนารมณ์แห่ง Okran

source: The Lord Okran shall burn away all dark agents and darkened ones from the dark abyss. Praise to Okran for his divine protection.
th_th: Lord Okran จะเผาทำลายทูตมืดและผู้แปดเปื้อนที่มาจากความมืดมิดแห่งขุมนรก คำสรรเสริญแด่การคุ้มครองอันศักดิ์สิทธิ์ของ Okran

source: The Holy Lord Phoenix Himself will carry out Okran's will to burn all darkness from this land! Praise to Okran for his sacred protection!
th_th: Lord Phoenix ผู้ศักดิ์สิทธิ์เป็นผู้สืบทอดเจตนารมณ์แห่ง Okran ในการเผาทำลายความมืดให้หายไปจากแผ่นดิน! คำสรรเสริญแด่การคุ้มครองอันศักดิ์สิทธิ์ของพระองค์!

source: The holy servants of Okran will fight his last crusade, to prevent the Second Extinction. The Agents Of Darkness will be burned away from these lands with the Lord's light. Praise the lord Okran's sacrifices for mankind!
th_th: ทาสรับใช้ผู้ศักดิ์สิทธิ์แห่ง Okran จะต่อสู้ในสงครามศักดิ์สิทธิ์ครั้งสุดท้าย เพื่อยับยั้งการสูญพันธุ์ครั้งที่สอง ทูตมืดจะถูกด้วยแสงแห่งพระเจ้าเผาทำลายไปจากดินแดนนี้ คำสรรเสริญแด่การเสียสละเพื่อมนุษยชาติของ Lord Okran!

source: Love and devotion to lord Okra! (Bow)
th_th: ความรักและความศรัทธาแด่ Lord Okra! (น้อมคำนับ)

source: Eternal blessings to the Holy Fire Spirit! (Bow)
th_th: คำอำนวยพรชั่วกาลนานแด่จิตวิญญาณแห่งเปลวไฟศักดิ์สิทธิ์! (น้อมคำนับ)

source: Bless the Holy Griffin himself, praised be his name! (Bow)
th_th: คำอำนวยพรแด่ Griffin ผู้ศักดิ์สิทธิ์ ขอคำสรรเสริญจงสถิตย์อยู่กับท่าน! (น้อมคำนับ)

source: Praise to Lord Orkan! (Bow)
th_th: คำสรรเสริญแด่ Lord Okran! (น้อมคำนับ)

source: Praise to Lord Kral! (Bow)
th_th: คำสรรเสริญแด่ Lord Kral! (น้อมคำนับ)

source: Love and devotion to lord Kral! (Bow)
th_th: ความรักและความศรัทธาแด่ Lord Kral! (น้อมคำนับ)

source: Love and devotion to lord Orkan! (Bow)
th_th: ความรักและความศรัทธาแด่ Lord Okran! (น้อมคำนับ)

source: /DUMB/ heretic! Get it right! Need I send your /GREASY/ bones to Rebirth school?!
th_th: /DUMB/ นอกรีต! ทำตัวดี ๆ หน่อย! อยากให้ข้าส่งกระดูก/GREASY/ของเจ้าไปที่โรงเรียน Rebirth หรือไง?!

source: Curse you, /GREASY/ one! Your clumsy words are an insult to the holy lord! Need I send you to be cleansed?
th_th: ขอสาปแช่งเจ้า ตัว/GREASY/! ถ้อยคำโง่เขลาของเจ้าเป็นการดูถูกพระเจ้าผู้สักดิ์สิทธิ์! อยากให้ข้าส่งเจ้าไปชำระล้างรึ?

source: /GREASY/ imbecile! Get it right!
th_th: เจ้าตัว/GREASY/ไร้ประโยชน์! ทำตัวดี ๆ หน่อย!

source: Lord Okran have mercy on my stupidity! (/GROVEL/)
th_th: ขอให้ Lord Okran ทรงเมตตาในความโง่เขลาของข้าด้วย! (/GROVEL/)

source: Lord of Light, forgive my blasphemous ways! (/GROVEL/)
th_th: ขอให้เทพแห่งแสงทรงอภัยให้การดูหมิ่นศาสนาของข้าด้วย! (/GROVEL/)

source: Lord of Light, forgive me of my /DIRTY/ sins! (/GROVEL/)
th_th: ขอให้เทพแห่งแสงทรงอภัยให้บาปอัน/DIRTY/ของข้าด้วย! (/GROVEL/)

source: Lord Okran, have mercy on me for my /GREASY/ ways! (/GROVEL/)
th_th: ขอให้ Lord Okran ทรงเมตตาในความ/GREASY/ของข้าด้วย! (/GROVEL/)

source: Lord of Light, forgive my blasphemous mistake! (/GROVEL/)
th_th: ขอให้เทพแห่งแสงทรงอภัยให้ความผิดพลาดด้วยการดูหมิ่นศาสนาของข้าด้วย! (/GROVEL/)

source: The lord forgives you my child...
th_th: พระเจ้าทรงอภัยให้เจ้า ลูกเอ๋ย...

source: The lord absolves you my holy /BROTHER/...
th_th: พระเจ้าทรงอภัยให้ท่าน /BROTHER/ผู้ศักดิ์สิทธิ์ของข้า...

source: Lord Okran is merciful, you are forgiven my child...
th_th: Lord Okran ทรงเปี่ยมเมตตาคุณ เจ้าได้รับการอภัยแล้ว ลูกเอ๋ย...

source: All is well. The Lord is forgiving, the lord loves you...
th_th: ทุกอย่างเรียบร้อยดี พระเจ้าให้อภัย พระเจ้ารักลูกนะ...

source: Light Lord Okra have mercy on my stupidity! (/GROVEL/)
th_th: ขอให้ Lord Okra ทรงเมตตาในความโง่เขลาของข้าด้วย! (/GROVEL/)

source: Fire Spirit Lord, forgive my blasphemous ways! (/GROVEL/)
th_th: ขอให้เทพแห่งจิตวิญญาณแห่งไฟทรงอภัยให้การดูหมิ่นศาสนาของข้าด้วย! (/GROVEL/)

source: Fire Lord Kral, forgive me of my /DIRTY/ sins! (/GROVEL/)
th_th: Kral เทพแห่งไฟอภัยให้บาปอัน/DIRTY/ของข้าด้วย! (/GROVEL/)

source: Lord Okrane, have mercy on me for my /GREASY/ ways! (/GROVEL/)
th_th: ขอให้ Lord Okrane ทรงเมตตาในความ/GREASY/ของข้าด้วย! (/GROVEL/)

source: Lord Okrunus, forgive my blasphemous mistake! (/GROVEL/)
th_th: ขอให้ Lord Okrunus ทรงอภัยให้ความผิดพลาดด้วยการดูหมิ่นศาสนาของข้าด้วย! (/GROVEL/)

source: You can't even address our lord correctly!.. Heretic! We won't have unholy ones corrupt our sacred soil!
th_th: เจ้ายังขานนามพระเจ้าของพวกเราไม่ถูกด้วยซ้ำ!...เราจะไม่ยอมให้คนแปดเปื้อนมาทำลายแผ่นดินศักดิ์สิทธิ์ของเรา!

source: Do you not even know the lord's name!?... Heretic!
th_th: เจ้าไม่รู้กระทั่งพระนามของพระเจ้าเรอะ!...ไอ้คนนอกรีต!

source: A simple slip of the tongue, I didn't mean to anger you, holy one
th_th: แค่พูดผิดน่ะ ข้าไม่ได้ตั้งใจจะยั่วโมโหท่าน ท่านผู้ศักดิ์สิทธิ์

source: It was a terrible slip of the tongue. Forgive me, holy one
th_th: เป็นอาการลิ้นพันกันที่แย่มาก อภัยให้ข้าด้วย ท่านผู้ศักดิ์สิทธิ์

source: A slip of the tongue. I'm sorry, holy one
th_th: แค่พููดผิดน่ะ ข้าขอโทษด้วย ท่านผู้ศักดิ์สิทธิ์

source: A blasphemous slip of the tongue! Please, forgive me.
th_th: เป็นการพูดผิดที่ดูหมิ่นศาสนามาก! ได้โปรด อภัยให้ข้าด้วย

source: It was a foolish slip of the tongue. I meant no offense, holy one.
th_th: เป็นอาการลิ้นพันกันที่โง่มาก ข้าไม่ได้ต้งใจดูหมิ่นท่านนะ ท่านผู้ศักดิ์สิทธิ์

source: You try to distract me with talk of the 'tongue', seductress!? /TAINT/ed woman!
th_th: เจ้าพยายามใช้ฝีปากทำให้ข้างุนงงด้วยการพูดถึง 'ลิ้น' สินะ นางจอมยั่ว!? นางผู้หญิง/TAINT/!

source: What is this /DIRTY/ talk of tongues!? /TAINT/ed woman!
th_th: เจ้าพูดพล่าม/DIRTY/อะไร!? นางผู้หญิง/TAINT/!

source: What is this /DIRTY/ talk of slippery tongues!? /TEMPTRESS/!
th_th: เจ้าพูดพล่าม/DIRTY/บ้าบออะไร!? /TEMPTRESS/!

source: Forgive me, it was a terrible choice of words, holy one...
th_th: อภัยให้ข้าด้วย ข้าเลือกใช้คำผิดไปหน่อย ท่านผู้ศักดิ์สิทธิ์...

source: Forgive me for my clumsy choice of words, holy one...
th_th: อภัยให้ข้าด้วย ที่เลือกใช้คำพลาดไปหน่อย ท่านผู้ศักดิ์สิทธิ์...

source: Pray, and pray hard, my child. There is a lot of darkness that must be cleansed from within you, and it will take a lot of work to earn the Lord Okran's acceptance...
th_th: ลูกเอ๋ย จงสวดภาวนาอย่างมุ่งมั่น มีความมืดมากมายที่ต้องถูกชำระล้างจากตัวเจ้า และเจ้าต้องพยายามอย่างมากเพื่อให้ได้รับการยอมรับจาก Lord Okran...

source: Tread carefully. We've no patience for the idle on Holy Nation territory, woman.
th_th: ระวังไว้หน่อย บนแผ่นดิน Holy Nation นี้ พวกเราไม่ยอมรับความเกียจคร้านนะ นางผู้หญิง

source: ... All is forgiven, brother. Perhaps I do become a little emotional when it comes to revering our Lord Okran and the Holy Lord Phoenix Himself, but that is only because my devotion is so powerful!
th_th: ...ข้าให้อภัยทุกอย่าง ภราดา บางทีข้าก็มีอารมณ์ร่วมมากไปหน่อยเวลาพูดถึง Lord Okran และ Lord Phoenix ผู้ศักดิ์สิทธิ์ แต่นั่นเป็นเพราะว่าข้ามีศรัทธาสูงส่งมากนะ!

source: Um... Perhaps I'll just keep my mouth shut from now on...
th_th: อืม...บางทีข้าควรจะหุบปากตั้งแต่นี้เป็นต้นไปเลยนะ...

source: With a /DIRTY/ mouth like that, perhaps so!... But the Lord Okran teaches forgiveness. Go, pray and repent for your sinful ways, child...
th_th: นั่นมันปาก/DIRTY/อะไรกันนี่!...แต่ Lord Okran สอนให้เราให้อภัย ไปซะ จงสวดภาวนาเพื่อไถ่บาปของเจ้าเสีย ลูกเอ๋ย...

source: Are you serious? Now you're offended by the word 'tongue'?!
th_th: เจ้าจริงจังหรือนี่? เจ้ารู้สึกว่าคำว่า 'ลิ้น' ดูหมิ่นเจ้างั้นเรอะ?!

source: Backtalking me as well! The undisciplined woman has no place on holy /LAND/. You cannot hide your true heresy from me, child!
th_th: การพูดต่อปากต่อคำกับข้าก็ด้วย! สตรีที่ไม่ได้รับการอบรมสั่งสอนไม่มีที่ยืนบน/LAND/ศักดิ์สิทธิ์ เจ้าไม่สามารถปิดบังความคิดนอกคอกของเจ้าจากข้าได้หรอกนะ ลูกเอ๋ย!

source: Pray for Okran's forgiveness at the temple. The lord is a merciful god.
th_th: สวดภาวนาเพื่อขอการอภัยโทษจาก Lord Okran ที่วิหารเสีย พระเจ้าทรงมีเมตตามากนะ

source: The lord is a merciful to the pure of blood. Pray for his forgiveness.
th_th: พระเจ้าทรงเมตตาต่อสายเลือดบริสุทธิ์ จงสวดภาวนาเพื่อขอการอภัยโทษจากพระองค์

source: You are forgiven, child. But you must continue to pray for the Lord Okran's mercy.
th_th: ลูกเอ๋ย เจ้าได้รับการอภัยแล้ว แต่เจ้าต้องสวดภาวนาเพื่อรับความเมตตาจาก Lord Okran ต่อไป

source: Calm down, it is unholy to let your emotions overcome you.
th_th: ใจเย็น ๆ มันไม่ดีถ้าจะยอมให้อารมณ์เข้าครอบงำเจ้า

source: Relax, it's unbecoming of a holy one to let anger get the better of him.
th_th: ผ่อนคลายหน่อย การปล่อยให้ความโกรธเข้าครอบงำจะทำให้เจ้าแปดเปื้อนนะ

source: Calm yourself. It is unholy to let anger take a hold of you.
th_th: ใจเย็็น ๆ อย่าปล่อยให้ความโกรธครอบงำเจ้า

source: Calm down, brother. Anger is for fools, not for the holy.
th_th: ใจเย็น ๆ ภราดา ความโกรธมีสำหรับพวกโง่เขลา ไม่ใช่ผู้ศักดิ์สิทธิ์นะ

source: You're telling me to calm down?! You'll speak when you're spoken to, woman!
th_th: เจ้าบอกให้ข้าใจเย็น ๆ เรอะ?! เจ้าจะพูดได้ก็ต่อเมื่อมีคนพูดกับเจ้าก่อน นางผู้หญิง!

source: A /TEMPTRESS/ telling me what is and isn't holy?! You speak out of line, woman!
th_th: /TEMPTRESS/สอนข้าว่าอะไรคือความแปดเปื้อนงั้นรึ?! เจ้าล้ำเส้นไปหน่อยแล้ว นางผู้หญิง!

source: A woman cannot preach wisdom! How dare you speak to me like that!
th_th: สตรีไม่สามารถเทศนาเกี่ยวกับสติปัญญาได้! เจ้ากล้าดีอย่างไรถึงพูดกับข้าเช่นนี้!

source: See? So much anger! You call yourself a priest?!
th_th: เห็นมั้ย? ความโกรธา! เจ้าเรียกตัวเองว่านักบวชเรอะ?!

source: Hnnnngh!!! You... you... wretched, evil woman! How dare you insult me like this! How dare you!
th_th: อ๊ากกกก!!! เจ้า...เจ้า...นางปีศาจสตรีโสโครก! เจ้ากล้าดีอย่างไรมาดูหมิ่นข้าเช่นนี้! เจ้ากล้าดีอย่างไร!

source: Get this /TERRORIST/ away from me!
th_th: เอาตัว/TERRORIST/นี่ไปให้พ้นหน้าข้า!

source: Get this /TERRORIST/ out of my sight!
th_th: เอาตัว/TERRORIST/นี่ออกไปให้พ้นสายตาข้า!

source: Take this /TERRORIST/ to Rebirth!
th_th: เอาตัว/TERRORIST/นี่ไป Rebirth!

source: Take this /TERRORIST/ away! Make sure /HEIS/ thoroughly cleansed!
th_th: เอาตัว/TERRORIST/นี่ไป! ทำให้แน่ใจว่า/HEIS/จะถูกชำระล้างจนบริสุทธิ์!

source: I'll speak however I goddamn want!
th_th: ข้าจะพูดอะไรก็ตามที่ข้าอยากพูด!

source: Not in this town you won't, woman.
th_th: ไม่ใช่ในเมืองนี้ นางผู้หญิง

source: Telling a holy priest of Okran what is unholy?! How wicked!
th_th: บอกว่านักบวชศักดิ์สิทธิ์แห่ง Okran ไม่ศักดิ์สิทธิ์งั้นรึ?! ช่างเลวทรามนัก!

source: Preaching to a priest of Okran on what is holy?! Ignorant man!
th_th: เทศนาสั่งสอนนักบวชแห่ง Okran ว่าอะไรคือความศักดิ์สิทธิ์งั้นรึ?! เจ้าคนโฉดเขลา!

source: You're preaching to ME?! I am the priest who preaches, YOU are a lowly heretic who can't even address the lord correctly!
th_th: เจ้าเทศนาสอนข้าเรอะ?! ข้าคือนักบวชที่มีหน้าที่เทศนา เจ้าเป็นแค่คนนอกรีตชั้นต่ำที่เรียกชื่อพระเจ้าไม่ถูกด้วยซ้ำ!

source: Can't handle the truth, huh?
th_th: รับความจริงไม่ได้หรือไง หือ?

source: Why I-! To backtalk a priest of Okran, you truly are a wicked heretic!
th_th: นี่เจ้า-! ต่อปากต่อคำกับนักบวชแห่ง Okran เจ้านี่มันเป็นคนนอกรีตเลวทรามแท้ ๆ !

source: Or maybe I'm just more holy than you are?
th_th: หรือบางทีข้าอาจจะศักดิ์สิทธิ์มากกว่าเจ้ามั้ย?

source: I don't know who you think you are, and I don't care. A true Okranite respects the holy clergy. But you, you're attitude reeks of heresy...
th_th: ข้าไม่่รู้ว่าเจ้าคิดว่าตัวเองเป็นใคร ข้าไม่สนใจด้วย ชาว Okranite ที่แท้จริงให้ความเคารพนับถือสมาชิกทางศาสนาผู้ศักดิ์สิทธิ์ แต่การกระทำของเจ้านี่ส่อว่าเจ้าเป็นพวกนอกรีต...

source: Yeesh, no need to overreact...
th_th: อือฮึ ไม่ต้องมีปฏิกิริยาเกินจริงไป...

source: How pedantic. Does it really matter?
th_th: อวดฉลาดนัก นี่มันสำคัญมากนักรึ?

source: Honestly, I just don't care.
th_th: เอาจริง ๆ นะ ข้าไม่สนใจล่ะ

source: This is boring, I don't care!
th_th: น่าเบื่อจริง ข้าไม่สนใจแล้ว!

source: Does it really matter? It's all /DRIVEL/ anyway...
th_th: นี่มันสำคัญจริงเหรอ? มันเป็นแค่เรื่อง/DRIVEL/เองนะ...

source: Let's face it. It's all /DRIVEL/ anyway...
th_th: ยอมรับเถอะ มันเป็นแค่เรื่อง/DRIVEL/เองนะ...

source: Insolent woman! Have some respect!
th_th: นางผู้หญิงอวดดี! มีสัมมาคารวะหน่อย!

source: /GREASY/ woman! Have you no shame?!
th_th: นางผู้หญิง/GREASY/! เจ้าไม่ละอายบ้างรึ?!

source: Have you no shame, woman? In Okran's name, I will punish you for your sins!
th_th: เจ้าไม่ละอายบ้างรึ นางผู้หญิง? ในนามแห่ง Okran ข้าจะลงโทษบาปของเจ้า!

source: Have you no shame, heretic? In Okran's honor, I will punish you!
th_th: เจ้าไม่ละอายบ้างรึึ เจ้าคนนอกรีต? ด้วยเกียรติของ Okran ข้าจะลงโทษเจ้า!

source: /GREASY/ heretic! Have some respect!
th_th: เจ้าคนนอกรีต/GREASY/! มีสัมมาคารวะหน่อย!

source: /TAINT/ed woman! Get it right! If you spent less time idling and more time in worship, you wouldn't make such blasphemous mistakes!
th_th: นางผู้หญิง/TAINT/! ทำตัวดี ๆ หน่อย! ถ้าเจ้าใส่ใจจะภาวนามากกว่าทำตัวเกียจคร้านไปวัน ๆ เจ้าจะไม่ทำผิดต่อศาสนาแบบนี้!

source: /DUMB/ wench! Get it right!
th_th: นางโสเภณี/DUMB/! ทำตัวดี ๆ หน่อย!

source: /TAINT/ed wench! Get it right! If you spent more time in worship and less time slacking, you wouldn't make such /GREASY/ mistakes!
th_th: นางโสเภณี/TAINT/! ทำตัวดี ๆ หน่อย! ถ้าเจ้าใส่ใจจะภาวนามากกว่านี้แทนทีจะทำตัวเกียจคร้านไปวัน ๆ เจ้าจะไม่ทำผิด/GREASY/แบบนี้!

source: Praise the holy lord himself, blessed be his name! (Bow)
th_th: ขอสรรเสริญพระเจ้าผู้ศักดิ์สิทธิ์ ขอคำสรรเสริญจงสถิตย์อยู่กับท่าน! (น้อมคำนับ)

source: Love and devotion to lord Okran! (Bow)
th_th: ความรักและความศรัทธาแด่ Lord Okran! (น้อมคำนับ)

source: Eternal blessings to the Lord of Light! (Bow)
th_th: คำอำนวยพรชั่วกาลนานแด่เทพแห่งแสง! (น้อมคำนับ)

source: Praise to Lord Okran! (Bow)
th_th: คำสรรเสริญแด่ Lord Okran! (น้อมคำนับ)

source: And the Lord Okran shall smite all dark agents and darkened ones from the dark abyss! Praise to Okran for his divine protection!
th_th: และ Lord Okran จะทำลายทูตมืดและผู้แปดเปื้อนที่มาจากความมืดมิดแห่งขุมนรก! คำสรรเสริญแด่การคุ้มครองอันศักดิ์สิทธิ์ของ Okran!

source: And the Holy Lord Phoenix Himself will carry out Okran's will to smite all darkness from this land! Praise to Okran for his sacred protection!
th_th: และ Lord Phoenix ผู้ศักดิ์สิทธิ์จะสืบทอดเจตนารมณ์แห่ง Okran ในการทำลายความมืดให้หายไปจากแผ่นดิน! คำสรรเสริญแด่การคุ้มครองอันศักดิ์สิทธิ์ของ Okran!

source: And the holy servants of Okran will fight his last crusade, to prevent the Second Extinction, the attack from the Agents Of Darkness! Praise the lord Okran's sacrifices for mankind!
th_th: และทาสรับใช้ผู้ศักดิ์สิทธิ์แห่ง Okran จะต่อสู้ในสงครามศักดิ์สิทธิ์ครั้งสุดท้าย นั่นคือการโจมตีของทูตแห่งความมืด เพื่อยับยั้งการสูญพันธุ์ครั้งที่สอง! คำสรรเสริญแด่การเสียสละเพื่อมนุษยชาติของ Lord Okran!

source: (Keep your head bowed down)
th_th: (ก้มศีรษะต่ำไว้)

source: (Bow your head)
th_th: (ก้มศีรษะลง)

source: Amen!
th_th: อาเมน!

source: Divine blessings!
th_th: คำอำนวยพรอันศักดิ์สิทธิ์!

source: Eternal blessings to Okran!
th_th: คำอำนวยพรชั่วกาลนานแด่ Okran!

source: Death to the evil heretics!
th_th: พวกปีศาจนอกรีตจงตายซะ!

source: Destroy the unholy heretics!
th_th: ทำลายพวกนอกรีตที่แปดเปื้อน!

source: And we'll eat the hearts of the heretics!... And then burn them!
th_th: และพวกเราจะกินหัวใจของพวกนอกรีต!...จากนั้นก็เผาพวกมัน!

source: Destroy all that is... bad!
th_th: ทำลายทุกสิ่งทุกอย่างที่...เลวร้ายซะ!

source: Burn everything! Everything unholy!
th_th: เผาให้หมด! เผาทุกอย่างที่แปดเปื้อน!

source: Burn it all! We'll burn it all down!
th_th: เผาให้หมด! เราจะเผาเผาทุกอย่างให้หมด!

source: Bask in the protection of the divine flame’s light, Child of Okran! You are safe from the darkness on sacred soil
th_th: จงให้แสงแห่งไฟศักดิ์สิทธิ์อาบไล้เจ้า บุตรแห่ง Okran ทั้งหลาย! เจ้าจะปลอดภัยจากความมืดเมื่อยู่บนแผ่นดินศักดิ์สิทธิ์นี้

source: ... Are you finished yet?
th_th: ...เจ้าพูดจบหรือยัง?

source: ... Are we done here yet?
th_th: ...เราจบเรื่องที่นี่กันหรือยัง?

source: ... How much longer is this gonna go on for?
th_th: ...มันจะต่ออีกยาวไหมนี่?

source: ... Can I go now?
th_th: ...ข้าไปได้หรือยัง?

source: ... You done?
th_th: ...เจ้าเสร็จแล้วหรือ?

source: All hail Narko and her demon minion robots!
th_th: Narko และเหล่าลูกสมุนหุ่นยนต์ของนางจงเจริญ!

source: Prayers and orgies to the demoness Narko!
th_th: สวดภาวนาและประเวณีหมู่เพื่อนารีปีศาจ Narko!

source: Praise the goddess Narko, goat sacrifices all round!
th_th: คำสรรเสริญแด่เทพธิดา Narko เอาแพะบูชายัญมา!

source: A goat for Narko, demoness of the night! Love and devotion!
th_th: แพะเพื่อถวาย Narko นารีปีศาจแห่งราตรี! ด้วยความรักและความศรัทธา!
