Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Boasting bar patron worlds end.po
Languages: th_th

source: So, I finally reach the sunken ruins, right, and I find me this huge old lab full o' treasures. Musta been my lucky day, right?
th_th: ข้าได้เข้าไปถึงซากปรักหักพัง และข้าได้เจอห้องทดลองเก่า เต็มไปด้วยสมบัติ ต้องเป็นวันที่โชคดีของข้าแน่ ใช่มั้ย?

source: Think again! Turns out a family of flesh insects were having a party in there and I wasn't on the guest list...
th_th: ไม่เลย!กลายเป็นว่านั่นเป็นรังของพวกflesh insects ยั้วเยี้ยไปหมด และข้าคงเเป็นแขกไม่ได้รับเชิญ

source: Never have I ran faster in my life! Managed to hide in a tree hollow for five whole days living offa bark and rain water...
th_th: ข้าไม่เคยวิ่งหนีเร็วขนาดนั้นเลยในชีวิต ข้าหนีไปซ่อนในซากไม้ตั้ง5วัน กินเปลือกไม้และน้ำฝนเพื่อประทังชีวิต

source: Think that's bad? I was down near the hives, starving hungry because those wierdos wouldn't know real food if it hit 'em in the face. So I went wolf hunting...
th_th: คิดว่านั่นแย่แล้วเหรอ? ข้าหลบอยู่ไกล้พวกHives เจ้าพวกนั้นไม่รู้หรอกว่าอาหารเป็นอย่างไร ถึงเจ้าจะเอาอาหารไปว่างตรงหน้ามัน ข้าเลยเิ่มล่าพวกหมาป่า...

source: But I forgot to watch my own back, didn't I. Got jumped by a frisky gorillo and ended up in a wrestling match with 'im.
th_th: แต่่ข้าไม่ได้ระวังตัว ไม่เลย ข้าถูกพวก gorillo โจมตี ข้าเลยต้องสู้กับพวกมัน

source: Lost an ear and four fingers that day...
th_th: ข้าเสียหูข้างนึงและนิ้ว4นิ้วในวันนั้น

source: .... The hell are you talking about? I can see all ten of ya fingers right there!
th_th: ...เจ้าพูดเรื่องอะไรของเจ้า? ข้าเห็นว่าเจ้ายังมีนิ้วครบ10นิ้วอยู่เลย

source: Yeah, I, uh, met an old skeleton priest an' he voodoo'd 'em back for me.
th_th: อ่า,ข้า,เอ่อ,ข้าได้พบกับหมอผี Skeleton เขาทำพิธีเรียกมันกลับมาให้ข้า

source: Well ain't that somethin' else, eh... Skeleton voodoo...
th_th: อ่า นั่นเป็นอีกเรื่องนึงเลยนะ เอ่อ...หมอผีSkeleton...

source: Those Okranite women, they're just screaming for a good time and a guy to treat 'em right... Me, I met a beautiful woman, wife of a priest she was, long golden hair and the sweetest smile.
th_th: พวกผู้หญิง Okranite พวกนั้น,พวกเธอเรียกร้องหาเวลาดีๆ และผู้ชายที่จะเลี้ยงดูพวกเธอ... ข้าได้พบสาวสวยผู้หนึ่ง เคยเป็นเมียพวกนักบวช ผมยาวสีทองและรอยยิ้มหวาน

source: I tell you, they got grace, those ladies. I taught her how to laugh, she taught me how to give a shit. But hell, nothing lasts in this world, I got caught with my pants down. Literally.
th_th: ข้าจะบอกอะไรให้ พวกเธอสง่างาม พวกหล่อนน่ะ ข้าสอนเธอให้หัวเราะ เธอสอนข้าให้รู้จักการใส่ใจ แต่ไม่มีอะไรยั่งยืน ข้าถูกจับได้ตอนอยู่กับนางในห้องนอน

source: /LAUGH/, and yet here he stands to tell his story. Go on, how'd you do it. How'd you get out of that one, eh?
th_th: /LAUGH/,ดูเจ้าสิ ยืนและเล่าเรื่องของตัวเอง ต่อเลย เจ้าทำได้อย่างไร เจ้าเอาตัวรอดมาได้อย่างไร ฮะ?

source: Jumped from a two storey window and managed to hitch a ride out of town clinging to the under belly of a merchant's gar. Had fifty paladins searching the place for me...
th_th: ข้ากระโดดลงมาจากชั้น 2 ออกมาจากเมืองโดยซ่อนอยู่ใต้ท้อง Garru ของพ่อค้า พวกพาลาดินกว่า 50 คนหาตัวข้าไปทั่ว

source: /LAUGH/, sounds like a HAIRY situation! Get it? HAIRY, /LAUGH/!
th_th: /LAUGH/,ฟังดูเป็นสถานการณ์ที่ยุ่งนะ เข้าใจมั้ย?ยุ่งเหมือนขน, /LAUGH/!

source: ... Gars don't have hair!... Jackass.
th_th: ...Gurru ไม่มีขนโว้ย!...ไอ้โง่

source: Wha? Sure they do!... Right? Yeah, they do!
th_th: เหรอ? มีสิ...ใช่มั้ย? ใช่สิ พวกมันมีขน!

source: Had to work under Captain Trepp last week...
th_th: ข้าทำงานให้ Captain Trepp อาทิตย์ที่แล้ว

source: Hoy, does she break your balls...
th_th: โอ้ โดนเธอเล่นงานเอารึเปล่าล่ะ...

source: Just be glad you came back in one piece. The woman's a walking cyclone for trouble...
th_th: ข้าดีใจที่เจ้ากลับมาครบ 32 นะ ยัยนั่นชอบแกว่งเท้าหาเสี้ยน
