Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Boast bar patron worlds end 2 shek.po
Languages: th_th

source: A new arrival I see? Come take a seat, have a drink, exchange stories. Me, I've crossed every border in the world and seen every city, you know? But the holy land folk, they're a tough crowd, that's for sure. Just about got to World's End in one piece last week...
th_th: มาไหม่ล่ะสิ? มา นั่งลงก่อน, ดื่มอะไรหน่อย, แลกเปลี่ยนเรื่องราว สำหรับข้า, ข้าผ่านมาทุกพรมแดนแล้วและได้เห็นเมืองทุกเมือง รู้มั้ย แต่ไอ้พวกในแดนศักสิทธิ์นั่น พวกนั้นแข็งแกร่ง แน่นอน ข้ากำลังจะไป Worlds endอย่างครบ32 เมื่ออาทิตย์ที่แล้ว

source: I'd been beaten and stripped right down to the kacks by bandits, right? And I'm starting to starve half to death, I'm not going to make it any longer so I've got no choice but to crawl up to the door of the holiest of holy towns themselves, Bad Teeth...
th_th: ข้าถูกพวกโจรรุมทำร้ายและขโมยของ และหิวจนแทบตาย ข้าไปต่อไม่ได้ ข้าไม่มีทางเลือกจึงต้องคลานไปที่เมืองที่ศักสิทธิ์ที่สุดในบรรดาเมืองศักสิทธิ์,Bad teeth...

source: Imagine that, a bare naked shek butt, blue as the day it was born, in a foreigner-hating holy nation town. They threw me in prison to rot. But hey, I finally got my fill of bread that night... Managed to make my escape during a commotion, who knows what the looneys would've done to me if I hadn't.
th_th: จินตนาการดูสิ,ข้าตัวเปล่าล่อนจ้อน ตัวซีดเหมือนเด็กเกิดไหม่ ในเมืองที่เกลียดพวกต่างถิ่นอย่างพวก holy nation พวกเขาโยนข้าเข้าไปในคุก แต่อย่างน้อยข้าก็มีขนมปังกินในคืนนั้น ข้าหนีออกมาในสถานการณ์ที่วุ่นวาย ไครจะรู้ว่าจะเกิดอะไรขึ้นถ้าข้าไม่หนี

source: Yep, I've visited death's door more times than I can count, but it's all worth it in the end...
th_th: ใช่,ข้าเกือบตายมานับครั้งไม่ถ้วน แต่สุดท้ายมันก็คุ้ม...

source: What doesn't kill you only makes you stronger... Safe travels, /OUTLANDER/.
th_th: อะไรที่ฆ่าเจ้าไม่ได้ มันทำให้เจ้าแข็งแกร่งขึ้น...โชคดีล่ะ,/OUTLANDER/.

source: Lucky escape. I'll drink to that.
th_th: โชคดีที่หนีมาได้ ข้าขอดื่มให้ท่าน

source: Are you done yakking yet?
th_th: เจ้าพูดจบรึยัง

source: Imagine that, a bare naked shek butt, blue as the day it was born, in a foreigner hating holy nation town...
th_th: จินนตนาการดูสิ ตัวเปล่าล่อนจ้อน ตัวซีดเหมือนเด็กทารก ในเมืงที่เกลียดคนต่างถิ่นอย่างHoly nation...

source: Yeah, great. Say, are you looking for work?
th_th: ก็ดีนะ เออ เจ้ากำลังหางานอยู่รึเปล่า?

source: I'd been beaten and stripped right down to the kacks by bandits, right? And I'm starting to die of hunger, I'm not going to make it any longer so I've got no choice but to crawl up to the door of the one and only town, Bad Teeth...
th_th: ข้าถูกพวกโจรรุมทำร้ายและขโมยของ และหิวจนแทบตาย ข้าไปต่อไม่ได้ ข้าไม่มีทางเลือกจึงต้องคลานไปที่เมืองที่ศักสิทธิ์ที่สุดในบรรดาเมืองศักสิทธิ์,Bad teeth...

source: Uhh, that's not what I asked...
th_th: เอ่อ...ข้าไม่ได้ถามเรื่องนั้น

source: Imagine that, a bare naked shek butt, blue as the day it was born, in a holy nation town. They threw me in prison to rot. But hey, I finally got my fill of bread that night... Managed to make my escape during a commotion, who knows what the looneys would've done to me if I hadn't.
th_th: จินตนาการดูสิ,ข้าตัวเปล่าล่อนจ้อน ตัวซีดเหมือนเด็กเกิดไหม่ ในเมืองที่เกลียดพวกต่างถิ่นอย่างพวก holy nation พวกเขาโยนข้าเข้าไปในคุก แต่อย่างน้อยข้าก็มีขนมปังกินในคืนนั้น ข้าหนีออกมาในสถานการณ์ที่วุ่นวาย ไครจะรู้ว่าจะเกิดอะไรขึ้นถ้าข้าไม่หนี

source: Are you finished?
th_th: พูดจบรึยัง?

source: Tell somebody who cares maybe...
th_th: ข้ากำลังเล่าให้คนที่สนใจฟัง

source: ... I don't care.
th_th: ...ข้าไม่สนใจ
