Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/bodyguard finished job.po
Languages: th_th

source: Okay job's over, see ya!
th_th: โอเคทำงานจบแล้วลาก่อน!

source: Job's finished, time to go.
th_th: งานเสร็จสิ้น ได้เวลาไปแล้ว

source: Don't worry, I'll finish up here first, but then I'm outta here!
th_th: ไม่ต้องห่วง, ข้าจะทำงานให้เสร็จ แต่หลังจากนั้นข้าจะไปแล้วนะ

source: After this fight of course!
th_th: แน่นอน! หลังจากต่อสู้ครั้งนี้จบ

source: Uhhh... guess you're not conscious... heh.
th_th: เอ่อ... ข้าคิดว่าเจ้าหมดสตินะ... เฮอะ

source: .... you can't hear me can you?
th_th: ...เจ้าไม่ได้ยินข้าใช่มั้ย?

source: Hello? Still alive? Hmmm.
th_th: ฮัลโหล? ยังอยู่รึเปล่า? หืมมมมมม

source: Guess I can't really leave you here all alone...
th_th: ดูเหมือนว่าข้าจะไม่สามารถทิ้งเจ้าไว้คนเดียวตรงนี้ได้จริงๆสินะ...

source: Fine, I'll guard you a little longer...
th_th: ก็ได้ ข้าจะคุ้มครองเจ้าต่ออีกสักพัก...

source: Ok, this one's a freebie.
th_th: โอเค, อันนี้ข้าแถมให้

source: Look at me, working for free now. Geez.
th_th: ดูข้าสิ, ทำงานฟรีซะแล้ว เห้อ

source: Can't believe I'm doing this...
th_th: ไม่อยากเชื่อว่าข้า จะทำอย่างนี้จริงๆ...

source: Damn... Workin' overtime.
th_th: เวรเอ้ย... ทำงานล่วงเวลา

source: Stupid client, gettin' /HIMSELF/ all beaten up and stuff...
th_th: เจ้าลูกค้าโง่, เอา/HIMSELF/ มาโดนกระทืบซะงั้น....

source: You owe me /MAN/.
th_th: เจ้้าติดหนี้ข้านะ/MAN/

source: I'm too old for this shit...
th_th: ข้าแก่เกินไป สำหรับเรื่องไร้สาระนี่...

source: Working for free now...
th_th: ข้าทำงานฟรีซะแล้ว

source: But I will anyway!
th_th: แต่ข้าจะทำก็แล้วกัน!

source: But that's life!
th_th: แต่นี่แหละชีวิต!

source: Life is tough, eh?
th_th: ชีวิตนี่ลำบากเนอะ,ฮะ?

source: I will though!
th_th: ข้าจะแข็งแกรงขึ้น!

source: Well.... good luck!
th_th: อ่า...โชคดีนะ!

source: Good luck...
th_th: โชคดี...

source: ....bye then!
th_th: ...ไปล่ะ

source: Oh well, see you later! ...I hope.
th_th: เอ่าล่ะ,แล้วเจอกัน!...หวังว่านะ

source: Damn...
th_th: เชี่ยละ...

source: ...can't leave it like this...
th_th: ...ข้าทิ้งมันไว้แบบนี้ไม่ได้

source: Wouldn't be right to leave you now...
th_th: มันไม่ถูกต้องที่จะทิ้งเจ้าไว้...

source: Wouldn't be honorable to just leave you in the dirt...
th_th: ข้าคงไร้เกียรติหากข้าทิ้งเจ้าไว้แบบนี้...

source: Ain't right...
th_th: มันไม่ถูก...

source: Awwww...
th_th: โอววว...

source: ....I can't just leave you like this...
th_th: ....ข้าทิงเจ้าไว้แบบนี้ไม่ได้...

source: ...can't just leave you in the dirt...
th_th: ...ข้้าทิ้งเจ้าไว้บนพื้นไม่ได้...

source: I feel a bit bad...
th_th: ข้ารู้สึกผิดนิดหน่อย

source: Damn that was a rough job.
th_th: เชี่ี่ย นั่นเป็นงานที่หนักมาก

source: Damn job nearly killed me this time. Time's up!
th_th: งานนี้เกือบจะฆ่าข้าซะแล้วสิ เอาละ หมดเวลาแล้ว

source: /QUICKLAUGH/! Looks like you got it rough too, eh?
th_th: /QUICKLAUGH/!ดูเหมือนเจ้าจะลำบากเหมือนกันนี่ ฮะ?

source: Looks like you got it rough too, eh?
th_th: ดูเหมือนเจ้าจะลำบากเหมือนกันนี่ ฮะ?

source: Took a few hits yourself didn't you? /QUICKLAUGH/.
th_th: เจ้าก็บาดเจ็บเหมือนกันนี่ใช่มั้ย?/QUICKLAUGH/.

source: I must get back to my duties, /FLATSKIN/...
th_th: ข้าต้องกลับไปทำหน้าที่ของข้าแล้ว, /FLATSKIN/...

source: My kingdom needs me, /FLATSKIN/. I must return to the Stone Golem...
th_th: อาณาจักรต้องการข้า, /FLATSKIN/ ข้าต้องกลับไปหา Stone Golem...

source: As soon as I've take care of this /MUTT/...
th_th: หลังจากข้าจัดการกับเจ้า/MUTT/นี่เสร็จ...

source: As fun as this is...
th_th: ก็สนุกพอกันแหละ....

source: Hm. Out cold?
th_th: ฮื่ม ตายเหรอ?

source: Hm... Knocked out...
th_th: ฮื่่ม...สลบ...

source: This has been fun, /FLATSKIN/!
th_th: นี่สนุกดีนะ, /FLATSKIN/!

source: Hm hm hm! We should do this again sometime, /FLATSKIN/...
th_th: อืม อืม อืม!เรานะจะทำแบบนี้อีกรอบนะ /FLATSKIN/...

source: But I must get back to my duties now...
th_th: แต่ข้าต้องกลับไปทำหน้าที่ของข้าแล้ว...

source: But my kingdom needs me now, I must return to the Stone Golem...
th_th: แต่อาณาจักรต้องการข้าแล้ว,ข้าต้องกลับไปหาStone Golem...

source: Should be getting back to base now...
th_th: ข้าต้้องกลับไปฐานข้าแล้ว...

source: As soon as I've dealt with this /MUTT/...
th_th: หลังจากข้าจัดการกับเจ้า/MUTT/นี่เสร็จ...

source: Stay safe, comrade.
th_th: โชคดีล่ะ,สหาย

source: See you again, /BROTHER//S/...
th_th: แล้วเจอกัน, /BROTHER//S/...

source: Farewell, /BROTHER//S/...
th_th: โชคดี, /BROTHER//S/...

source: Goodbye, friend/S/...
th_th: ลาก่อน, /BROTHER//S/...

source: I won't leave you like this, friend...
th_th: ข้าจะไม่ทิ้งเจ้าไว้แบบนี้ ,เพื่อน...
