Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bought from slavery sundemon.po
Languages: th_th

source: A scorchlander ain't built for servin'!
th_th: scorchlander ไม่ได้เกิดมาเพื่อรับใช้ใคร!

source: Screw this! I serve no one!
th_th: ไอ้เวรระยำ! ข้าจะไม่รับใช้ใครทั้งนั้น!

source: Freedom! /QUICKLAUGH/, I ain't serving no one!
th_th: อิสรภาพ /QUICKLAUGH/, ข้าจะไม่รับใช้ใครทั้งนั้น!

source: To the /SANDS/! It's free runnin' from here on out!
th_th: สู่/SANDS/! อิสระที่จะวิ่งจากนี้ออกไป!

source: If you liked it, you shoulda put a shackle on it! /QUICKLAUGH/!
th_th: ถ้าเจ้าชอบมัน เจ้าก็ควรล่ามโซ่มันนะ! /QUICKLAUGH/!

source: To the /SANDS/!
th_th: สู่/SANDS/!

source: You'll never catch me alive!
th_th: เจ้าจะไม่มีวันจับเป็นข้าได้!

source: Don't try comin' after me! I won't serve you!
th_th: อย่าพยายามตามล่าข้าเชียว! ข้าจะไม่รับใช้ใคร!

source: Screw you! I ain't servin' nobody!
th_th: ช่างหัวพวกเจ้าสิ! ข้าจะไม่รับใช้ใครทั้งนั้น!

source: I serve no-one!
th_th: ข้าไม่รับใช้ใครทั้งนั้น!

source: Run for it!
th_th: วิ่งเอาตัวรอด!

source: You'll never keep me down!
th_th: เจ้าไม่มีวันทำให้ข้าก้มหัวให้ได้!

source: You're freeing me?... Thanks!
th_th: เจ้าปลดปล่อยข้ารึ?... ขอบพระคุณ!

source: I'm free?.. I'm free!
th_th: ข้าเป็นอิสระแล้วรึ?...ข้าเป็นอิสระ!

source: Guess you're my new boss then, eh...
th_th: เดาว่าเจ้าจะเป็นนายคนใหม่ของข้าสินะ อ่า...

source: You freed me!... Thanks!
th_th: เจ้าปลดปล่อยข้า!... ขอบพระคุณ!

source: I'm.. free?.. I never wanna see another cage again...
th_th: ข้า...เป็นอิสระ?...ข้าจะไม่มีวันเจอลูกกรงอีกเป็นอันขาด...

source: You're the one who put me here! You can kiss my ass!
th_th: เจ้าเป็นหนึ่งในคนที่เอาข้ามาไว้ในนี้! จูบก้นข้านี่!

source: You're the /INSULT/ who put me here! Eat my dust!
th_th: เจ้ามัน/INSULT/ที่เอาข้ามาไว้ในนี้! แดกตีนข้านี่!

source: Who's this chump? Am I free?
th_th: เจ้าโง่นี่มันใคร? ข้าเป็นอิสระแล้ว?

source: I'm free?... Ahh, feels good to stretch my legs...
th_th: ข้าเป็นอิสระแล้ว?... อาา ยืดขาแล้วรู้สึกดีชะมัด...

source: I'm free...?
th_th: ข้าเป็นอิสระ...?
