Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bow before me!.po
Languages: th_th

source: You /BOY2/!.. /GROVEL/ before me!
th_th: เจ้า /BOY2/!.. /GROVEL/ ต่อหน้าข้า!

source: You, /DIRTY/ peasant /BOY2/! /GROVEL/ before your noble man!
th_th: เจ้า, /BOY2/!ชาวนา/DIRTY/ คุกเข่าลงต่อหน้าชายผู้สูงศักดิ์ของเจ้า!

source: Your dirtying my soil, peasant /BOY2/! Bow for my forgiveness!
th_th: ความอัปลักษณ์ของเจ้าทำลายวิสัยทัศน์ของข้า, /BOY2/!ชาวนา จงคุกเข่าเพื่อขอให้ข้าอภัยให้แก่เจ้าซะ!

source: You're spoiling my view with your ugliness, peasant /BOY2/! Bow for my forgiveness!
th_th: ความอัปลักษณ์ของเจ้าทำลายวิสัยทัศน์ของข้า, /BOY2/!ชาวนา จงคำนับเพื่อขอให้ข้าอภัยให้แก่เจ้าซะ!

source: You're spoiling my walk with your horrid stench, peasant /BOY2/! I am offended! /GROVEL/ for my forgiveness!
th_th: กลิ่นเหม็นของเจ้าทำให้ทางเดินข้าพังหมด, /BOY2/!ชาวนา ข้าชักโมโหแล้ว! /GROVEL/ขอโทษข้าซะ!

source: Ew! You reek of poor! Unnacceptable! /GROVEL/ before me, /BOY2/!
th_th: อี๋! กลิ่นเหม็นสาปของคนจน! รับไม่ได้! /GROVEL/ต่อหน้าข้า, /BOY2/!

source: Ohhoh! You stink of poor! How repugnant! /GROVEL/ before me, peasant /BOY2/!
th_th: โอ้โฮว! กลิ่นเหม็นสาปของคนจน! ข้าเกลียดมัน! /GROVEL/ต่อหน้าข้า, /BOY2/!ชาวนา

source: Mercy! (/GROVEL/)
th_th: เมตตาด้วย! (/GROVEL/)

source: Your grace! (/GROVEL/)
th_th: นายท่าน! (/GROVEL/)

source: I'm not worthy! (/GROVEL/)
th_th: ข้ามันไม่มีค่าพอ (/GROVEL/)

source: My Lord! (/GROVEL/)
th_th: ใต้เท้า! (/GROVEL/)

source: Have mercy! (/GROVEL/)
th_th: เมตตาด้วยเถิด! (/GROVEL/)

source: Did I tell you to speak? Your words are poor and ugly! Disgusting! Now, /GROVEL/ before me!
th_th: ข้าบอกให้เจ้าพูดหรอฮะ? คำพูดของเจ้ามันน่าสังเวชและน่าเกลียด! น่าขยะแขยง! เอาละ, /GROVEL/ต่อหน้าข้า!

source: Did I tell you to speak? Your voice is hideous! How vile!... Try again! /GROVEL/!
th_th: ข้าบอกให้เจ้าพูดหรอฮะ? เสียงของเจ้ามันน่าเกลียด! ช่างน่ารังเกียจจริงๆ!... /GROVEL/!อีกครั้ง

source: /YUCK/! Such a foul tone!.. Did I say you could speak? No! Now try that again, /BOY2/?!
th_th: /YUCK/! ช่างเป็นเสียงที่เหม็น!.. ข้าบอกให้พูดเเล้วหรอ? ไม่! ลองใหม่อีกครั้งเด๋วนี้, /BOY2/?!

source: /YUCK/! The peasant speaks!.. Did I say you could speak? No, I didn't! Try that again, /BOY2/?!
th_th: /YUCK/! ชาวนาพูด!.. ข้าบอกให้พูดแล้วหรอ? ก็ปล่าวนี่! ลองใหม่อีกครั้ง, /BOY2?!

source: Pathetic /PEASANT/!... Be gone, you're stinking up my space!
th_th: /PEASANT/!น่าสมเพช... ไปให้พ้น, เจ้ากำลังทำให้พื้นที่ของข้าเหม็น!

source: /DIRTY/ /PEASANT/!... Go!
th_th: /PEASANT/ /DIRTY/ !... ไปซะ!

source: /YUCK/! /DIRTY/ /BOY2/! Now, get away from me!
th_th: /YUCK/! /BOY2/ /DIRTY/! อย่าเข้ามาใกล้ข้านะ!

source: Worthless /BOY2/... That is all, I am finished with you now.
th_th: /BOY2/ไร้ค่า... อย่างที่ข้าพูด, ข้าหมดธุระกับเจ้าแล้ว.

source: Ew!
th_th: อี๋!

source: Now go!
th_th: ไปซะ!

source: Now be off with you!
th_th: ไสหัวออกไปเลย

source: Now get out of my way!
th_th: ออกไปให้พ้นทางข้า

source: Now move out of my way!
th_th: รีบไปให้พ้นทางข้า

source: Now move it!
th_th: รีบไปให้ไว

source: Okay. Be gone.
th_th: โอเค๊. ไปให้พ้น!

source: I bow to no-one.
th_th: ข้าไม่คำนับให้ใคร

source: I bow before nobody.
th_th: ข้าไม่คำนับ ไม่ว่าใครก็ตาม

source: I bow before no man.
th_th: ไม่มีใครที่ข้าจะโค้งคำนับให้

source: I will not /GROVEL/ like an animal.
th_th: ข้าจะไม่ /GROVEL/ เยี่ยงสัตว์.

source: No. Find another lackey.
th_th: ไม่. ไปหาขี้ข้าคนอื่นไป

source: No... I won't be treated that way.
th_th: ไม่... ข้าจะไม่ทำอย่างนั่นแน่

source: No. Find someone else to feed your ego.
th_th: ไม่. ไปหาคนอื่นเพื่อสนองอีโก้ของเจ้าซะ

source: ... Excuse ME?
th_th: ... ว่าไงนะ?

source: ... What did you say?!
th_th: ... เจ้าพูดว่าไงนะ?

source: ... What?!
th_th: ... อะไรนะ?!

source: ... You'd defy ME?
th_th: ... เจ้าท้าทายข้าหรอ?

source: ... You scorn me!
th_th: ... เจ้าดูถูกข้า!

source: Guards!!! Punish /HIM/! Cut /HIM/ down
th_th: ยาม!!! ลงโทษ/HIM/! จัดการ/HIM/ซะ

source: Guards! /SEIZE/ /HIM/!
th_th: ยาม! /SEIZE/ /HIM/!

source: I want /HIM/ punished!... Guards!!!
th_th: ข้าต้องการลงโทษ/HIM/!... ยาม!!!

source: Guards! Tear /HIM/ down! Make /HIM/ know REAL pain!!!
th_th: ยาม! ฉีก/HIM/ซะ! ทำให้/HIM/รู้ซึ้งถึงความเจ็บปวด!!!

source: (/PUNCH/ 'em in the chops)
th_th: (/PUNCH/พวกมันที่ปาก)

source: (/PUNCH/ 'em in the guts)
th_th: (/PUNCH/พวกมันที่ช่องท้อง)

source: (/PUNCH/ 'em in the eyes)
th_th: (/PUNCH/พวกมันที่ตา)

source: (/PUNCH/ 'em in the kisser)
th_th: (ซัดไม่เลี้ยง)

source: (/PUNCH/ 'em in the nose)
th_th: (/PUNCH/พวกมันที่จมูก)

source: (/PUNCH/ 'em in the neck)
th_th: (/PUNCH/พวกมันที่คอ)

source: (/PUNCH/ 'em in the throat)
th_th: (/PUNCH/พวกมันที่ลำคอ)

source: (Slap 'em round the face)
th_th: (ตบหน้าพวกมัน)

source: (Slap 'em round the chops)
th_th: (ตบปากพวกมัน)

source: (Boot 'em in the groin)
th_th: (เตะพวกมันที่ขาหนีบ)

source: (Kick 'em in the crotch)
th_th: (เตะไปที่เป้าพวกมัน)

source: AUUGHHHH!!!
th_th: อ๊าากกกกก!

source: *Gasp*!!!
th_th: *อ้าปากค้าง*!!!

source: AIIIIEEEEE!!!!
th_th: อะเอื้อออออ!!!!

source: WH-WHAT ARE YOU DOING?!
th_th: ทะ-ทำอะไรวะ?

source: H- HOW DARE YOU!
th_th: เจ้า กะ-กล้าดียังไง!

source: Y- YOU CAN'T DO THIS!
th_th: จะ-เจ้าทำเช่นนี้ไม่ได้!

source: Y- YOU CAN'T DO THIS TO ME!!!
th_th: จะ-เจ้าทำแบบนี้กับข้าไม่ได้นะ!!

source: WHAT IS THIS!!? Y- YOU SCOUNDREL!
th_th: นี่อะไรกันเนี่ย!!? อะ-ไอ้คนชั่วร้าย

source: Get /HIM/, kill /HIM/, BLEED /HIM/!!!
th_th: จับ/HIM/, ฆ่า/HIM/, หลั่งเลือด/HIM/!!!

source: I want /HIS/ HEAD!!!
th_th: ข้าต้องการหัว/HIS/!!!

source: Bring me /HIS/ HEAD!!!
th_th: นำหัว/HIS/มาให้ข้า!!!

source: Kill /HIM/! Don't let /HIM/ get away! Make /HIM/ bleeeeeeed!!!!
th_th: ฆ่า/HIM/! อย่าให้/HIM/หนีไปได้! ทำให้/HIM/หลั่งเลือดดดดด!!!!

source: I want /HIM/ DEAD!!!
th_th: ข้าต้องการให้/HIM/ตาย!!!

source: Guards!!! I want every limb on /HIS/ body BROKEN! BROKEN!!!
th_th: ยาม!!! ข้าต้องการให้แขนขาทุกส่วนบนร่างการ!/HIS/ แตกหัก! แตกสลายไปเลย!!!

source: Bleed /HIM/! Bleeeeeeed!!!
th_th: หลั่งเลือด/HIM/! หลั่งเลือดว้อยยยยยยย!!!

source: Guards!!! Show /HIM/ true pain! Break /HIS/ body, make him die!!! Die, die, DIE!!!
th_th: ยาม!!! แสดงให้/HIM/เห็นความเจ็บปวดที่แท้จริง! ทำลายร่างกายของ/HIS/ ทำให้มันตาย!!! ตาย, ตายแล้วตายอีก, แล้วก็ตายอีก!!!

source: DIE! DIE!!!!
th_th: ตาย! ตาย!!!!

source: How- how is this POSSIBLE!? You can't do this to ME!!!
th_th: ปะ...เป็นไปได้อย่างไร? เจ้าทำอย่างนี้กับข้าไม่ได้

source: H- how dare you!... HOW VERY DARE YOU!!!
th_th: จะ เจ้ากล้าดียังไง...เจ้ากล้าดียังไง!!!

source: Th- this can't be!? You... you /DIRTY/ scoundrel!!!
th_th: ปะ...เป็นไปได้อย่างไร? แก...ไอ้/DIRTY/

source: Wh- what is this?! You can't do this!!!
th_th: อะ...อะไรกัน?! เจ้าทำแบบนี้ไม่ได้!!!

source: You can't do this to me... ME! I'm your superior!!!
th_th: เจ้าทำแบบนี้กับข้าไม่ได้ ข้า...ข้าเป็นนายของเจ้า

source: You- your're /CRAZY/! You can't do that!!!
th_th: เจ้า...เจ้ามัน/CRAZY/! เจ้าทำอย้างนี้ไม่ได้
