Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bug master shek warrior 2.po
Languages: th_th

source: Curious. A /FLATSKIN/ in Last Stand? You've spine to travel bugmaster territory, I'll give you that.
th_th: โอ้ /FLATSKIN/ในLast Standเหรอ?เจ้ากล้ามากที่เข้ามาในเขตของBug master ข้านับถือเจ้าเลย

source: Can you tell me about the bugmaster?
th_th: เจ้าบอกอะไรข้าเกี่ยวกับBug masterได้บ้าง?

source: A coward! The bugmaster hides behind his bugs... BUGS. The lowliest of beasts. If I was to have an army of beasts it would be one of mighty leviathyns. Not that I'd need an army of beasts. A true warrior needs only his fists or his blades.
th_th: ไอ้คนขลาด! Bugmaster เอาแต่หลบอยู่หลังแมลงของมัน...ฝูงแมลง สัตว์ชั้นต่ำที่สุด ถ้าข้าสามารถมีกองทัพสัตว์ประหลาดใต้บังคับบัญชาได้ แน่นอนว่าต้องเป็น Leviathyn ที่แข็งแกร่งที่สุดแน่นอน ไม่ได้หมายความว่าข้าต้องการกองทัพสัตว์ประหลาดหรอกนะ เพราะการเป็นนักรบที่แท้จริงนั้นต้องการเพียงแค่หมัดและดาบของตนเท่านั้นแหละ

source: How did he get such a huge army of bugs?
th_th: เขาไปเอากองทัพแมลงจำนวนมหาศษลนั่นมาจากไหนนะ?

source: Science! You outsiders, so obsessed and distracted by gimmicks, this a perfect example of your precious science gone too far. Controlling the minds of insects... how about working on your combat skills instead. His bugs won't protect him forever... My bones grow old, soon it will be my turn to hunt down the bugmaster and it will be my pleasure to pull his heart from his fat brained ribcage...
th_th: วิทยาศาสตร์! พวก outsider เช่นเจ้าลุ่มหลงและถูกหันเหความสนใจโดยเล่ห์กล นี่เป็นตัวอย่างที่สมบูรณ์แบบว่าวิทยาศาสตร์ที่พวกเจ้าคลั่งไคล้นักหนามันมากเกินไปแล้ว การควบคุมความนึกคิดของพวกแมลง...ลองมาใส่ใจฝึกฝนทักษะการต่อสู้ของเจ้าจะดีกว่า แมลงของเขาปกป้องเขาไปตลอดไม่ได้หรอก...อายุข้าเริ่มมากขึ้นเรื่อย ๆ อีกไม่นานย่อมถึงคราวของข้าที่จะตามล่า Bugmaster และข้าจะเสพสุขในการควักหัวใจของมันออกมาให้ได้...

source: Your turn?
th_th: ถึงคราวของเจ้าหรือ?

source: For a glorious death. The Shek elders come to Last Stand in preparation for their final battle. A true warrior wishes to die swords blazing, not sucking boiled gruel through a straw from their bedsit. The bugmaster has so far proven himself worthy of granting the elders their deaths in battle. The coward only hopes that he will be a match for my own sword though.
th_th: ที่จะได้มรณาอย่างมีเกียรติ ผู้สูงวัยชาว Shek เตรียมพร้อมที่จะยืนหยัดในศึกสุดท้ายของพวกเขา นักรบที่แท้จริงต้องการตายภายใต้คมดาบฟาดฟัน มากกว่าที่จะนอนดูดน้ำจากหลอดบนเตียงคนเจ็บป่วย Bugmaster พิสูจน์ตนให้เห็นแล้วว่าเขาเหมาะจะเป็นผู้มอบมรณาให้เหล่าผู้อาวุโสได้ เจ้าคนขลาดนั่นควรหวังให้มันสามารถต่อกรกับดาบข้าได้ก็แล้วกัน

source: I see. Thanks for the info.
th_th: ข้าเข้าใจ. ขอบคุณสำหรับข้อมูล.

source: Way to stereotype humanity...
th_th: เป็นวิธีในการสร้างทัศนคติเกี่นวกับมนุษยชาติที่...

source: Hopelessness. The flatskins, the stick men, they lack the physical prowess of a Shek Warrior, but through blood and sweat strength is still within their reach. Alas, no, their lazy minds are too weak to endure such training. Brains are worthless in these lands, they count for nothing.
th_th: สิ้นหวังแล้ว ทั้ง flatskin หรือพวก stick men พวกเขาไม่มีสมรรถภาพด้านร่างกายที่จะเทียบนักรบชาว Shek ได้ หากพวกเขามีความพยายามอาบเหงื่อต่างน้ำก็สามารถแข็งแกร่งได้เช่นกัน แต่เพราะจิตใจพวกเขาเกียจคร้านและอ่อนแอเกินไปที่จนทนรับการฝึกหนักได้ บนแผ่นดินนี้ สมองและสติปัญญาไร้ค่ามาก มันไม่มีประโยชน์อะไรเลย

source: The arrogance of a Shek warrior is astounding.
th_th: ความยโสโอหังของนักรบชาว Shek นี่น่าอัศจรรย์ใจแท้

source: Whatever...
th_th: ช่างมันเหอะ...

source: Agreed. Lazy, the lot of them.
th_th: ข้าเห็นด้วย ทั้งที่เป็นแค่พวกสันหลังยาวแท้ ๆ

source: Good luck with that.
th_th: ขอให้โชคดีแล้วกันนะ

source: I see... Thanks for the info, I guess.
th_th: อ้อ...ขอบใจสำหรับข้อมูลแล้วกันนะ

source: Departure. To the other side. The Shek elders come here in preparation for their final battle. A true warrior wishes to die swords blazing, not sucking boiled gruel through a straw from their bedsit. The bugmaster has so far proven himself worthy of granting the elders their deaths in battle. Whether the coward will be a match for my own sword, we'll see.
th_th: มรณา การไปสู่อีกฝั่งหนึ่ง ผู้สูงวัยชาว Shek เตรียมพร้อมที่จะยืนหยัดในศึกสุดท้ายของพวกเขา นักรบที่แท้จริงต้องการตายภายใต้คมดาบฟาดฟัน มากกว่าที่จะนอนดูดน้ำจากหลอดบนเตียงคนเจ็บป่วย Bugmaster พิสูจน์ตนให้เห็นแล้วว่าเขาเหมาะจะเป็นผู้มอบมรณาให้เหล่าผู้อาวุโสได้ เจ้าคนขลาดนั่นสามารถต่อกรกับดาบข้าได้หรือไม่ เดี๋ยวเราก็ได้รู้กัน

source: Er... thanks I guess.
th_th: เอ่อ...ขอบคุณแล้วกันนะ

source: An observation. Not a compliment.
th_th: นั่นเป็นข้อสังเกต ไม่ใช่คำชื่นชม

source: I don't have time for this, I'm leaving.
th_th: ข้้าไม่มีเวลาสำหรับเรื่องนี้ ข้าไปล่ะ

source: ... (Walk away)
th_th: ... (เดินจากไป)

source: Good to see you, /FLATSKIN/.
th_th: ยินดีที่ได้พบเจ้านะ /FLATSKIN/

source: That cannot be...!
th_th: นั่นไม่ควรเป็นแบบนั้น...!

source: But it was I who was supposed to kill the bugmaster!
th_th: แต่ข้าคือคนที่ควรจะได้เป็นผู้สังหาร bugmaster นะ!

source: Impossible!
th_th: เป็นไปไม่ได้!
