Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bug master bounty hunter 2.po
Languages: th_th

source: Here for the bugmaster's head too, are we? Guess you're either a person with nothing to lose or a person with everything to gain...
th_th: มาล่าหัวของ Bugmaster เหมือนกันรึ? เดาว่าถ้าเจ้าไม่ใช่คนที่ไม่มีอะไรจะเสียอีกแล้วก็คงเป็นคนที่มีเหลือกินเหลือใช้เกินไปสินะ...

source: What about you?
th_th: แล้วเจ้าล่ะ?

source: I'm running away from one familiar enemy only to make another one from the unknown. But at least the unfamiliar enemy seems a whole lot less frightening, you can't fear what you don't know after all... right?
th_th: ข้าหนีจากศัตรูที่คุ้นเคยคนหนึ่งเพื่อสร้างศัตรูที่ข้าไม่รู้จักอีกคนหนึ่ง อย่างน้อยศัตรูที่ข้าไม่คุ้นก็ไม่น่ากลัวเท่าไหร่นัก เพราะเรามักไม่กลัวสิ่งที่เราไม่รู้จัก...ใช่ไหมล่ะ?

source: Anyway, ever heard of the Blackshifters? I owe them a debt, and the bug master's treasure is my last hope right now. Because my other options, well.. they don't look so good right now...
th_th: เอาเถอะ เจ้าเคยได้ยินชื่อ Blackshifters ไหม? ข้าติดหนี้พวกมันก้อนหนึ่ง และตอนนี้สมบัติของ Bugmaster คือความหวังสุดท้ายของข้า เพราะว่าทางเลือกอื่นของข้ามัน...ดูไม่ค่อยเข้าท่าสักเท่าไหร่อ่ะนะ...

source: I've only heard stories, but not a one of 'em is pretty. Best not to think about the rumours, for your own sanity. There's only one thing I care about: The bugmaster is said to possess the ultimate treasure, the biggest pot of loot in all the land...
th_th: ข้าเคยได้ยินเรื่องเล่า บางเรื่องไม่น่าโสภาเลย อย่าใส่ใจข่าวลือให้มาก ไม่อย่างนั้นเจ้าจะเป็นบ้าไปเสียก่อน สิ่งเดียวที่ข้าสนใจคือเรื่องที่ว่า Bugmaster มีสมบัติมหาศาล เป็นขุมทองขุมใหญ่เลยล่ะ...

source: For my survival, I need that treasure.
th_th: เพื่อให้ข้ารอดตาย ข้าต้องการสมบัติเหล่านั้น

source: So you choose to be bug food...? Smart.
th_th: เจ้าเลยเลือกที่จะมาเป็นอาหารของแมลง...? ฉลาดจริง

source: Then I guess you haven't heard of the Blackshifters. Desperate times call for desperate measures, /OUTLANDER/...
th_th: ถ้าเจ้าว่าแบบนั้นได้ แสดงว่าเจ้าไม่รู้จักพวก Blackshifter เวลาสุนัขจนตรอกมันไม่เลือกวิธีการหรอกนะ /OUTLANDER/

source: Neither. I'm here for sport...
th_th: ไม่จำเป็น ข้ามาเพื่อเล่นสนุกน่ะ...

source: Sport? You're crazy! Do you know how many have died trying to take on the bugmaster? The guy's superhuman. He's got an army of BUGS. Some say he's the chosen one, chosen to cleanse the world of festering vermin... of humans...
th_th: เล่นสนุก? เจ้ามันบ้าไปแล้ว! เจ้ารู้ไหมว่ามีคนที่พยายามล่า Bugmaster ตายไปกี่คนแล้ว? เจ้า Bugmaster มันคือปีศาจดี ๆ นี่เอง เขามีกองทัพแมลงในการควบคุม บางคนเรียกเขาว่าผู้ถูกเลือก ที่จะมาชำระล้างโลกใบนี้จากพวกเน่าหนอน...พวกมนุษย์...

source: HIM the chosen one? You're looking at the chosen one right now.
th_th: เขาน่ะหรือคือผู้ถูกเลือก? เจ้ากำลังมองผู้ถูกเลือกที่ยืนอยู่ตรงหน้านี่ไง

source: Ugh! Everyone's a goddamn chosen one! You know I think you're the fourth chosen one I've met this week. Hm, funny that...
th_th: อ้าก! ทุกคนก็เป็นผู้ถูกเลือกเวร ๆ ทั้งนั้นแหละ! ข้าได้พบคนที่คิดว่าตัวเองเป็นผู้ถูกเลือก เจ้าเป็นคนที่ 14 แล้วเฉพาะในสัปดาห์นี้นะ ฮึ่ม น่าขำนัก...

source: Arrogant goddamn adventurers...
th_th: พวกนักผจญภัยจอมยโสโอหัง...

source: ... Are you done nagging yet?
th_th: ...เจ้าบ่นจบหรือยัง?

source: Well, good luck with your 'sport' anyway, /OUTLANDER/. Hopefully you'll distract the bugmaster long enough for me to survive in one piece...
th_th: อืม ข้าให้เจ้าโชคดีในการ 'เล่นสนุก' ของเจ้าแล้วกัน /OUTLANDER/ หวังว่าเจ้าจะดึงดูดความสนใจจาก Bugmaster ได้นานพอให้ข้ารอดตายแล้วกัน...

source: Tch, crazy adventurers...
th_th: ชิ พวกนักผจญภัยจอมเพี้ยน...

source: No time for talking, sorry.
th_th: ไม่มีเวลาพูดมากแล้ว ขอโทษด้วยนะ
