Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bug master bounty hunter.po
Languages: th_th

source: Some folks say I'm suicidal for coming here to the crater. Me, I say I'm a gambler. So far a whole lotta ladies and fellas have tried and failed against the bugmaster, a hell load in fact... So, simple probability says the bugmaster's luck is soon to run out. An' I like those odds.
th_th: บางคนบอกว่าข้าช่างรนหาที่ตายที่มาที่ปล่องภูเขาไฟนี่ ข้าขอเรียกตัวเองว่านักพนันดีกว่า เท่าที่ทราบมีคนมากมายอันที่จริงคือนับจำนวนไม่ถ้วนแล้วที่พยายามมาล่า bugmaster แล้วล้มเหลว...ดังนั้นความเป็นไปได้ทางสถิติบอกข้าว่า Bugmaster กำลังจะดวงตกในไม่ช้านี้ ข้าชอบความเป็นไปได้นี้นะ

source: What do you know of the bugmaster?
th_th: เจ้ารู้อะไรเกี่ยวกับ Bugmaster บ้าง?

source: Main thing I know is that he's got a fat bounty on his head. Second thing I know is he's got a whole lot of loot stashed in his tower. Every night I dream of all that treasure he's got hidden away for himself... Pearls, ancient relics, mountains of coins you could swim in!... And every night I promise myself that my luck is gonna change, an' it'll be my turn to be the guy with all the Cats.
th_th: เรื่องหลักที่ข้ารู้คือเขามีค่าหัวมหาศาล อย่างที่สองคือข้ารู้ว่าเขามีสมบัติมากมายซ่อนอยู่ในหอคอยของเขา ข้าเฝ้าฝันถึงสมบัติที่เขาแอบซ่อนไว้น่นทุกคืนเลย...ทั้งไข่มุก เครื่องรางโบราณ ภูเขาเหรียญที่เจ้าแทบจะลงไปแหวกว่ายได้! และทุกคืนข้าเฝ้าสัญญากับตัวเองว่าวันหนึ่งโชคจะเข้าข้างข้า และวันหนึ่งข้าจะเป็นคนที่ได้ครอบครอง Cats ทั้งหมดนั่น

source: That still doesn't explain to me what the bugmaster is...
th_th: นั่นไม่ได้อธิบายให้ข้ารู้ว่า Bugmaster คืออะไรเลยอ่ะ...

source: What he is, eh? Well, me, I heard he's a bug romancer. Yeah, the guy's obsessed with insects. Story goes that he was in an accident as a kid, left for dead, but he got revived and nursed back to life by bugs. Since that day he's had this mental connection with them, they revere him as their king. Crazy stuff you'd only believe if you'd seen the destruction he's capable of with your own eyes.
th_th: เขาเป็นอะไรอย่างนั้นเหรอ? อืม ข้าได้ยินมาว่าเขาเป็นพวกรักแมลงนะ พวกคนที่คลั่งไคล้แมลงน่ะ เรื่องเล่าว่าเขาเคยประสบอุบัติเหตุตอนยังเด็ก เกือบตายแต่พวกแมลงมาช่วยและรักษาเขาจนหาย ตั้งแต่วันนั้นเขาก็สามารถเชื่อมต่อทางจิตกับพวกแมลงได้ พวกแมลงยึดถือว่าเขาเป็นราชาของพวกมัน เป็นเรื่องบ้าบอที่เจ้าจะเชื่อก็ต่อเมื่อเจ้าได้เห็นกับตาว่าเขาทำอะไรได้บ้างน่ะ

source: Bug king, eh? Well, his head is mine.
th_th: ราชันย์แมลงสินะ? อืม หัวของเขาต้องเป็นของข้า

source: You'll have to beat me to it first, /OUTLANDER/, I'm gettin' that treasure!
th_th: เจ้าต้องข้ามศพข้าไปก่อนล่ะ /OUTLANDER/ ข้าต้องการสมบัติพวกนั้น

source: That sounds made up
th_th: นั่ั่นฟังดูเหมือนเรื่องกุขึ้นเลย

source: It's not made up! It's my THEORY. How else is a guy gonna control bugs?
th_th: ไม่ได้กุขึ้นนะเฮ้ย! มันคือทฤษฎีที่ข้าคิดขึ้น ไม่อย่างนั้นแล้วเขาจะควบคุมแมลงได้ยังไงล่ะ?

source: So you did make it up then.
th_th: เจ้ากุขึ้นมาเองนี่หว่า

source: Well, technically yeah, if you put it like that...
th_th: เอ่อ อันที่จริง ก็ใช่แหละ ถ้าเจ้าว่าแบบนั้นล่ะก็นะ...

source: Why risk your life against the bugmaster?
th_th: ทำไมต้องเอาชีวิตไปเสี่ยงกับ Bugmaster ด้วย?

source: I was born during the Red Rebellion, an orphan of war. Poverty is my life's curse. Escaping it is my dream. And the bug master's treasure is my one way ticket to that dream.
th_th: ข้าเกิดในช่วงการปฏฺิวัติสีเลือดน่ะ เป็นกำพร้าจากสงคราม ข้าฝันเสมอว่าจะหลบหนีจากความยากจนที่เป็นดั่งคำสาปในชีวิตข้าได้ และสมบัตืของ Bugmaster ก็เป็นตั๋วที่จะนำข้าไปสู่ความฝันนั้น

source: Is having your guts sucked out by bugs part of that dream too?
th_th: แล้วการที่ถูกพวกแมลงคว้านตับไตไส้พุงเจ้าออกไปเป็นส่วนหนึ่งของความฝันนั้นด้วยหรือเปล่า?

source: You just had to go piss on my parade didn't you, eh, /OUTLANDER/? We got a rule around here: No talk of gut sucking, it's hard enough pluckin' up the courage to take on the bug master. Some things are best pushed to the back of the mind...
th_th: เจ้าต้องขัดคอข้าให้ได้เลยหรือไง /OUTLANDER/? เรามีกฎอยู่นะ ห้ามพูดเรื่องคว้านตับไตไส้พุงที่นี่ มันยากมากที่จะสร้างขวัญกำลังใจเพื่อไปสู้กับ Bugmaster อยู่แล้ว บางอย่างควรถูกเก็บไว้แค่ในใจก็พอ...

source: Well, good luck with that...
th_th: อืม ขอให้โชคดีแล้วกัน...

source: I'm betting you suck at gambling.
th_th: ข้าว่าเจ้าไม่มีฝีมือด้านการพนันแน่เลยว่ะ

source: If I didn't suck at gambling, I wouldn't be in this shit hole right now. But, hey, probability says my luck's about to change.
th_th: ถ้าข้าไม่ห่วยด้านการพนัน ตอนนี้ข้าคงไม่ต้องมาอยู่ในหลุมเวรนี่ แต่ความน่าจะเป็นบอกว่าโชคกำลังจะเข้าข้างข้าล่ะ

source: And I say you're deluded. So long.
th_th: และข้าขอย้ำว่าเจ้าหลอนไปเอง ลาก่อนนะ
