Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bug master bounty hunter 3.po
Languages: th_th

source: Nnnngh...
th_th: อึกกก...

source: Is there something wrong?
th_th: มีอะไรผิดปกติหรือ?

source: Something wrong? How about EVERYTHING! Between you an' me, /OUTLANDER/, I'm starting to freak the hell out over here. I mean, what did I get myself into? Takin' the bugmaster's bounty seemed like a good idea after a few grogs but now I'm sobering up n' the grog eyes have gone away it's just lookin' like suicide...
th_th: อะไรผิดปกติเรอะ? ทุกอย่างเลยล่ะ! ฟังแล้วเหยียบไว้นะ /OUTLANDER/ ข้าเริ่มจะสติแตกเวลาที่อยู่ที่นี่แล้วนะ เวรเอ๋ย ข้าทำอะไรลงไปเนี่ย? หลังจากที่ก๊งเหล้า grog เข้าไปหลายเป๊ก ข้าคิดว่าการมาล่า Bugmaster เป็นความคิดที่ดี แต่พอตอนนี้ข้าสร่างเมาแล้วข้ากลับคิดว่านี่มันการฆ่าตัวตายชัด ๆ เลย...

source: Heard much about the bugmaster?
th_th: เจ้าได้ยินเรื่องอะไรเกี่ยวกับ Bugmaster มาบ้าง?

source: What haven't I heard more like! How about the one where he's a reincarnated bug god, reborn in this land to bring a new era of bugs, to take over the world. Oh that's gotta be my favourite one...
th_th: เจ้าหมายถึงว่าข้าไม่ได้ยินเรื่องอะไรบ้างมากกว่า! เอาเรื่องที่ว่าเขาเป็นเทพแมลงกลับชาติมาเกิดใหม่ เพื่อจะนำโลกเข้าสูุ่ยุคแมลงครองโลกมั้ย นั่นเป็นเรื่องโปรดของข้าเลยนะ...

source: You know what, let's just not talk anymore actually. I prefer deathly silence...
th_th: เจ้ารู้อะไรมั้ย ข้าว่าเราอย่าคุยกันเลยดีกว่า ข้าอยากอยู่เงียบ ๆ...

source: Oh god save us Lord Okran, we're all doomed...
th_th: Lord Okran ทรงปกป้องพวกเราด้วย พวกเราซวยแล้ว...

source: Grog or no grog, you're a coward. Stick by your decision.
th_th: ไม่ว่าเจ้าจะดื่ม grog หรือไม่ เจ้าก็ยังเป็นไอ้ขี้ขลาดอยู่ดี เชื่อมั่นในการตัดสินใจของตัวเองหน่อย

source: Well, you sure told me...
th_th: เหอะ เจ้าก็พูดได้สิ...

source: Then go home. Simple.
th_th: ไม่อย่างนั้นก็กลับบ้านไป ง่ายจะตาย

source: Well, I was hoping for a pep talk actually. Or a magic bug squasher plank... Guess there's no chance of that. Maybe I'll split when no-one's looking...
th_th: เอ่อ อันที่จริงแล้วข้าอยากได้คำพูดปลุกใจนะ หรือว่าไม้ตีแมลงเวทย์มนตร์อะไรซักอย่าง...คงไม่มีสินะ บางทีถ้าไม่มีใครสนใจ ข้าน่าจะรีบปลีกตัวหนีไป...

source: I see. Good luck with that.
th_th: ข้าเข้าใจ ขอให้เจ้าโชคดีล่ะ

source: You heard how many people go into that crater, never to come back out?... Between you an' me, /OUTLANDER/, I'm starting to freak the hell out over here. I mean, what did I get myself into? Takin' the bugmaster's bounty seemed like a good idea after a few grogs but now I'm sobering up n' the grog eyes have gone away it's just lookin' like suicide.
th_th: เจ้ารู้ไหมว่ามีคนเข้าไปในปล่องภูเขาไฟนั่นแล้วไม่ได้กลับออกมาอีกเป็นจำนวนเท่าไหร่?... ฟังแล้วเหยียบไว้นะ /OUTLANDER/ ข้าเริ่มจะสติแตกเวลาที่อยู่ที่นี่แล้วนะ เวรเอ๋ย ข้าทำอะไรลงไปเนี่ย? หลังจากที่ก๊งเหล้า grog เข้าไปหลายเป๊ก ข้าคิดว่าการมาล่า Bugmaster เป็นความคิดที่ดี แต่พอตอนนี้ข้าสร่างเมาแล้วข้ากลับคิดว่านี่มันการฆ่าตัวตายชัด ๆ เลย

source: I'll leave you to... whatever it is you're doing.
th_th: ข้าจะปล่อยให้เจ้า...ทำอะไรก็ตามที่เจ้ากำลังทำแล้วกันนะ
