Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bug master shek warrior 1.po
Languages: th_th

source: Sit. Celebrate with me, /FLATSKIN/. It's not often you'll be given the honor of keeping company with a Shek Warrior...
th_th: นั่งลง. ฉลองกับข้า /FLATSKIN/ มีไม่กี่คนหรอกที่จะได้รับเกียรติในฐานะสหายของนักรบ Shek...

source: Sure, so long as you're buying the drinks...
th_th: แน่นอน, ตราบใดที่เจ้าจ่ายค่าเหล่าอะน่ะ...

source: Tomorrow will be a glorious day for me, /FLATSKIN/. Tomorrow I take my final battle with the bugmaster. Either I earn my victory on the battlefield, or I earn my grand passage to the otherside. This is the moment every true warrior bleeds for...
th_th: พรุ่งนี้จะเป็นวันที่รุ่งโรจน์สำหรับข้า /FLATSKIN/ พรุ่งนี้ข้าจะมีการต่อสู้ครั้งสุดท้ายกับ bugmaster. ไม่ว่าข้าจะได้รับชัยชนะในสนามรบ หรือข้าได้รับเส้นทางอันยิ่งใหญ่ของข้าไปยังอีกฝากหนึ่ง นี่คือช่วงเวลาที่นักรบที่แท้จริงที่ทุกคนต้องหลั่งเลือด...

source: Join me. We can fight the bugmaster together...
th_th: เข้าร่วมกับข้า. พวกเราสามารถต่อสู้กับพวก bugmaster ได้ด้วยกัน ...

source: You mistake me, /FLATSKIN/. I'm here to drink, not to find comrades... I fight alone, as a Kralian. I'll die as Kral did before me, outnumbered hundredfold as a lone warrior on the battlefield...
th_th: เจ้าเข้าใจข้าผิด, /FLATSKIN/. ข้ามาที่นี่เพื่อดื่ม ไม่ได้มาตามหามิตรภาพ... ข้าสู้คนเดียว, ในฐานะ Kralian. ข้าจะตายเหมือนที่ Kral เคยทำมาก่อนยังไงละ, เป็นรองถึงหนึ่งต่อร้อยในฐานะนักรบผู้โดดเดี่ยวในสนามรบ...

source: Not if I kill the bugmaster first. You'll have to beat me to it...
th_th: ไม่หรอก ถ้าข้าฆ่า bugmaster ตายก่อน. เจ้าจะต้องเอาชนะข้าให้ได้ ...

source: Amusing, /FLATSKIN/! Only a Shek Warrior has the skill to defeat the bugmaster...
th_th: มุขฮาไปอีก, /FLATSKIN/! มีเพียงนักรบ Shek เท่านั้นที่มีความสามารถพอที่จะเอาชนะ Bugmaster ได้...

source: Humorous. But I'm finished sharing stories. Leave me to my thoughts now, /FLATSKIN/.
th_th: น่าขำจริง ๆ. แต่ข้าแบ่งปันเรื่องราวเสร็จแล้ว. ทิ้งข้าไว้ในความคิดของข้าซะตอนนี้ /FLATSKIN/.

source: Care to explain your suicide mission to me?
th_th: สนใจที่จะอธิบายภารกิจการฆ่าตัวตายของเจ้าให้ข้าฟังไหม?

source: What is there to explain, /FLATSKIN/? My battle skills are my pride but they are also my curse... I'm undefeatable. And I grow old. No Shek Warrior wants to die a dull death of aging, we want to die a death of fearlessness and glory. I only hope that the bugmaster is worthy enough of my blade to give me my honourable death.
th_th: มีอะไรที่ต้องอธิบายอีกหรอ? /FLATSKIN/ ทักษะการต่อสู้ของข้าคือความภาคภูมิใจของข้า แต่ก็ยังเป็นคำสาปของข้า... ข้านั้นไม่เคยแพ้ใคร. และข้าก็แก่แล้วด้วย. ไม่มีนักรบ Shek คนไหนต้องการที่จะตายจากความชราที่น่าเบื่อ, พวกเราต้องการที่จะตายอย่างสง่าราศีและปราศจากความกลัว ข้าหวังว่า bugmaster จะมีค่าพอกับคมดาบของข้า ที่จะทำให้ข้าได้ตายอย่างสมเกียรติ.

source: ... So your aim is to be a loser?
th_th: ...งั้น เป้าหมายของเจ้าก็คือการแพ้งั้นสิ?

source: My aim is to face death with courage and blade in hand. Of course I could never expect one like you to understand the wisdom of the warrior.
th_th: เป้าหมายของข้าคือการเผชิญหน้ากับความตายอย่างกล้าหาญ โดยถือดาบอยู่ในมือ. แน่นอนว่าข้าไม่สามารถคาดหวังได้ว่าจะมีใครเช่นเจ้า ที่จะเข้าใจในอินทรีย์แห่งนักรบ

source: Sounds like loser talk to me...
th_th: ฟังดูเหมือนคนขี้แพ้คุยกับข้าเลย...

source: Raghh! I'm finished talking with you, /FLATSKIN/!
th_th: อ๊าาาา! ข้าพูดกับเจ้าเสร้จแล้ว, ไอ้/FLATSKIN/!

source: Leave me, before I tear you a new mouth, since you enjoy flapping it so much...
th_th: ออกไปให้พ้น, ก่อนที่ข้าจะฉีกปากของเจ้า, เพราะเห็นว่าเจ้าสนุกกับการกระพือมันมาก...

source: You're right, I'll never understand the Shek mindset. I've too much sanity.
th_th: เจ้าพูดถูก, ข้าไม่เคยเข้าใจในความคิดของพวก Shek เลย. ข้ามันดีเกินไป.

source: Irritation... Now I remember why I do not drink with the hornless.
th_th: (โวยวาย..) ตอนนี้ข้าจำได้แล้วว่าทำไมข้าถึงไม่ควรดื่มกับพวกที่ไม่มีเขา.

source: I'm finished sharing stories. Leave me to my thoughts now, /FLATSKIN/.
th_th: ข้าแบ่งปันเรื่องราวเสร็จแล้ว. ทิ้งข้าไว้ในความคิดของข้าซะตอนนี้ /FLATSKIN/.

source: Well, I hope you find your honourable death. Good luck.
th_th: ข้าหวังว่าเจ้าจะพบกับความตายอันทรงเกียติของเจ้า. ขอให้โชคดี.

source: Hrm. Gratitude, /FLATSKIN/.
th_th: อ่าฮะ. ซาบซึ้งใจจริง ๆ /FLATSKIN/.

source: Honourable death? How about you join me for victory instead?
th_th: ความตายอันทรงเกียติหรอ? ทำไมเจ้าไม่เข้าร่วมกับข้าในการต่อสู้เพื่อชัยชนะนั่นละ?

source: Sounds... fun. Good luck with that.
th_th: ฟังดู...น่าสนุกเนอะ ขอให้โชคดีล่ะ.

source: What's the occasion?
th_th: เนื่องในโอกาศอะไร?

source: Honor? Drinking with an arrogant old Shek sounds more like torture to me...
th_th: เป็นเกียรติ? การดื่มกับ Shek แก่ผู้ที่หยิ่งผยอง ฟังดูเหมือนทรมานข้าเลย...

source: Hrm hrm! I do like a /FLATSKIN/ with bite. I should put you in your place but a warrior must save their energy for battle, not waste it swatting flies...
th_th: อืม อืม!ข้าชอบ/FLATSKIN/ที่กล้าโต้กลับ ข้าควรสั่งสอนเจ้า แต่นักรบต้องเก็บแรงไว้สู้รบ ไม่ใช่เอาไว้ตบแมลงวัน

source: Hrm. Amusing /FLATSKIN/...
th_th: อืม เจ้า/FLATSKIN/นี่ตลกดีนะ

source: I prefer my own company, thanks.
th_th: ข้าอยู่คนเดียวได้ ขอบใจ

source: Hmph. A simple /FLATSKIN/ cannot appreciate greatness when /HE/ sees it...
th_th: ฮึม เจ้า/FLATSKIN/ไม่ยอมรับความยิ่งใหญ่เมื่อ/HE/เห็นมัน

source: The Bugmaster!?
th_th: Bug master เหรอ!?

source: No! NO! The victory was to be mine, you stole it from me!
th_th: ไม่่ ไม่ ชัยชนะนี้เป็นของข้า เจ้าขโมยมันไป

source: With the Bugmaster gone, I must find a new enemy worthy of my passage to the other side...
th_th: เมื่อ Bugmaster ตายไป, ข้าคงต้องหาศัตรูคนใหม่ที่มีค่าพอกับการเดินทางไปอีกฝากหนึ่งของข้า...

source: [They glare at you with bloodthirsty eyes]
th_th: [พวกเขาจ้องมองมาที่เจ้าด้วยแววตาที่กระหายเลือด]

source: The Bugmaster slayer perhaps...
th_th: ผู้พิชิตBug masterสินะ...
