Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bullying events - make civs separate faction.po
Languages: th_th

source: Hey, /RAT/. You just say something to me?
th_th: เฮ้ /RAT/. เจ้าเพิ่งจะพูดอะไรกับข้าน้ะ?

source: Did you just say something to me, /RAT/?
th_th: เจ้าพูดว่าอะไรนะ/RAT/?

source: Did I just hear you say something, /RAT/?
th_th: ข้าเพิ่งได้ยินเจ้าพูดอะไรบางอย่าง /RAT/?

source: ... I wouldn't dare!
th_th: ....ข้าไม่กล้าหรอก!

source: No, /SIR/...
th_th: ไม่, /SIR/...

source: ... nope... nope, nope
th_th: ... ไม่... ไม่, ไม่

source: ...N-no...
th_th: ... มะ-ไม่..

source: I heard it. /RAT/'s lying to you.
th_th: ข้าได้ยิน/RAT/กำลังหลอกเจ้า

source: Pretty sure I heard something too. /RAT/'s lying
th_th: ข้าแน่ใจว่าเจ้าพูดเหมือนกัน/RAT/โกหก

source: Liars get beaten, you know that
th_th: คนโกหกมันถูกกระทืบ เจ้ารู้นี่

source: You know not to lie to us, don't you?
th_th: เจ้ารู้ว่าไม่ควรโกหกเรา ใช่มั้ย?

source: I guess he doesn't respect the city guardsmen, right?
th_th: ข้าคิดว่ามันคงไม่รู้จักการเคารพยามของเมือง ใช่มั้ย

source: Please, no!.. I'll do anything!
th_th: ได้โปรด, ไม่!... ข้าจะยอมทำทุกอย่าง

source: Please, I mean no disrescpect! Mercy!
th_th: ข้าขอร้อง ข้าไม่ได้ตั้งใจจะลบหลู่ท่าน เมตตาข้าเถอะ!

source: /QUICKLAUGH/. Lucky, I'm in an agreeable mood
th_th: /QUICKLAUGH/โชคดีนะ ข้าอยูในอารมณ์ไม่คุยกันได้อยู่

source: /QUICKLAUGH/, go fetch me a nice gift and we'll call it quits then
th_th: /QUICKLAUGH/ ไปหาของขวัญดี ๆ ซักชิ้นให้ข้า แล้วข้าจะให้อภัยเจ้า

source: /QUICKLAUGH/, then surprise me with something nice and we'll let it go
th_th: /QUICKLAUGH/ เอาของดี ๆ ซักชิ้นให้ข้าประหลาดใจแล้วข้าจะปล่อยเจ้าไป

source: Ye- yes!
th_th: ดะ-ได้

source: U-uh, p-p-
th_th: อะ-เอ่อ ดะ-ดะ

source: N- no, I- I...
th_th: มะ-ไม่ ข้า-ข้า

source: Er..er, w-w
th_th: เอ่อ..เอ่อ เดี๋ยว-เดี๋ยว

source: That's a nice beat you got going there
th_th: ทำนองของเจ้าเพราะดีนี่

source: You got a stutter or you trying to sing to me?
th_th: เจ้ากำลังพยายามร้องเพลงอยู่เหรอ?

source: /QUICKLAUGH/, going to give me a dance as well?
th_th: /QUICKLAUGH/ เจ้าจะเต้นให้ข้าดูด้วยเหรอ

source: /LAUGH/, how about a jig as well?
th_th: /LAUGH/ เต้นให้ข้าดูสิ

source: ... if.. if it p-pleases you...
th_th: ...ถ้า..ถ้ามันทำให้ท่านพอใจ...

source: ...if- if that's what you want...
th_th: ถ้า..ถ้านั่นคือสิ่งที่ท่านต้องการ..

source: /QUICKLAUGH/! Clown...
th_th: /QUICKLAUGH/!ไอ้ตัวตลก...

source: Spit it out!
th_th: พูดมาซะ!

source: Cough it up!
th_th: พูดออกมา!

source: Fo- forgive me!
th_th: อะ-อภัยให้ข้าเถอะ

source: I- I'm sorry!
th_th: ข ข้าขอโทษ!

source: You causing trouble again, /RAT/?
th_th: เจ้าก่อปัญหาอีกแล้วเหรอ /RAT/?

source: Better not be causing any trouble, /RAT/
th_th: หวังว่าเจ้าจะไม่ก่อปัญหานะ /RAT/

source: There's a jail cell with your name on it, /RAT/
th_th: ข้ามีกรงขังที่มีชื่อของเจ้าอยู่นะ /RAT/

source: Don't make me dirty my boots on your face again.
th_th: อย่าให้ข้าต้องเหยียบหน้าเจ้าอีกนะ

source: I don't want to have to scuff my boots on your face again.
th_th: ข้าไม่อยากจะเหยียบหน้าเจ้าอีกนะ

source: Your face scuffed my boots last time. I was not happy. Stay in line.
th_th: ข้าเหยียบหน้าเจ้าไปครั้งที่แล้ว ข้าไม่รู้สึกดีเลย เข้าแถวซะ

source: Know your place, /RAT/
th_th: เจียมตัวซะมั่ง/RAT/

source: It's time for taxes, pay up /CITIZEN/
th_th: ถึงเวลาเก็บภาษีแล้ว จ่ายมาซะ/CITIZEN/

source: Tax collection time, pay up /CITIZEN/
th_th: ถึงเวลาเก็บภาษี จ่ายมา/CITIZEN/

source: Tax time, Cats out /CITIZEN/
th_th: เก็บภาษี จ่ายมา/CITIZEN/

source: Taxes, /CITIZEN/
th_th: ภาษี/CITIZEN/

source: Right I-
th_th: ใช่ ข้า-

source: Er, yes, let-
th_th: อ่า ได้ ข้าขอ-

source: Of cour-
th_th: แน่นอ....

source: I see, I-
th_th: ได้เลย ข้า-

source: Yes my-
th_th: ขอรั-

source: Well I-
th_th: เอาล่ะ ข้า-

source: Um, okay-
th_th: อ่า โอเค-

source: Er, right-
th_th: อ่า ใช่-

source: That's 1150 Cats
th_th: เป็น 1150 Cats

source: What?! That's double what it was last time, I don-
th_th: อะไรนะ?! นั่นมันสองเท่าเชียวนะ แล้วคราวก่อนละมันคืออะไร, ข้าไม่-

source: Wha?! Wait, that's twice as much as before, I haven-
th_th: ห๊ะ?! เดี๋ยวนะ, นี่มันเกือบจะสองเท่ามากกว่าคราวก่อนอีก, ข้าเพิ่ง-

source: How much!? That's almost triple what-
th_th: เท่าไหร่นะ!? นั่นมันเกือบสามเท่าเลยนะ อะไร-

source: Ggh! But, that's almost double the-
th_th: อั่กกก! แต่ว่า, นั่นมันเกือบจะสองเท่าเลยนะ

source: Wh-wha? I can't afford that! It's quadrupled! Plea-
th_th: อะไรนะ? ข้าไม่มีปัญญาจ่ายหรอก! นี่มันสี่เท่าเลยนะ! ได้โปร-

source: Stop
th_th: หยุด

source: Wait
th_th: เดี๋ยว

source: Hold it
th_th: หยุดซะ

source: Hold up
th_th: เดี๋ยวนะ

source: Shh..
th_th: ชู่วว..

source: Shush
th_th: เงียบ

source: ... Are you questioning me?
th_th: ...เจ้ากล้าตั้งคำถามกับข้ายังงั้นหรอ?

source: ... Are you second guessing me?
th_th: ... เจ้ากล้าสงสัยข้ายังงั้นหรอ?

source: ... You're not questioning ME are you?
th_th: ... เจ้าจะไม่ตั้งคำถามถ้าข้าเป็นเจ้า?

source: Are you challenging me?
th_th: เจ้ากล้าท้าทายข้าอย่างงั้นหรอ?

source: You dare to query me?
th_th: กล้าดียังไงมาต่อปากต่อคำกับข้า!

source: ... Are you doubting me?
th_th: ... เจ้าสงสัยข้า?

source: Excuse me!
th_th: ขอโทษ!

source: Apologies!
th_th: ขออภัย!

source: .. /SIR/.. I beg you, I don't have that kind of money!
th_th: .. /SIR/.. ข้าขอละ, ข้าไม่ได้มีเงินขนาดนั้น!

source: I'm begging you, I don't have enough money...
th_th: ข้าขอหล่ะท่าน, ข้ามีเงินไม่มากพอ...

source: But please, I don't have that much money!
th_th: ได้โปรดเถอะข้าไม่ได้มีเงินเยอะขนาคนั้น

source: Then you'll pay me tomorrow. With interest.
th_th: เจ้าจะต้องจ่ายข้าภายในวันพรุ่งนี้. พร้อมดอกเบี้ย.

source: Then FIND the money. I'll be back tomorrow.
th_th: งั้นก็ไปหาเงินมา! ข้าจะกลับมาในวันพรุ่งนี้

source: You have until tomorrow to pay me
th_th: เจ้ามีเวลาถึงพรุ่งนี้ที่จะจ่ายข้า

source: Don't make this messy for us both
th_th: อย่าทำให้มันยุ่งยากไปเลยแค่ข้ากับเจ้า

source: I don't want things to have to get ugly
th_th: ข้าไม่ต้องการให้มันกลายเป็นเรื่องไม่ดี

source: Or else we'll have to make an example of you
th_th: มิฉะนั้นข้าจะให้บทเรียนกับเจ้า

source: But, I already paid you yesterday. I don't have any-
th_th: แต่ว่า, ข้าจ่ายท่านเมื่อวานไปแล้วนี่. ข้าไม่มีอะ-

source: Wait, I already paid my tax, I haven-
th_th: เดี๋ยวก่อน, ข้าจ่ายภาษีไปแล้วนะ, ข้าไม่-

source: Taxes? But I paid yesterday, I don't have-
th_th: ภาษีงั้นหรอ? แต่ว่าข้าจ่ายไปแล้วเมื่อวานนี้นี่ ข้าไม่มี....

source: I said TAX TIME
th_th: ข้าบอกว่าถึงเวลาจ่ายภาษี

source: I SAID tax time
th_th: ข้าบอกว่าถึงเวลาจ่ายภาษี

source: TAXES!
th_th: จ่ายภาษีมา!

source: ... I.. don't have that kind of money... please...
th_th: ... ข้า.. มีเงินไม่มากพอได้โปรดเถอะ

source: .. But.. I don't have the money... I beg you...
th_th: .. แต่.. ข้ามีเงินไม่มากพอ... ข้าขอร้องแหละ...

source: ... I don't have it... Please, have mercy...
th_th: ... ข้าไม่มี... ได้โปรดเมตาข้าด้วย...

source: FIVE
th_th: ห้า

source: FOUR
th_th: สี่

source: No! Please! Please, no!
th_th: ไม่นะ! ได้โปรด! ขอร้องละ,ม่าย !

source: No! Have mercy, please!
th_th: ไม่นะ ได้โปรดเมตตาข้าด้วย ได้โปรด!

source: I beg you, no! Have mercy!
th_th: ข้าขอร้องท่าน ไม่นะ! โปรดเมตตาข้าด้วย!

source: TWO
th_th: สอง

source: I paid already! I don't have any more money!
th_th: ข้าจ่ายไปแล้ว! ข้าไม่มีเงินเหลืออีกแล้ว!

source: I already paid! I already paid my taxes!
th_th: ข้าจ่ายไปแล้ว! ข้้าจ่ายภาษีไปแล้ว!

source: I already paid! I already paid my taxes! Whyyyyyy!?
th_th: ข้าจ่ายไปแล้ว ข้าจ่ายภาษีไปแล้ว! ทำไมละ!?

source: FIND the money, or else I'll have you jailed for tax dodging!
th_th: ไปหาเงินมา, ไม่งั้นข้าจะยัดเจ้าเข้าคุกโทษฐานเลี่ยงภาษี

source: I want the money ready for me tomorrow! No excuses!
th_th: ข้าต้องการเงินเตรียมให้พร้อมภายในวันพรุ่งนี้! ไม่มีข้อแก้ตัวอะไรทั้งสิ้น!

source: No excuses! You'll pay me tomorrow, with interest!
th_th: อย่ามาแก้ตัว! เจ้าจะต้องจ่ายให้ข้าภายในวันพรุ่งนี้พร้อมดอกเบี้ย!

source: Tomorrow! Have the money ready or you'll be punished!
th_th: วันพรุ่งนี้! เตรียมเงินให้พร้อม มิฉะนั้นเจ้าจะถูกลงโทษ!
