Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bully becomes the bullied Defeated before (pt5) .po
Languages: th_th

source: ... you...
th_th: ... ท่าน...

source: Erm... and you are..?
th_th: เอิ่ม... แล้วเจ้าคือ..?

source: Uh... do I know you?
th_th: เอ่อ... ข้ารู้จักเจ้าด้วยอย่างงั้นหรอ?

source: Spit it out, do I know you?
th_th: พูดมาสิ, ข้ารู้จักเจ้าด้วยหรอ?

source: ... We had a... fight once... but we're good now, right? All even?
th_th: ... พวกเราเคย... สู้กันครั้งนึง... แต่ตอนนี้เราดีกันแล้ว, ใช่ไหม? ทุกอย่างเหมือนเดิมใช่ไหม?

source: Ah, yes, the town bully. Sure, whatever
th_th: อ้อ, ใช่แล้ว, พวกอันธพาลในเมือง. ได้, ยังไงก็ได้

source: Meh, still don't remember. And don't care
th_th: เฮอะ, ข้าก็ยังจำไม่ได้. แล้วก็ไม่ได้สนใจด้วย

source: Oh I remember! You used to be the town bully!
th_th: โอ้ว ข้าจำเจ้าได้! เจ้าเคยเป็นพวกอันธพาลในเมืองนี่!

source: Oh the tables have turned!
th_th: โอ้ สถานการณ์พลิกกลับ!

source: But revenge is for fools... Go on, scram
th_th: แต่การแก้แค้นมีไว้สำหรับคนโง่... ไปเถอะ, ไป๊

source: ... Th-thank you
th_th: ... ขะ-ขอบคุณ

source: So, you gonna show me some respect /RUNT/?
th_th: แสดงความเคารพข้าหน่อยสิ ไอ้/RUNT/?

source: You gonna show me some respect, /RUNT/?
th_th: เจ้าจะแสดงความเคารพข้าหรอ, ไอ้/RUNT/?

source: Okay. Be gone
th_th: เยี่ยม. ไปซะ

source: R-right
th_th: ขะ-ขอรับ

source: O-of course
th_th: ดะ-ได้

source: U-uh right
th_th: อะ-อ่า ขอรับ

source: Dance for me! Dance! Muahaha!
th_th: เต้นรำเพื่อข้า! เต้น! ว๊ะฮะฮ่า!

source: Y-yes!
th_th: ขะ..ขอรับ!

source: Y-y-right!
th_th: ขะ-ชะ-ขอรับ

source: O-of course!
th_th: ดะ-ได้!

source: Awahhh
th_th: อาาาา

source: You call that a dance?! Get out of my face!
th_th: เจ้าเรียกนั่นว่าการเต้นหระวะ?

source: Doesn't feel so good being on the other end, does it?
th_th: ไม่รู้สึกดีนักใช่มั้ย ตอนที่โดนมั่งน่ะ?

source: Out of my way, /RAT/
th_th: ออกไปจากทางของข้า /RAT/

source: You're in my way, /RAT/
th_th: เจ้าอยู่ในทางของข้า /RAT/
