Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bully becomes bullied (pt5).po
Languages: th_th

source: ... H-hi..
th_th: ...ฮะ-ไฮ..

source: ... H-hello..
th_th: ... สะ-สวัดดี..

source: ..Hi...
th_th: ..สวัดดี...

source: Do I know you?
th_th: ข้ารู้จักเจ้าด้วยอย่างงั้นหรอ?

source: Ah I remember now, the Stone Rat bully!
th_th: อ่า ข้าจำได้แล้ว, ไอ้ Stone Rat อันธพาลนี่เอง!

source: ..er.. well...
th_th: ...เอ่อ....อ่า....

source: Oh how the tables have turned! Go on then, dance for me!
th_th: โอ้ สถานการณ์มันกลับกันได้อย่างไรเนี่ย, มาเต้นรำกับข้าสิ

source: ..uhh, right, right (dances reluctantly)
th_th: ..เอ่ออ, ช่าย, ช่าย (เต้นรำอย่างไม่เต็มใจ)

source: Very good! You may go now
th_th: ดีมาก! ตอนนี้เจ้าไปได้แล้ว

source: ...th-thank you
th_th: ...ขะ-ขอบคุณ

source: That's rubbish! Get out of my face!
th_th: นั่นมันห่วยแตกมาก! ไปให้พ้นหน้าข้าเลยนะ!

source: *sob*
th_th: *กระซิก กระสิก* (เสียงสะอื้น)

source: You call that dancing?! Dance harder!
th_th: เจ้าเรียกนั่นว่าการเต้นหระวะ?! ตั้งใจให้มากกว่านี้หน่อย!

source: O-okay, uh... Nghhh! (Mildly aggressive dancing)
th_th: ตะ-ตกลง, อ่า... ย้าาาา! (ตั้งใจเต้นอย่างจริงจัง)

source: Uh-uh, right... Hrnghhh! (Overly enthusiastic dancing)
th_th: อา-ฮะ ได้... ฮ่าาาา! (ตั้งใจเต้นแบบกระตือรือร้นเกินไป)

source: That's better. Now scram
th_th: ค่อยยังชั่ว ทีนี้ไสหัวไปซะ

source: Urgh, /WHATTHEFUCK/ is that?! Go on, get out of here
th_th: โอ้ะ, นี่มัน/WHATTHEFUCK/?! ไปเลยไป, ออกไปจากที่นี่

source: Muhahaha
th_th: มูฮ่าฮ่าฮ่าฮ่า

source: Good to see you've learnt your place
th_th: เจ้ารู้จักเจียมตัวแล้วสินะ ดีมาก

source: Y-yes...
th_th: ชะ-ใช่...

source: It's ok. I forgive you
th_th: ไม่เป็นไร. ข้ายกโทษให้เจ้า

source: ... Thank you!
th_th: ... ชอบคุณ!

source: Well? Speak up
th_th: เอาล่ะ? ว่ามา

source: ... Well, we had a kinda... run-in before... no big deal, we're all even now, right?
th_th: ....เอ่อ,เราแบบว่า... เคยเจอกัน... ไม่ใช่เรื่องใหญ่.... เราหายกันแล้ว ใช่มั้ย?

source: Now I remember. I hope you've learned your lesson...
th_th: ข้าจำได้แล้ว หวังว่าเจ้าจะได้รับบทเรียนนะ

source: Yeah... thanks...
th_th: ใช่... ขอบคุณ...

source: Nope, still don't remember. Guess you have a forgettable face
th_th: ไม่,ข้าจำไม่ได้ สงสัยหน้าเจ้าจะลืมง่ายมั้ง

source: Phew...
th_th: ...เฮ้อ

source: ..Whew
th_th: ...เฮ้อ

source: Whatever it was, I forgive you. Don't sweat it
th_th: จะอะไรก็ตาม ข้าอภัยให้เจ้า ชั่งมันเถอะ

source: Sure, we can call it even. No big deal
th_th: โอเค ข้าถือว่าหายกัน ไม่ใช่เรื่องใหญ่

source: Okay... nevermind then
th_th: โอเค... ไม่เป็นไรแล้ว

source: Out of my way, /RAT/.
th_th: หลีกไปซะ /RAT/.

source: Y-yes! Sorry!
th_th: ชะ..ใช่! ขออภัยขอรับ!

source: R-right! I'm sorry!
th_th: ดะ-ได้! อภัยข้าด้วย!

source: Of course... p-please forgive me!
th_th: ได้เลย... โปรดอภัยให้ข้าด้วย!

source: You again!... Dance!
th_th: เจ้าอีกแล้ว...เต้นซิ!

source: Bow before me!
th_th: ก้มหัวให้ข้าซะ!

source: (Reluctantly bows down to you)
th_th: (ก้มตัวเคารพอย่างไม่ไม่เต็มใจ)

source: Lower!
th_th: ต่ำลงอีก!

source: That's no good! Bend lower!
th_th: นั่นไม่ดีพอ! ก้มต่ำอีก!

source: (Touches head to the floor)
th_th: (กดหัวลงกับพื้น)

source: Goooood, gooood!
th_th: เยี่ยมมมมม, เยี่ยมมมมม!

source: Now go
th_th: ไปได้แล้ว

source: Okay, be gone
th_th: โอเค,ไปได้
