Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Bust out of jail bandit.po
Languages: th_th

source: /OI/... You wanna get outta here, don'tcha?
th_th: /OI/... เจ้าอยากออกไปจากที่นี้ใช่ไหมละ?

source: Psst... you... you don't wanna rot in here, do ya?
th_th: เฮ้... เจ้า... เจ้าไม่อยากเน่าตายอยู่ที่นี่, ใช่ไหมละ?

source: Psst... You wanna get outta this dump, right?
th_th: เฮ้... เจ้าอยากออกไปจากกองขยะนี่, ใช่ไหม?

source: Of course, I'm listening...
th_th: แน่นอน ข้าฟังอยู่...

source: Yeah... go on...
th_th: ใช่... อยากไป...

source: I'm listening...
th_th: ข้าฟังอยู่...

source: Let's bust the hell out of here and make a run for it. We just keep runnin' 'til those overdressed goons can't chase us no more
th_th: ออกไปจากนรกนี่กันเถอะ ตอนนี้เรายังหนีทัน. เราแค่วิ่งไปเรื่อย ๆจนกว่าพวกโง่ที่แต่งตัวเวอร์เกิน ไม่สามารถไล่เราได้ทัน

source: I guess we've got nothing to lose...
th_th: ข้าคิดว่าพวกเรา คงไม่มีอะไรจะเสียอีกแล้ว...

source: That's a ridiculous idea
th_th: นั่นเป็นความคิดที่ ไร้สาระ

source: You got any better suggestions, /BOY/?
th_th: เจ้ามีคำแนะนำที่ดีกว่านี้เรอะ /BOY/?

source: Fine. I'll get outta here by myself.
th_th: ได้. ข้าจะออกไปจากที่นี่ ด้วยตัวข้าเอง.

source: Fine. I'll get outta here on my own.
th_th: ได้. ข้าจะออกไปจากที่นี่ ด้วยตนเอง.

source: I like your thinking!
th_th: ข้าชอบความคิดของเจ้า!

source: Screw 'em. Let's do this
th_th: ช่างแม่ง! ลงมือกันเถอะ

source: Fuck 'em. Let's do this
th_th: ช่างแม่ง! ลงมือกันเถอะ

source: I'd rather rot than escape with a thug like you
th_th: ข้าขอเน่าอยู่นี่ดีกว่าหนีไปกับนักเลงอย่างเจ้า

source: I'm not interested in teaming up with a thug like you
th_th: ข้าไม่สนใจที่จะจับทีมกับนักเลงอย่างเจ้า

source: Stuck up /INSULT/
th_th: ก็อยู่นนี้แหละ /INSULT/

source: Then rot in here for all I care
th_th: งั้นก็เน่าอยู่นี่ไปซะ คิดว่าข้าสนนักล่ะ

source: I'm happy repenting in my cell actually
th_th: ข้ามีความสุขดีในห้องขังเล็ก ๆ ของข้า

source: I'm content to atone in my cell actually
th_th: ข้ามีความสุขที่ได้ชดใช้บาปในห้องขัง

source: I deserve to be here, I'll just wait it out
th_th: ข้าควรจะอยู่ที่นี้, จะรอจนกว่าจะได้ออกไปเอง

source: /MERCLAUGH/... You are jokin' right?
th_th: /MERCLAUGH/... เจ้าล้อเล่นใช่ไหมเนี่ย?

source: Sure, but I don't need your help, /PAL/
th_th: แน่นอน, แต่ข้าไม่ต้องการความช่วยเหลือจากเจ้า, /PAL/

source: Fine. Be like that.
th_th: ก็ได้. เอาตามนั้น.

source: Then rot in the /SANDS/ for all I care
th_th: งั้นก็เน่าตายบนทรายนี่ซะ

source: ... What you /LOOKING/ at?
th_th: ... นาย /LOOKING/อะไรของนายวะ?

source: ... What? You want somethin'?
th_th: ... อะไร? เจ้าต้องการอะไร?

source: You wanna get out of here, don't you?
th_th: ... เจ้าอยากจะออกไปจากที่นี้ใช่ไหมละ?

source: You wanna get out of this place, right?
th_th: ... เจ้าอยากจะออกไปจากที่แห่งนี้ใช่ไหมละ?

source: ... Go on...
th_th: ... ไปกันเลย...

source: ... Yeah...
th_th: ... แน่นอน...

source: Let's pick the locks and make a run for it...
th_th: ลงมือสะเดาะกลอนแล้ววิ่งออกไปจากที่นี้เถอะ...

source: Let's bust these cages open and run...
th_th: มาทุบกรงพวกนี้ให้เปิดออกแล้ววิ่งกันเถอะ...

source: I like your style. I'm in.
th_th: ข้าชอบสไตล์ของเจ้าวะ ข้าเอาด้วย

source: I like the cut of your jib. Let's get the hell out of here.
th_th: ข้าชอบความคิดเจ้าวะ. มาออกไปจากนรกนี่กันเถอะ

source: Then help me. Let's escape together.
th_th: งั้นก็ช่วยข้าสิ เราจะได้หนีไปด้วยกัน

source: Then help me get out of here. Let's make a break for it.
th_th: งั้นก็ช่วยข้าออกไปจากที่นี่. เราจะฝ่ามันออกไป

source: ... Alright. Let's get these cages open.
th_th: ... โอเค. มาเปิดกรงพวกนี้เถอะ

source: ... Alright. Get picklockin'.
th_th: ... โอเค. กำลังสะเดาะกลอน.

source: We'll have a better chance if we escape together...
th_th: เราจะมีโอกาสหนีได้มากขึ้นถ้า พวกเราร่วมมือกัน

source: Together, we've got a better chance of escaping...
th_th: ถ้าพวกเรารวมมือกัน เราจะมีโอกาสหนีได้มากขึ้น

source: Who'd YOU murder?
th_th: เจ้าไปฆ่าใครมาล่ะ?

source: What did YOU do?
th_th: เจ้าไปก่อเรื่องอะไรมาล่ะ?

source: Who'd YOU kill?
th_th: เจ้าไปสังหารใครมาล่ะ?

source: So, what are you in for?
th_th: แล้ว เจ้าโดนข้อหาไรล่ะ?

source: That ain't none of your business, and I ain't the talkin' type, /BOY/
th_th: ไม่ใช่เรื่องของเจ้า และข้าก็ไม่ใช่พวกชอบคุยด้วย /BOY/

source: You're no fun...
th_th: ไม่มีอารมณ์ขันเลยนะ...

source: ... I ain't the chatty type, /BOY/. Go bother somebody else before I get stabby...
th_th: ข้าไม่ใช่พวกชอบจ้อนะ /BOY/ ไปยุ่งกับคนอื่นเสียไปก่อนที่ข้าจะยั๊วะ...

source: I'm busting out of here. Are you with me or not?
th_th: ข้าจะหาทางออกจากที่นี่. จะไปกับข้าหรือปล่าว

source: I'm breakin' out of here. You with me?
th_th: ข้าจะฝ่าออกไปจากที่นี่. เจ้าว่าไง?

source: .. I'm with you...
th_th: ข้าเอาด้วย

source: ... What's the plan..?
th_th: ... แผนละว่าไง..?

source: Nothing...
th_th: ไม่มีอะไร?
