Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Caged neighbour ninja talk to pt 2.po
Languages: th_th

source: You, you're a ninja! Can't you get us out of here?
th_th: เจ้า, เจ้า​เป็น​นินจา! เจ้า​พาเราออกจาก​ที่นี่​ไม่​ได้​หรอ?

source: ... I'm a ninja, not a babysitter. You're just gonna have to save yourself this time... Ever busted a lock open before?
th_th: ...ข้า​เป็น​นินจา, ไม่​ใช้​พี่เลี้ยง​เด็ก​ ตอนนี้​เจ้า​ต้อง​ดูแล​ตัวเอง... เว้นแต่​เจ้า​เคย​ถูก​จับ​ตอนปลดล็อค​รึเปล่า?

source: I'm pretty good at lockpicking, if that's what you mean
th_th: ข้า​ค่อนข้าง​เก่ง​ในการสะเดาะ​กุญแจ, ถ้า​เจ้า​จะหมายความ​ว่างั้นน่ะ​

source: Sure, of course
th_th: ใช่, แน่นอน​อยู่แล้ว​

source: Good, then start picking
th_th: เยี่ยม, งั้นเริ่ม​การ​สะเดาะ​ซะ

source: Once you've got it, we'll sneak out of here
th_th: เจ้าทำได้​เมื่อ​ไหร่, เรา​จะ​แอบออกไปจาก​ที่นี่​

source: ... No, not really
th_th: ... ไม่, เป็น​ไป​ไม่ได้​

source: Well, now's the time to try
th_th: เยี่ยม, ตอนนี้​ได้​เวลา​ลอง​แล้ว​

source: No. Can't you do it for me?
th_th: ไม่​ เจ้า​ทำให้​ข้า​ไม่​ได้​หรอ?

source: There's no time, and I can't reach your cage. You're just going to have to try, and now's a better time than any to start practising
th_th: ไม่​มี​เวลา​แล้ว, และข้าเอื้อม​ไม่​ถึง​กรงของเจ้า​ด้วย​ เจ้าจะต้อง​ลองทำเลย, และ​ตอนนี้​เป็น​เวลาที่ดี​กว่า​จะเริ่มฝึกทำมัน

source: Right, I'll try!
th_th: ได้, ข้าจะลองดู!

source: Good, keep at it. After that, we'll sneak out of here
th_th: ดี, จำเอาไว้​ หลังจาก​นี้, เรา​จะ​แอบ​ออก​ไป​จาก​ที่นี่​

source: And you better be good at sneaking
th_th: และเจ้า​ต้อง​ย่อง​ออกไปให้​เงียบ​ที่สุด​

source: And what then?
th_th: และจากนั้น​อะไร​ต่อ?

source: After that, we'll sneak past 'em
th_th: หลังจาก​นั้น, เราจะย่อง​ผ่าน​พวก​มัน

source: Keep at it, you'll get it eventually
th_th: จำเอา​ไว้, แล้วเจ้า​จะ​ผ่าน​มัน​ไป​ได้​

source: Shit
th_th: เชี่ย​

source: Stay calm and keep trying. After that, we'll sneak out of here
th_th: ใจเย็น​และ​ลอง​ทำใหม่​ หลังจาก​นั้น, เรา​จะ​ย่อง​ออกไป​

source: Hey, you're busting out? Please, take me with you!
th_th: เฮ้, เจ้า​เปิด​มันได้? ได้​โปรด, พาข้าไปกับเจ้าด้วย!

source: Hey, ninja. I have a plan, let's get out of here
th_th: เฮ้, นินจา​ ข้ามีแผน, ไปจากนี้​กัน

source: Oh, you do now? And what might that be?
th_th: โอ้, เจ้ามีแล้วแล้ว? แล้วมันคือ​อะไร?

source: Pick the locks open, bust some cannibal skulls
th_th: สะเดาะ​กุญแจ, จัดการ​พวกกิน​คน​สักตัว

source: Revenge is sweet. Okay, heal up and start working on your cage lock
th_th: การแก้แค้น​ที่​หอมหวาน​ โอเค, รักษา​ซะ​แล้ว​จะเริ่มทำที่​กรงเจ้า

source: Run like crazy
th_th: ใส่เกียร์​หมา​

source: Sure, I can outrun them. Start working on your cage lock
th_th: แน่นอน, ข้าวิ่งหนี​พวกมัน​ได้​ เริ่ม​สะเดาะ​ล็อค​กรงเจ้า​ซะ

source: We sneak out when they let their guard down
th_th: เราจะแอบออก​ไป​เมื่อ​มัน​ลดการป้องกัน​ลง

source: Should be easy. Okay, start working on your cage lock
th_th: มันน่าจะ​ง่าย​ โอเค, เริ่ม​สะเดาะ​ล็อค​กรง​เจ้า​ซะ

source: You got a lot of balls for someone trapped in a cage...
th_th: เจ้า​จะ​เจอ​ปัญหา​เยอะ​สำหรับ​ใครก็ตาม​ที่​เคย​อยู่​ในคุก​มาก่อน..

source: What can I say, I'm fond of vengence and retribution
th_th: ข้าจะ​ว่าอย่างไร​ดี​ ข้ารัก​ในการล้างแค้น​และ​ผลกรรม

source: So, you're a ninja, right? Got any escape plans up your sleeve?
th_th: ดังนั้น​แล้ว, เจ้าเป็น​นินจา, ใช่ไหม? เจ้ามีแผน​หลบหนี​ไม?

source: ... Bust the cage lock, sneak out. You want to come with me? Start picking
th_th: ... ทำลาย​ที่​ล็อค​กรง, แล้ว​ย่องออกไป​ เจ้าอยาก​ไป​กับ​ข้ารึ? งั้น​เริ่ม​สะเดาะ​ล็อค​ซะ

source: Well, I have a plan. Want to get out of here with me?
th_th: ดี, ข้า​มีแผน​ เจ้า​ต้อง​การ​ออก​ไป​กับ​ข้า​ไม?

source: You against hundreds of cannibals? This I'd like to see
th_th: เจ้าจะสู้กับพวกกินคนร้อยคน?นั้นแหละที่ข้าอยากเห็น

source: I hate to disappoint, but you'll probably be roasting on a spit by then
th_th: ข้าไม่อยากทำให้ผิดหวังนะ แต่เจ้าจะถูกยำเละเป็นชิ้นโดยพวกมัน

source: Won't you rescue me first?
th_th: เจ้าไม่ช่วยข้าก่อนรึ?

source: ... Thanks for reminding me
th_th: ...ขอบคุณที่เตือนข้า

source: You should start picking your lock open if you want to get out
th_th: เจ้าควรจะเริ่มสะเดาะล็อคซะถ้าเจ้าอยากไปกับข้า

source: What? You'd just leave me here like that?
th_th: อะไร?เจ้าจะทิ้งข้าไว้อย่างนี้อย่างงั้นรึ?

source: I'm a ninja, not a babysitter. I have enough on my own plate right now, don't you think?... Look, first things first, just start picking your lock open
th_th: ข้า​เป็น​นินจา, ไม่​ใช้​พี่เลี้ยง​เด็ก​ เจ้าไม่คิดหรือ?ลำพังตัวข้าเองก็เต็มกลืนแล้ว...ดูอันดับแรกจงเริ่มสะเดาะล็อคของเจ้าซะ

source: Right!
th_th: ได้t!

source: So you'll help me?
th_th: แล้วเจ้าจะช่วยข้า?

source: Just start picking
th_th: จงเริ่มสะเดาะซะ

source: But... I'm so bad at lockpicking!
th_th: แต่...ข้าไม่เก่งการสะเดาะ!

source: Me? /QUICKLAUGH/, I'd like to see them try
th_th: ข้า? /QUICKLAUGH/,ข้าก็แค่อยากเห็นพวกมันลองทำบ้าง

source: They already beat you once, no?
th_th: พวกมันเอาชนะเจ้าได้, ไม่?
