Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Caged neighbour pt 1.po
Languages: th_th

source: Hey... Hey, you
th_th: เฮ้... เฮ้, เจ้า

source: Pssst! Hey, you
th_th: พิส! เฮ้, เจ้า

source: Psst!
th_th: พิสสส!

source: You! Yeah, you...
th_th: เจ้า! ใช่, เจ้านั้น​แห​ล่ะ​

source: Yeah, you...
th_th: ใช่, เจ้า...

source: You there...
th_th: เจ้าตรงนั้นน่ะ...

source: Ah, my new neighbour... nice to meet you
th_th: อ่า, เพื่อน​บ้านคนใหม่... ยินดี​ที่​ได้​รู้จัก​

source: Ah, my new neighbour...
th_th: อ่า,เพื่อน​บ้าน​คน​ใหม่...

source: Come, talk with me...
th_th: มา, คุย​กัน​กับ​ข้า...

source: I have something to ask you...
th_th: ข้ามีบางอย่าง​จะ​ถาม​เจ้า...

source: I want to ask you something...
th_th: ข้าต้องการถามเจ้าบางอย่าง....

source: Talk with me for a sec
th_th: คุยกับข้า​สัก​ประเดี๋ยว​

source: Lean this way, come hear me out
th_th: เล่าไปเลย,ค่อยไปเรื่อง​ของ​ข้า​
