Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Caged bandit.po
Languages: th_th

source: THIS CAN'T BE HAPPENING TO ME! HELP!! HELLLLP!
th_th: มันไม่น่าจะเกิดขึ้นกับข้าได้! ช่วยด้วย!! ช่วยด้วยยยย!

source: HELP!!! SOMEBODY HELP! GET ME OUT OF HERE!!!
th_th: ช่วยด้วย!!! ใครก็ได้ช่วยด้วย! พาข้าออกไปจากที่นี่ที!!!

source: HELP MEEEEE! I CAN'T DIE YET!
th_th: ช่วยข้าด้วยยยยย! ข้ายังตายไม่ได้!

source: HELP!!! I DON'T WANNA DIE LIKE THIS!
th_th: ช่วยด้วย!!! ข้าไม่อยากตายแบบนี้!

source: NO!! HELP ME! I DON'T WANNA DIE LIKE THIS!
th_th: ม่าย!! ช่วยด้วย!!! ข้าไม่อยากตายแบบนี้!

source: I... I CAN'T TAKE IT! HELP!! HELLLLP!
th_th: ข้า... ข้าทนไม่ได้! ช่วยด้วย!! ช่วยยยด้วยยยย!

source: HELP!! HELLLLP! I DON'T WANNA DIE!
th_th: ช่วยด้วย!!! ข้าไม่อยากตาย!

source: THIS CAN'T BE HAPPENING! HELP!!! SOMEBODY HELP!
th_th: เรื่องแบบนี้มันไม่ควรจะเกิดขึ้น! ช่วยด้วย!!! ใครก็ได้!

source: HELP!!! SOMEBODY HELP! I CAN'T DIE YET!
th_th: ช่วยด้วย!!! ใครก็ได้ช่วยที! ข้ายังไม่อยากตาย!

source: THIS CAN'T BE HAPPENING TO ME! HELP MEEEEE!
th_th: เรื่องนี้ไม่ควรจะเกิดขึ้นกับข้า! ช่วยข้าด้วยยย!

source: HELP!!! I DON'T WANNA DIE!
th_th: ช่วยด้วย!!! ข้าไม่อยากตาย!

source: GET ME OUT OF HERE!!! HELP!! HELLLLP!
th_th: พาข้าออกไปจากที่นี่ที!!! ช่วยด้วย!! ช่วยด้วยยยย!

source: I HAVE TO GET OUT OF HERE!
th_th: ข้าต้องออกไปจากที่นี่

source: NOOOOO! GET ME OUT OF HERE!!!
th_th: ม่ายยยยย! พาข้าออกไปจากที่นี่

source: NO NO NO NO NO NO NO! I CAN'T DIE YET!
th_th: ไม่ ไม่ ไม่ ไม่ ไม่ ไม่ ไม่! ข้ายังตายไม่ได้!

source: ARRRGHHH! THIS CAN'T BE HAPPENING!
th_th: อ๊าาากกกก มันไม่น่าจะเกิดขึ้นได้นี่!

source: Damn /BASTARD/s! You can't eat me, I'm poisonous!
th_th: เวรเอ้ย /BASTARD/s! เจ้าไม่สามารถกินข้าได้, ตัวข้ามีพิษ!

source: Damn DIRTY cannibals! You do realise I'm poisonous, right?
th_th: เวรเอ๊ย ไอ้มนุษย์กินคนตัวสกปรก! เจ้าก็รู้ใช่ไหมว่าตัวข้าหน่ะมันมีพิษว้อยย?

source: /FUCKING/ cannibals... you sicken me
th_th: /FUCKING/ มนุษย์กินคน... เจ้าทำให้ข้าอยากจะอ๊วกซะจริง

source: I /FUCKING/ hate cannibals
th_th: /FUCKING/ ข้าเกลียดมนุษย์กินคน

source: Damn /BASTARD/s! C'mon let me go. I taste like shit, guys
th_th: เวรเอ้ย /BASTARD/! ปล่อยข้าไปนะ. ข้ารสชาติเหมือนขี้เลยนะพวก

source: Damn DIRTY cannibals! Eat me, I /FUCKING/ dare you!
th_th: เวรเอ้ย พวกมนุษย์กินคนสกปรกโสมม! แดกกูสิ, กูท้ามึงเลย!

source: Get it over with then! Eat me already! /FUCKING/ cannibals!
th_th: ถ้าอย่างนั้นมันก็จบ! กินข้าเลย! มนุษย์กินคน/FUCKING/!

source: /FUCKING/ cannibals! So you gonna eat me or what? /COWARD/s
th_th: /FUCKING/ มนุษย์กินคน! งั้นเจ้าก็จะกินข้าสินะหรืออะไร? /COWARD/s

source: /TCH/ dumbasses..
th_th: /TCH/ ไอ้โง่..

source: Goddammit! ... Damn /BASTARD/s! Get me out of here!
th_th: เหี้ยเอ้ยย! ... บัดซบ /BASTARD/! พาข้าออกไปจากที่นี่!

source: /FUCK/! Damn DIRTY cannibals! Let me go already!
th_th: /FUCK/! ไอ้เวรมนุษย์กินคนสกปรก! ปล่อยข้าออกไปได้แล้ว!

source: /FUCKING/ cannibals... you sicken me...
th_th: /FUCKING/มนุษย์กินคน... เจ้าทำให้ข้าคลื่นใส้เหลือเกิน...

source: ... I /FUCKING/ hate cannibals...
th_th: .../FUCKING/ ข้าเกลียดพวกมนุษย์กินคน...

source: I... need out of here! Goddammit!
th_th: ข้า...อยากจะออกไปจากที่นี่! บัดซบเอ้ย!

source: You're tellin' me! You any good with a lockpick?
th_th: เจ้ากำลังบอกข้า! เจ้าจะใช้เครื่องมือปลดล็อกหรอ?

source: Sure, leave the locks to me
th_th: แน่นอน, ปล่อยกุญแจให้ข้า

source: I dunno... I can try
th_th: ข้าม่ายรุ... ข้าไม่สามารทำได้

source: Well you better try damn hard... Get the locks open.
th_th: เจ้าควรจะลองพยายามให้มาก... เอากุญแจเปิดออก.

source: I'm countin' on you...
th_th: ข้าเชื่อใจเจ้า

source: No, I'm terrible! We're doomed!
th_th: ไม่, ข้าเสียใจ! เราตายแน่!

source: Geez...
th_th: โอ๊ยไม่ได้เรื่องเลย...

source: Just forget it...
th_th: ลืมมันไปซะ...

source: We have to do something! I can't die like this!
th_th: เราต้องทำอะไรสักอย่าง! ข้าไม่อยากตายเยี่ยงนี้!

source: I saw them eyeing you up... You're next...
th_th: ข้าเห็นมันจ้องเจ้า... เจ้าเป็นรายต่อไปล่ะ...

source: Hold on, I'll pick your lock. Let's get out of here
th_th: รอก่อนนะ ข้าจะปลดล็อคเจ้าให้ ออกไปจากที่นี่กัน

source: Alright! You gotta help me out!
th_th: เยี่ยม, เจ้าต้องช่วยข้าออกไป!

source: Quickly, before they come back!
th_th: เร็วหน่อย, ก่อนที่พวกมันจะกลับมา!

source: Good /MAN/! I am NOT waitin' around to get eaten alive!
th_th: ยอดนัก/MAN/! ข้าจะไม่รอให้พวกมันกินข้าทั้งเป็นหรอกนะ!

source: *sob*... I don't wanna die! Help me...
th_th: *ฮือๆ*...ข้ายังไม่อยากตาย! ช่วยข้าด้วยยย...

source: *whimper*... Please... I don't wanna die... help me...
th_th: *ฮือออ*... ขอร้องล่ะ... ข้ายังไม่อยากตาย... ช่วยข้าที...

source: *sniff*... Please... I don't wanna die...Please let me out of here...
th_th: *ซู๊ดดด*... ขอร้อง... ข้าไม่อยากตาย...โปรดพาข้าออกไปจากที่นี่ที...

source: *sob*... Let me go... I can't take this...
th_th: *ฮือ*...ปล่อยข้าไป...ข้ารับไม่ไหวแล้ว...

source: *whimper*... I don't wanna die! ...Please, I'll do anything
th_th: *ฮึกๆ*...ข้าไม่อยากตาย! ...ได้โปรดข้ายอมทำทุกอย่าง

source: Coward! Pull yourself together!
th_th: ไอ้ขี้ขลาด!ตั้งสติหน่อยสิ!

source: Quit whining! Get a hold of yourself, /MEMAN/!
th_th: เลิกสะอื้นที! ตั้งสติหน่อย! /MEMAN/!

source: ... R- right...
th_th: ...จ-จริงด้วย...

source: HOW CAN I CALM DOWN WHEN I'M ABOUT TO BE EATEN BY CANNIBALS!
th_th: จะให้ข้าใจเย็นได้อย่างไร เมื่อข้ากำลังจะโดนพวกมนุษย์กินคนกิน!

source: ...Y- yeah...
th_th: ... ชะ-ใช่

source: I DON'T WANNA!
th_th: ข้าไม่ต้องการแบบนี้!

source: ... Oh god...
th_th: ... โอ้ พระเจ้า...

source: Don't worry, I'll get us out of here...
th_th: ไม่ต้องห่วง, ข้าจะพาเราออกไปจากที่นี่...

source: It's okay, I'll get us out of here, I promise...
th_th: ไม่เป็นไร, ข้าจะพาเราออกไปจากที่นี่, ข้าสัญญา...

source: R- really?...
th_th: จะ..จริงรึ?...

source: You will?
th_th: เจ้าจะทำรึ?

source: You'll get us out?
th_th: เจ้าจะพาเราออกไปจากที่นี่รึ?

source: You have to hurry!
th_th: เจ้าต้องรีบแล้ว!

source: Calm down. Panicking isn't going to get you anywhere.
th_th: ใจร่มๆ ไว้ ตื่นตระหนกไปก็ไม่ช่วยให้เจ้าไปไหนได้หรอกนะ

source: Oh god! They're gonna eat us alive!
th_th: โอ้ พระเจ้า! พวกมันจะกินเราทั้งเป็น!

source: We're doomed! Somebody do something!
th_th: ข้าตายแน่! ใครก็ได้ ทำอะไรสักอย่างสิ่ว่ะ!

source: They'll cook us alive! Somebody save us!
th_th: พวกมันจะจับเราต้มทั้งเป็น! ใครก็ได้ ช่วยด้วย!

source: OH GOD!!! GET ME OUT OF HERE!
th_th: โอ้ พระเจ้า!!! พาข้าออกไปจากที่นี่!

source: This can't be happening to me!!!
th_th: สิ่งนี้ไม่ควรจะเกิดขึ้นกับข้าสิว้ะ!!!

source: NO NO NO NO NO NO NO!
th_th: ไม่ ไม่ ไม่ ไม่ ไม่ ไม่ ม่ายยยยยย!!

source: ARRRGHHH!
th_th: อ๊ากกกกกกก!

source: *Hysterical crying*
th_th: *ร้องไห้อย่างวิกลจริต*

source: *Cries hysterically*
th_th: *ร้องไห้อย่างเสียประสาท*

source: I DON'T WANNA DIE!
th_th: ข้าไม่อยากตาย!

source: I CAN'T DIE YET!
th_th: ข้ายังตายไม่ได้!

source: I DON'T WANNA DIE LIKE THIS!
th_th: ข้าไม่อยากตาย เช่นนี้!

source: THIS CAN'T BE HAPPENING TO ME!
th_th: เรื่องนี้ไม่ควรจะเกิดขึ้นกับข้า!

source: THIS CAN'T BE HAPPENING!
th_th: เรื่องนี้ไม่ควรจะเกิดขึ้น!

source: I... I CAN'T TAKE IT!
th_th: ขะ... ข้ารับไม่ได้

source: LET ME OUT!!!
th_th: ให้ข้าออกไป!!!

source: GET ME OUT OF HERE!!!
th_th: ให้ข้าออกไปจากที่นี่!!!

source: LET ME GO!
th_th: ให้ข้าปายยย!

source: /QUICKLAUGH/ you're gonna regret messing with me, /BASTARD/s! My friends'll come save me. You picked the wrong outlander to mess with
th_th: /QUICKLAUGH/ เจ้าจะต้องเสียใจที่มาหาเรื่องข้า พวก/BASTARD/! พรรคพวกของข้าจะมาช่วยข้า เจ้าเลือกหาเรื่อง outlander ผิดคนแล้วเฟ้ย

source: /YUCK/ dirty fucking cannibals! Someone'll come for me! Just you wait...
th_th: /YUCK/ ไอ้พวกกินคนโสโครก! จะมีคนมาช่วยข้าแน่นอน! รอดูไปเถอะ...

source: /LAUGH/! You think a CAGE can hold me?! /IDIOT/s! Someone'll come for me! Just you wait...
th_th: /LAUGH/! เจ้าคิดว่ากรงง่าว ๆ นี่จะขังข้าได้อย่างนั้นเรอะ?! พวก/IDIOT/! จะมีคนมาช่วยข้าแน่นอน! รอดูไปเถอะ...

source: I /FUCKING/ hate cannibals! You'll regret this I tell ya! My friends are on their way for me right now!
th_th: ข้าล่ะเกลียดพวกกินคนนี่/FUCKING/! ข้าขอเตือนว่าเจ้าจะต้องเสียใจแหง! ตอนนี้พรรคพวกของข้ากำลังเดินทางมาช่วยข้าอยู่!

source: /LAUGH/! You think a CAGE can hold me?! /IDIOT/s! My brothers will come avenge me. Oh you're gonna regret this...
th_th: /LAUGH/! เจ้าคิดว่ากรงง่าว ๆ นี่จะขังข้าได้อย่างนั้นเรอะ?! พวก/IDIOT/! พี่น้องของข้าจะมาแก้แค้นให้ข้าแน่นอน! เจ้าจะต้องเสียใจ...

source: /FUCKING/ cannibals! An army of pissed off outlaws will appear any minute now to rescue me, just you wait!
th_th: พวกกินคน/FUCKING/! กองทัพของพวกนอกกฎหมายอารมณ์บูดจะมาถึงในอีกไม่กี่นาทีนี้เพื่อช่วยเหลือข้า เจ้ารอดูเถอะ!

source: And then we're all gonna eat YOU. Just for /FUCKING/ funsies! ...
th_th: แล้วพวกข้าก็จะกินเจ้า เพื่อความสนุกแบบ/FUCKING/!

source: Plot twist: We eat YOU /BASTARD/s! See how YOU /FUCKING/ like it! ... Yeah...
th_th: มีเรื่องหักมุมว่ะ พวกข้าจะกินพวกเจ้า ไอ้/BASTARD/! มาดูกันว่าเจ้าจะชอบ/FUCKING/เลยมั้ย!...ช่ายยย...

source: We'll eat YOU /BASTARD/s! Just for shits n' giggles ... Yeah...
th_th: พวกข้าจะกินพวกเจ้า ไอ้/BASTARD/! เพื่อความบ้าบอและไร้สาระไง...ช่าย...

source: And then we're all gonna eat YOU! Won't be so high n' mighty then, will ya? ...
th_th: แล้วพวกข้าก็จะจับเจ้ากิน! ตอนนั้นเจ้าคงไม่ยิ่งใหญ่และแข็งแกร่งแล้วล่ะ ว่ามั้ย?...

source: And then we're all gonna eat YOU. Just for /FUCKING/ funsies! ... Uh huh!
th_th: แล้วพวกข้าก็จะกินเจ้า เพื่อความสนุกแบบ/FUCKING/!...อะฮ่า!

source: Plot twist: We eat YOU /BASTARD/s! See how YOU /FUCKING/ like it! ... Uh huh!
th_th: มีเรื่องหักมุมว่ะ พวกข้าจะกินพวกเจ้า ไอ้/BASTARD/! มาดูกันว่าเจ้าจะชอบ/FUCKING/เลยมั้ย!...อ่าฮะ...

source: We'll eat YOU /BASTARD/s! Just for shits n' giggles ... Uh huh!
th_th: พวกข้าจะกินพวกเจ้า ไอ้/BASTARD/! เพื่อความบ้าบอและไร้สาระไง...อ่าฮะ...

source: They'll come save me...
th_th: พวกเขาจะมาช่วยข้า...

source: They'll come for me for sure
th_th: พวกเขาจะมาช่วยข้าแน่นอน

source: Yeah, they're coming...
th_th: ใช่ พวกเขาจะมา...
