Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Cannibal neighbour picking pt3.po
Languages: th_th

source: Nice one!
th_th: เจ๋ง!

source: Nice work!
th_th: ทำได้ดีมาก!

source: Good job!
th_th: ดีมาก!

source: Now we sneak out. I'll follow your lead
th_th: ทีนี้เราจะย่องออกไป เจ้านำเลยข้าจะตามไป

source: Now we sneak out of here. You lead, I'll follow
th_th: ทีนี้เราจะย่องไปจากที่นี่ เจ้านำเลยข้าจะตามไป

source: Now, let's sneak the hell out of here. I'll follow you
th_th: เอาล่ะ มาย่องออกไปจากนรกนี่เถอะ ข้าจะตามเจ้าไป

source: Now we sneak out. You lead the way
th_th: เอาล่ะเราย่องไปจากนี่กัน เจ้านำเลย

source: Now we start sneaking. I'll be right behind you
th_th: เอาล่ะเรามาเริ่มย่องกันเลย ข้าจะอยู่ข้างหลังเจ้านะ

source: Now we sneak for our lives. I'll follow your lead
th_th: เอาล่ะมาย่องหนีเพื่อชีวิตเรากัน ข้าจะตามการนำของเจ้านะ

source: Now we sneak like crazy. I'll be right behind you, you lead
th_th: เอาล่ะ มาย่องหนีอย่างบ้าคลั่งกัน ข้าจะอยู่หลังเจ้าเจ้านำไปนะ

source: Now let's get out of here. Don't let them see you
th_th: เอาล่ะ มาหนีไปจากที่นี่กัน อย่าให้พวกมันเจอตัวล่ะ

source: Now let's go. Do NOT let them see you
th_th: เอาล่ะไปกัน แล้วห้ามให้พวกมันเจอตัวล่ะ

source: Now let's get going. Careful they don't spot you
th_th: ทีนี้ก็ไปกัน ระวังอย่าให้มันรู้ตัวนะ

source: Now let's get out of here. Careful they don't see you
th_th: เอาล่ะ ไปจากที่นี่กัน ระวังอย่าให้พวกมันเห็นตัว

source: Let's get a move on. Don't let them see you
th_th: เดินหน้าไปเลย อย่าให้มันเห็นเจ้าพอ

source: Now let's move out. I'll be right behind you, be careful
th_th: เอาล่ะ หนีไปกัน ข้าจะอยู่หลังเจ้า ระวังตัวด้วย

source: Now let's go. I'll be following behind you, careful
th_th: เอาล่ะไปกันเลย ข้าจะตามหลังเจ้า ระวังตัวด้วย

source: I'm getting the hell out here!
th_th: ข้าจะออกไปจากที่ระยำนี่!

source: Now, I'm outta here! Nice knowing you!
th_th: เอาล่ะ ข้าไปจากที่นี่แล้ว! ดีใจที่ได้รู้จักเจ้านะ!

source: I ain't hanging around! Nice to know you!
th_th: ข้าจะไม่อยู่แถวนี้แล้ว! ดีใจที่ได้รู้จักเจ้า!

source: I'm moving the hell out here!
th_th: ข้าจะไปจากที่ระยำนี่!

source: Now, I'm getting out of here!
th_th: ทีนี้ ข้าก็จะได้ออกไปจากที่นี่!

source: Keep 'em busy for me will ya? I'm runnin' the hell out of here!
th_th: เรียกตีนมันให้ข้าสินะ? ข้าจะหนีไปจากที่ระยำนี่!

source: I've gotta get out of here!
th_th: ข้าจะออกไปจากที่นี่!

source: No time to waste! I gotta get out of here!
th_th: ไม่มีเวลามาเสียแล้ว! ข้าจะไปจากที่นี่!

source: There's no time to lose! I'm runnin' for it!
th_th: ไม่มีเวลามาเสียแล้ว! ข้าจะวิ่งสุดฝีเท้า!

source: Now, run!
th_th: เอาล่ะ วิ่ง!

source: You... Why do you help me, Skeleton?
th_th: โดน Skeleton ช่วยเนี่ยนะ? อย่ามาตลกหน่อยเลย!

source: ... I won't be fooled by your tricks!... You won't darken me!
th_th: ...ข้าไม่หลงกลเจ้าหรอก!... เจ้าทำให้ข้ามัวหมองไม่ได้!

source: ... You can't fool me!... You won't /TAINT/ me, robot!
th_th: ...เจ้าหลอกข้าไม่ได้!... เจ้าจะทำให้ข้า/TAINT/ไม่ได้หรอก ไอ้หุ่นยนต์!
