Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Cannibal neighbour safe ninja pt 6 talk to.po
Languages: th_th

source: Coast looks clear, we made it. Good job
th_th: ชายฝั่งดูเรียบร้อยดี, เราทำมัน. เยี่ยมเลย

source: Mm... Well, nice knowing you.
th_th: อืม... เยี่ยม, ยินดีที่ได้รู้จัก.

source: Wait, ninja! Don't go...
th_th: รอก่อน, ninja! อย่าเพิ่งไป...

source: Hm? What is it?
th_th: หืม? มีอะไร?

source: We're a team, let's stick together
th_th: เราเป็นทีม, รวมกลุ่มกันไว้

source: ... You've grown on me
th_th: ... เจ้าจะเติบโตไปกับข้า

source: We'll get vengeance on them someday. Together.
th_th: เราจะล้างแค้นให้พวกเขาสักวัน. ด้วยกัน.

source: ... I'll join you
th_th: ...ข้าจะร่วมมือกับเจ้า

source: I could use your skills. How about it?
th_th: ข้าสามารถใช้ความสามารถของเจ้าได้. คิดว่าไง?

source: And what will you have me do with my 'skills'?
th_th: แล้วเจ้าต้องการให้ข้าทำอะไรกับ "ความสามารถ" ของข้า?

source: Join my army, we'll take over the world!
th_th: เข้าร่วมกองทัพของข้า, เราจะครองโลก!

source: I fight for retribution, for justice...
th_th: ข้าต่อสู้เพื่อแก้แค้น, เพื่อความยุติธรรม...

source: So, no. But good luck.
th_th: ดังนั้น, ไม่. แต่ก็โชคดีนะ.

source: We'll fight together, for good. For freedom
th_th: เราจะต่อสู้ร่วมกัน, เพื่อประโยชน์. เพื่ออิสระภาพ

source: We'll hunt those damn cannibals down
th_th: เราจะตามล่าพวกเวรนั้น พวกมนุษย์กินคน

source: Protect me, fight for me
th_th: ปกป้องข้า, สู้เพื่อข้า

source: You can just hire a merc for that
th_th: เจ้าจ้างพวกนักฆ่าไม่ดีกว่าหรอ

source: ... Where are you going?
th_th: ...เจ้ากำลังจะไปไหน?

source: To get reinforcements. I said I'd get my revenge, and I will...
th_th: ไปเสริมกำลัง. ข้าพูดว่าข้าจะแก้แค้น, และข้าจะ

source: No need for reinforcements. Join with me instead
th_th: ไม่จำเป็นต้องเสริมกำลัง เข้าร่วมกับข้าแทน

source: Kill them slowly. For me
th_th: ฆ่าพวกมันอย่างช้าๆ เพื่อข้า.

source: Good luck with that
th_th: ขอให้โชคดี

source: Let it go. It's just their nature, that's all
th_th: ปล่อยมันไป. ทั้งหมดนั่นมันเป็นเพียงธรรมชาติของพวกเขา

source: Innocent people are dying, I don't care if it's their nature.
th_th: คนบริสุทธิ์กำลังจะตาย ข้าไม่สนใจว่ามันเป็นธรรมชาติของพวกเขาหรือเปล่า

source: Their 'nature' nearly got me killed.
th_th: ธรรมชาติ' ของพวกเขาเกือบทำให้ข้าถูกฆ่าตาย

source: I'm not one for chit-chat
th_th: ข้าไม่ใช่พวกชอบพูดหรอกนะ

source: Well, thanks for your help anyway
th_th: เยี่ยม, ขอบคุณสำหรับความช่วยเหลือของเจ้า

source: Sorry, comrade. Places to be...
th_th: ขอโทษที, สหาย. มีที่ที่ต้องไป...

source: Thanks for your help, ninja
th_th: ขอบคุณสำหรับความช่วยเหลือของเจ้า, นินจา

source: Shit! How can you be so calm?
th_th: เหี้ยเอ้ย! เจ้าใจเย็นอยู่ได้ยังไงว้ะ?

source: Panicking never helped anyone... Well, nice knowing you anyway, but I've got to run.
th_th: การตื่นตระหนกไม่เคยช่วยอะไร... เยี่ยม, ยินดีที่ได้รู้จักเจ้า, แต่ข้าต้องวิ่งต่อ.

source: It was easy
th_th: มันง่ายมาก

source: I couldn't have done it without you
th_th: ข้าคงทำไม่สำเร็จถ้าไม่มีเจ้า
