Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Cannibal plains biome entry.po
Languages: th_th

source: Wai-- Did you see that? Up ahead, I'm sure I saw something...
th_th: ดะ--เดี๋ยว เจ้าเห็นนั่นไหม ข้างหน้านั่น ข้ามั่นใจว่าข้าเห็นบางอย่าง ...

source: It's just the wind. Relax, stay off the hashish a while, eh?
th_th: มันก็แค่ลมหน่ะ. ใจเย็น, เจ้าน่าจะอยู่ให้ห่างๆกัญชาสักพักนะ, ห้ะ?

source: It's not that. This is the cannibal plains, you're being hunted.
th_th: มันไม่ใช่อย่างนั้น. ที่นี่คือถิ่นของพวกกินคน, เจ้ากำลังจะถูกล่า.

source: It wasn't always like this. We don't know why the northwesterners suddenly developed a taste for humanoid meat...
th_th: มันไม่ได้เป็นแบบนี้เสมอไป เราไม่รู้ว่าทำไม ชาวตะวันตกเฉียงเหนือ

source: ... Guess that's lucky for you, eh, tinhead? The one place in the land where you're NOT the prey.
th_th: ... คิดว่าเป็นโชคดีสำหรับเจ้าใช่มั้ย หัวกระป๋อง? สถานที่นี้เป็นที่แห่งเดียวในดินแดนนี้ที่เจ้าไม่ใช่เหยื่อ.

source: Just make sure you rescue us if we get caught and sentenced to the chopping block.
th_th: แค่ให้แน่ใจว่าเจ้าจะช่วยข้าหากข้าถูกจับได้ และคอข้าห้อยอยู่บนเขียงของพวกมัน.

source: Anybody else get the distinct feeling they're being watched?
th_th: มีใครอีกบ้างที่รู้สึกว่าพวกเขากำลังถูกจับตามองอยู่?

source: Must be the forbidden lands, where it's said that the locals run naked and worship Narko. I feel it too, the air is heavy here.
th_th: มันเป็นดินแดนต้องห้าม ที่มีการกล่าวว่าชาวบ้านวิ่งเปลือยกายและบูชา Narko ฉันรู้สึกเหมือนกัน อากาศที่นี่มันก็หนัก

source: Naked, eh? Well, I shall have to study these locals further! You know, for uh... research purposes...
th_th: เปลือยเหรอ? ดี, ฉันจะต้องศึกษาชาวบ้านเหล่านี้ต่อไป! คุณรู้ไหมว่าเอ่อ ... วัตถุประสงค์ในการวิจัย ...

source: Naked, eh? Well, I shall have to study these locals further! You know, for uh... medical research purposes...
th_th: เปลือยเหรอ? ดี, ฉันจะต้องศึกษาชาวบ้านเหล่านี้ต่อไป! คุณรู้ไหมว่า เอ่อ ... วัตถุประสงค์การวิจัยทางการแพทย์ ...

source: Yep. That's because this is the cannibal plains.
th_th: อ๋อ นั่นเป็นเพราะที่นี่คือถิ่นของมนุษย์กินคน

source: The good news is that the place is littered with ancient tech. Just gotta survive the naked cannibals first.
th_th: ข่าวดีก็คือสถานที่นี้เกลื่อนไปด้วยเทคโนโลยีโบราณ. แค่ต้องเอาตัวรอด

source: That's because you ARE being watched. This is the cannibal plains and we're the prey.
th_th: นั่นเป็นเพราะคุณกำลังถูกจับตามองอยู่. ที่นี่คือถิ่นของมนุษย์กินคนและเราเป็นเหยื่อ

source: As individuals they're weak, but as a horde they're formidable. Stay on your toes.
th_th: ถ้ามากันไม่เยอะพวกมันอ่อนแอ, แต่ถ้ามาเป็นฝูง พวกมันน่ากลัว. ระวังนิ้วเท้าของคุณด้วย

source: Then keep your eyes peeled and be ready to run or fight.
th_th: เปิดตาของคุณไว้ และพร้อมที่จะหนี หรือสู้.

source: ... Savages with sticks. Nothing we can't handle.
th_th: ... พวกป่าเถื่อนพร้อมกับไม้. ไม่มีอะไรที่เราไม่สามารถจัดการได้

source: Hold up, CANNIBAL plains?!
th_th: เดี๊ยวก่อน, ถิ่นของมนุษย์กินคน?!

source: Great, out of one cooking pot and into another. Literally...
th_th: ดี, ออกจากหม้อหุงข้าวใบหนึ่งไปอีกใบหนึ่ง. จริงหรอ...

source: Cannibals?!... Such evil savages should be destroyed before they kill more innocents...
th_th: มนุษย์กินคน?! ... คนชั่วร้ายเหล่านี้ควรถูกทำลายก่อนที่พวกเขาจะฆ่าผู้บริสุทธิ์มากขึ้น ...

source: Be a hero all you want. But I'll be hightailing it outta there while the savages are feeding on your carcass...
th_th: เป็นฮีโร่ในแบบที่คุณต้องการ แต่ฉันจะเป็นสิ่งที่สูงกว่านั้นที่นั่น ในขณะที่คนป่าเถื่อนกำลังกินซากศพของคุณ ...

source: Most likely because you ARE. This is the cannibal plains and you're the prey here.
th_th: ทั้งหมดเป็นเพราะคุณ นี่คือถิ่นของมนุษย์กินคนและคุณเป็นเหยื่อของที่นี่

source: There's nothing around, quit being paranoid. Maybe lay off the hashish a while, eh?
th_th: ไม่มีอะไรรอบ ๆ, เลิกหวาดระแวง. บางทีควรหยุดกัญชาซักหน่อยมั้ย?

source: Not paranoia. I know when I'm being watched...
th_th: เลิกหวาดระแวง. ฉันรู้ว่ากำลังถูกจับตามองอยู่...

source: Stay on your toes...
th_th: ระวังนิ้วเท้าของคุณไว้...

source: We're reaching unchartered territory now... Anyone else get the feeling we're being watched?
th_th: เรามาถึงดินแดนนอกกฏหมายแล้วตอนนี้ ... ฉันรู้สึกว่าใครบางคนกำลังจับตามองเราอยู่?

source: ... Vigilance. We're being watched.
th_th: ... ระวังตัวไว้. เรากำลังถูกจับตามองอยู่.

source: That's because this is the cannibal plains. You're being hunted.
th_th: นั่นเป็นเพราะนี่คือถิ่นของมนุษย์กินคน คุณกำลังถูกตามล่า.

source: Cannibals. This is their territory now... and we're the prey.
th_th: มนุษย์กินคน. นี่คือดินแดนของพวกเขา และตอนนี้ ... และเราคือเหยื่อ.

source: ... Buffoon.
th_th: ... ตลก

source: The Shek is right. This is the heart of the cannibal plains now and we're the prey...
th_th: The Shek ถูก. นี่ใจกลางถิ่นของมนุษย์กินคน และตอนนี้เราคือเหยื่อ ...
