Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/cannibal hunter talk to.po
Languages: th_th

source: Want somethin'?
th_th: ต้องการอะไร?

source: Looking for a cannibal hunter?
th_th: กำลังมองหานักล่ามนุษย์กินคนอยู่หรอ?

source: My friend's been captured by cannibals!
th_th: เพื่อนของข้าถูกจับ โดยพวกมนุษย์กินคน!

source: Alright, should be able to help.. if they're still alive. 3000 Cats per day.
th_th: เอาหล่ะ,น่าจะยังพอช่วยได้.. ถ้าพวกเขายังมีชีวิตอยู่. 3000 Cats ต่อวัน.

source: 1 day
th_th: 1 วัน

source: Okay, /YOURNAME/. Let's get your friend out of there.
th_th: เอาหล่ะ, /YOURNAME/. ไปช่วยเพื่อนข้าออกจากที่นั้นกัน.

source: Here's hoping we reach your friend before meal time...
th_th: หวังว่าเราจะช่วยเพื่อนของเจ้าได้ก่อน ที่พวกมันจะหิวก็แล้วกัน...

source: Let's hope your friend can hang on a while longer...
th_th: ภาวนาให้เพื่อนเจ้ายังอึดอยู่ได้อีกนานนะ...

source: We'll get 'em outta there, /YOURNAME/. And if we don't, we'll at least kill the /INSULT/s that stuck 'em in a pot.
th_th: เราจะพาพวกเขาออกมาให้เอง /YOURNAME/ ต่อให้ทำไม่ได้เราก็จะฆ่าพวก/INSULT/ให้ติดหม้อพวกมันไปเลย

source: Lead the way.
th_th: นำทางไปเลย.

source: Take us to their camp.
th_th: พาเราไปที่ค่าย ของพวกมัน.

source: Take us to your friend.
th_th: พาเราไปหาเพื่อนของเจ้า.

source: 2 days
th_th: 2 วัน

source: Condolences, /OUTLANDER/. High risk work demands a high price tag...
th_th: เสียใจด้วย, /OUTLANDER/. งานที่มีความเสี่ยงสูง ก็ต้องจ่ายราคาสูงเช่นกัน...

source: Good luck to you.
th_th: ขอให้เจ้าโชคดี.

source: On second thought, nevermind.
th_th: มาคิดดูอีกที, ไม่ดีกว่า.

source: You hunt cannibals?
th_th: เจ้าล่าพวกมนุษย์กินคนหรอ?

source: Yeah. Got a cannibal problem that needs taking care of?
th_th: ใช่แล้ว. มีปัญหากับพวกมนุษย์กินคน ที่ต้องจัดการหรอ?

source: I do, my outpost is under attack.
th_th: ใช่, ด่านหน้าของข้าถูกโจมตี.

source: Alright. Standard rate is 3000 Cats for 2 days. Good to go ahead?
th_th: เอาละ. อัตรามาตรฐานคือ 3000 Cats สำหรับ 2วัน. เพื่อจะเข้าร่วม?

source: 4 days
th_th: 4 วัน

source: 6 days
th_th: 6 วัน

source: 8 days
th_th: 8 วัน

source: I want revenge.
th_th: ข้าต้องการแก้แค้น.

source: Don't we all.
th_th: ใครล่ะไม่อยาก

source: I can help you. The cost is 3000 Cats per day.
th_th: ข้าช่วยเจ้าได้. จ่ายมา 3000 Cats ต่อวัน.

source: Too bad. High risk work demands a high price tag...
th_th: เลวร้ายเกินไป. ง่านนี้เสี่ยงมาก ก็ต้องจ่ายมากเช่นกัน...

source: Don't go getting killed in the cannibal plains.
th_th: อย่าไปถูกฆ่าในถิ่นของพวกมนุษย์กินคนเลย.

source: Nope. Just curious.
th_th: ปล่าว. แค่อยากรู้อยากเห็น.

source: You look like shit.
th_th: เจ้าดูแย่นะ.

source: You look like you've seen better days.
th_th: ดูเหมือนเจ้าเคยดูดีกว่านี้เยอะ

source: Again?
th_th: อีกแล้วหรอ?

source: What is it this time?
th_th: คราวนี้อะไรอีกหล่ะ?
