Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/cannibal heals prisoner (finish).po
Languages: th_th

source: Heel bedder?
th_th: ดี แล้วยัง?

source: Dhere. I cure woun'.
th_th: นี่ ข้ารักแผลนะ

source: Prey no need hurt.
th_th: เหยื่อไม่จำเป็นเจ็บปวด

source: Is okay now.
th_th: ตอนนี้ไม่เป็นไรแล้ว

source: Any more hurt?
th_th: เจ็บอีกแล้วเหรอ?

source: Prey hurt. Bedder meat.
th_th: เหยื่อเจ็บ เนื้อยิ่งดี

source: Hurt make meat /CANNIBALTASTY/.
th_th: ความเจ็บทำให้เนื้อ/CANNIBALTASTY/

source: We /CANNIBALCOOK/ you soon.
th_th: เราจะ/CANNIBALCOOK/ในไม่ช้าแหละ

source: I like eat /CANNIBALBODYPART/ hirst.
th_th: ข้าอยากกิน/CANNIBALBODYPART/ก่อน

source: Prey not die. Yet.
th_th: เหยื่ออย่าตาย ตอนนี้ยัง

source: Can' wait.
th_th: รอไม่ไหวแล้ว

source: Mmm.
th_th: หืมม

source: I ungry now.
th_th: ข้าหิวแล้ว

source: Smell good.
th_th: กลิ่นที่ดี

source: Prey muss stay alibe.
th_th: เหยื่อต้องมีชีวิตรอด

source: Not long now.
th_th: ในไม่ช้านี่แหละ

source: You ungry?
th_th: เจ้าหิวรึ?

source: Ungry?
th_th: หิว?

source: Wan' eat?
th_th: อยากกิน?

source: Yes! Food!
th_th: ใช่! อาหาร!

source: I'll eat anything!
th_th: เราจะกินทุกอย่าง!

source: Yes! Please!
th_th: ใช่! ได้โปรด!

source: Dhen...
th_th: งั้น...

source: Try your /CANNIBALBODYPART/.
th_th: ลอง/CANNIBALBODYPART/เจ้าดู
