Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/captured - meets stranger.po
Languages: th_th

source: ...got to get out of here...
th_th: ... ต้องออกไปจากที่นี่ ...

source: ...should've been more careful...
th_th: ... ต้องระวังให้มากกว่านี้ ...

source: ...last time I trust anyone...
th_th: ...ครั้งสุดท้ายที่ข้าเชื่อใจใครบางคน...

source: ...want to go home...
th_th: ...อยากกลับบ้าน...

source: Hey. Get me out?
th_th: เฮ้ พาข้าออกไป?

source: Come on. Open the lock!
th_th: เร็วเข้า. เปิดกุญแจสิ่ว้ะ!

source: Help me out of here.
th_th: ช่วยข้าออกไปจากที่นี่.

source: You there. Little help?
th_th: เจ้าตรงนั้นหน่ะ. ช่วยอะไรหน่อยได้ไหม?

source: Give me a hand, would you?
th_th: เจ้าจะ, ช่วยข้าได้ไหม?

source: Hey now, don't just leave me!
th_th: เฮ้เดี๋ยวสิ่, อย่าปล่อยข้าไว้คนเดียว!

source: Laugh it up.
th_th: หัวเราะ ขึ้นมา.

source: Go die in a fire.
th_th: ไปตายห่าในกองไฟซะ.

source: Go eat shit.
th_th: ไปแดกขี้ซะ.

source: Bugger off!
th_th: ไอ้เหี้ยเอ้ย!

source: Watch it.
th_th: ดูมัน.
