Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/captured - meets imprisoner.po
Languages: th_th

source: Let me out, asshole!
th_th: ให้ข้าออกไป ไอ้โง่!

source: You'll pay. Oh, you'll fucking pay.
th_th: แกจะต้องชดใช้. โอ้วใช่, แกต้องได้ชดใช้แน่ๆ ไอพวกเวร.

source: The fuck did I ever do to you?
th_th: ข้าเคยไปทำเหี้ยอะไรให้เจ้าว้ะ?

source: I am not an animal!
th_th: ข้าไม่ใช่สัตว์นะ!

source: Bastards, the lot of you.
th_th: พวกเจ้าทุกตัวมันไอ้สารเลว!

source: When they find me, you'll regret all of this.
th_th: เมื่อพวกเขาหาข้าเจอ แกจะต้องเสียใจสำหรับทั้งหมดนี้.

source: Free me, and maybe I won't kill you.
th_th: ปล่อยข้าเป็นอิสระซะและข้าอาจจะไม่ฆ่าเจ้า

source: Let me go. I'm begging you.
th_th: ปล่อยข้าไปเถอะ ข้าขอร้อง

source: I'll do anything. Just unlock the door.
th_th: ข้าจะทำทุกอย่าง เพียงแค่ปลดล็อกประตู

source: Let me find you someone else. Please!
th_th: ข้าจะหาคนอื่นมาให้เจ้าแทน ได้โปรดเถอะ

source: Release me and I swear I won't say a word.
th_th: ปล่อยข้าและข้าสัญญาว่าจะไม่พูดอะไรเลย

source: This is it, isn't it.
th_th: นี่มัน, ไม่ใช่

source: I'm at your mercy.
th_th: ข้าขึ้นอยู่กับความเมตราของเจ้าแล้ว

source: I have nothing.
th_th: ไม่มีเลย.

source: Will you at least make it quick?
th_th: อย่างน้อยๆ เจ้าจะทำให้มันจบแบบทันทีได้ไหม?
