Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/captured - finds fellow prisoner.po
Languages: th_th

source: Quick. Look for a way out.
th_th: เร็วเข้า มองหาทางออกจากที่นี่

source: Are you waiting for invitations? Do something!
th_th: แกจะต้องรอคำเชิญรึไง? ทำอะไรสักอย่างสิ!

source: We could die here.
th_th: พวกเราได้ตายที่นี่แน่

source: Don't just stand around!
th_th: อย่ายืนอยู่เฉย ๆ สิ!

source: Break the cage. Free the birds.
th_th: ทำลายกรง. แล้วโบยบินออกไปสู่อิสรภาพ.

source: Hurry!
th_th: เร็วเข้า!

source: Hmm... over there...?
th_th: หืมม... ตรงนั้นมัน...?

source: Fucking cannibals. Bloody, fucking cannibals.
th_th: เวรเอ้ย พวกกินคน. พวกกระหายเลือด, ไปตายซะ มนุษย์กินคน.

source: Know their favorite appetiser? Skin rolls.
th_th: รู้จักอาหารจานโปรดของพวกมันไหม? หนังม้วนอะ

source: Not the fingers. Please, not the fingers.
th_th: ไม่เอานิ้ว ได้โปรดไม่เอานิ้ว

source: Hide your ears, hide your ears, hide your ears.
th_th: ซ่อนหูของเจ้า ซ่อนหูของเจ้าซะ ซ่อนหูของเจ้าเร็ว

source: Don't let them see your eyes.
th_th: อย่าให้พวกเขาเห็นตาของเจ้า

source: I will not scream.
th_th: ข้าจะไม่ร้อง

source: If they take me first, don't watch.
th_th: ถ้าพวกมันเอาข้าไปก่อน จงอย่ามอง
