Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Catun scrapmaster.po
Languages: th_th

source: Such crass jokes... Now, are you here to buy or are you just here to threaten me with that rusty stick you call a sword?
th_th: ช่างเป็นมุขที่ตลกเสียจริง... เอาล่ะทีนี้ เจ้ามาที่นี่เพื่อซื้อของหรือว่าเจ้ามาที่นี่เพื่อจะขู่ข้าด้วยแท่งเหล็กขึ้นสนิมนั่นที่เจ้าเรียกว่าดาบล่ะ?

source: I'm here to buy. Let's trade.
th_th: ข้ามาที่นี่เพื่อซื้อ มาซื้อขายกันเถอะ

source: Show me your gear.
th_th: แสดงอุปกรณ์ของเจ้าให้ข้าดูหน่อยสิ

source: First, tell me about the Catun Scrapmasters.
th_th: อย่างแรกเลย บอกข้าเกี่ยวกับ The Catun Scrapmasters

source: And what makes your weapons so special?
th_th: แล้วอะไรมันทำให้อาวุธของเจ้ามันดูพิเศษล่ะ

source: Highest quality in the land? Bold statement.
th_th: คุณภาพดีที่สุดในดินแดนแห่งนี้? ช่างกล้าพูด

source: The Catun Scrapmasters are renowned throughout the world for our swords, our reputation speaks for itself. If you don't know that, well, either you've had your head buried in the sand or you've taken too many knocks to the head with that rusty 'sword' of yours.
th_th: The Catun Scrapmasters โด่งดังไปทุกหนทุกแห่งทั่วทุกมุมโลกในเรื่องของดาบของพวกเรา ความมีชื่อเสียงของเรา ขอพูดให้เข้าใจนะ ถ้าเจ้าไม่รู้น่ะ เอาล่ะ ทั้งนี้ทั้งนั้นหัวของเจ้าอาจจะโดนฝังอยู่ในทราย หรือไม่เจ้าก็อาจจะโดนกระทืบตายไปพร้อมกับ 'ดาบ' สนิมเขรอะเล่มนั้นของเจ้า

source: Now, I'm a busy /MEMAN/, so are you buying or not?
th_th: ตอนนี้ข้ายุ่งอยู่ /MEMAN/ เจ้าจะซื้อหรือไม่?

source: Eh, I've seen better quality blades.
th_th: เอ่อ ข้าว่าข้าเคยเห็นอาวุธที่มีคุณภาพดีกว่านี้นะ

source: I'll be the judge of that. Show me your gear.
th_th: ข้าจะประเมินคุณค่ามันเอง แสดงอาวุธของเจ้าให้ข้าดูหน่อย

source: Forget it, I'm leaving.
th_th: ลืมมันซะ ข้าไปล่ะ

source: A fine blade will make you a fine warrior, I sell only the best quality weapons in my shop.
th_th: ดาบที่ดีจะทำให้เจ้าเป็นนักรบที่เก่งกาจ ข้านั้นขายเฉพาะอาวุธที่มีคุณภาพสูงที่สุดในร้านข้า

source: A fine /MAN/ needs a fine blade! Not.. whatever that 'thing' is you have in your sheath... But if you're looking for quality, you've found it. What do you need, customer?
th_th: /MANดี ต้องการดาบที่ดี! ไม่... ว่าจะยังไง 'สิ่งนั้น' ที่อยู่ในฝักดาบ... แต่ถ้าเจ้ากำลังมองหาของที่มีคุณภาพ เจ้าเจอแล้วล่ะ เจ้าต้องการอะไร ลูกค้า?

source: [She squints at you]... So, you're here to buy? For the best quality weapons look no further.
th_th: [เธอแหล่มองมาที่คุณ]... เอ่อ เจ้ามาที่นี่เพื่อซื้อหรือเปล่า? เพื่ออาวุธที่มีคุณภาพดีที่สุด ไม่คิดจะดูเพิ่มเติมหน่อยหรอ

source: Skeleton Smiths? Don't trust 'em. But you can always trust the Catun Scrapmasters, I only sell the best in my shop.
th_th: พวกช่างตีเหล็ก Skeletons งั้นหรอ? เจ้าอย่าไปเชื่อใจพวกมันนะ แต่เจ้าสามารถเชื่อใจ the Catun Scrapmasters ได้ตลอด ข้านั้นขายเฉพาะของที่ดีที่สุดในร้านข้า

source: Settle for a cheap sword, prepare to fight like a cheap warrior.
th_th: ยังคงใช้ดาบที่ไร้ราคา และก็พร้อมที่จะสู้ไปอย่างนักรบที่ไร้ราคา
