Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Chung healing other start.po
Languages: th_th

source: This, I can fix. Leave it to me.
th_th: ข้าซ่อมไอ้นี่ได้ ให้เป็นหน้าที่ข้าเอง

source: Leave it to the expert.
th_th: ปล่อยให้มือโปรจัดการเถอะ

source: Relax, you're in good hands. Good, handsome hands.
th_th: ผ่อนคลายหน่อย เจ้าอยู่กับมือฉมังแล้ว มือฉมังที่รูปหล่อมากด้วย

source: This ain't nothin' I haven't seen before. Leave it to me.
th_th: นี่มันเรื่องจิ๊บจ๊อย ที่ข้าเคยเห็นมาแล้ว ให้เป็นหน้าที่ข้าเอง

source: This ain't nothin'. Promise you I won't even leave a scar.
th_th: นี่มันเรื่องจิ๊บจ๊อย ข้าสัญญาว่าจะไม่เหลือแผลเป็นด้วยซ้ำ

source: Leave it to the doc.
th_th: ปล่อยให้เป็นหน้าที่หมอเอง

source: Cram it in and sew it up. You'll live. Now, don't squirm.
th_th: เอามัดยัดเข้าไปแล้วก็เย็บปิดเสีย เจ้ารอดตายแน่นอน เอาล่ะ อย่าดิ้นไปมาล่ะ

source: Alright, let's take a look. Nothin' the doc can't handle.
th_th: เอาล่ะ ไหนมาดูซิ ไม่มีอะไรที่หมอทำไม่ได้

source: Time to get busy.
th_th: ถึงเวลาที่จะมือวุ่นแล้ว

source: Now it's my time to shine...
th_th: นี่คือเวลาที่ข้าจะโดดเด่นเป็นประกาย...

source: Call that an injury? I've seen worse in my time...
th_th: เจ้าเรียกนั่นว่าอาการบาดเจ็บเรอะ? ข้าเคยเห็นที่แย่กว่านี้มาแล้วล่ะ...

source: I've seen burst eyeballs, mangled limbs, exploding testicles, you name it.
th_th: ข้าเคยเห็นลูกตาหลุดออกจากเบ้า แขนขาที่ขาดรุ่งริ่ง ลูกอัณฑะที่ระเบิดกระจุย เกือบทุกอย่างที่เจ้านึกถึงได้

source: Is this supposed to make me feel better?
th_th: นี่คือจะพูดให้ข้ารู้สึกดีขึ้นเหรอ?

source: Nope. Dammit, I'm a doctor not a whore. Now hold still so I can fix ya...
th_th: เปล่า บ้าเอ๊ย ข้าเป็นหมอ ไม่ใช่นางโลม ตอนนี้ก็อยู่เฉย ๆ ให้ข้ารักษาได้แล้ว...

source: Ah, you'll live, eh. I've fixed a lot worse...
th_th: อา เจ้ารอดตายแหง ข้าเคยรักษาอันที่แย่กว่านี้มาแล้ว...

source: Had to pull an arrow out a bandit's skull once. He lived. Ain't too bright these days though...
th_th: เคยต้องดึงเอาลูกธนูออกจากกระโหลกของโจรคนหนึ่ง เขารอดนะ แต่ก็กลายเป็นพวกไม่เต็มไปซะแล้ว...

source: A scratch, that's all. I've seen worse...
th_th: แค่รอยถลอกเอง ข้าเห็นอันที่แย่กว่านี้มาแล้ว...

source: This one guy, he 'accidentally' sat on his sword. Yeesh, now that was a mess, I'll tell ya...
th_th: ไอ้หนุ่มคนหนึ่ง 'เผลอ' นั่งลงไปบนดาบของตัวเอง โอ้ ขอบอกเลยว่านั่นแหละเรียกว่าเละเทะของแท้...

source: Count yourself lucky it ain't worse...
th_th: เชื่อเถอะว่าเจ้าโชคดีแล้วที่มันไม่แย่ไปกว่านี้...

source: I mean, I've seen half-chewed merchants still alive an' kickin'....
th_th: ข้าหมายถึง ข้าเคยเห็นพ่อค้าที่ถูกขย้ำไปครึ่งตัว แต่ยังมีชีวิตอยู่และดิ้นไปมานะ

source: Better to die than survive havin' your face eaten off by gutters, I tell ya.
th_th: ให้ตายไปเสียยังดีกว่าที่หน้าครึ่งหนึ่งของเจ้าถูกพวกขยะนั่นแทะนา ขอบอก

source: Learn to dodge better, eh. Next time you might not be so lucky.
th_th: เรียนรู้ที่จะหลบให้เก่งขึ้นแล้วกัน คราวต่อไปเจ้าอาจไม่โชคดีแบบนี้อีก

source: Keep losin' fights and there ain't gonna be much left of you to patch up.
th_th: ถ้ายังพ่ายแพ้ในการต่อสู้ไปเรื่อย ๆ เจ้าคงไม่เหลืออะไรให้ข้ารักษาให้แล้วล่ะ

source: Let's see... Missed all the vital organs. 'Spose that's somethin', eh.
th_th: ไหนดูซิ...ไมีมีแผลไหนโดนอวัยวะสำคัญ นี่มันใช้ได้เลยนะเนี่ย ว่ามั้ย

source: Well, the important bits are still intact, and that's all that matters.
th_th: อืม อวัยวะสำคัญยังทำงานได้ แค่นั้นแหละที่ต้องกังวล

source: Look after yourself better, eh? You only get one body. Can't botch it with first aid forever.
th_th: ดูแลตัวเองให้ดีกว่านี้หน่อยนะ เจ้ามีร่างกายแค่หนึ่งเดียว จะอาศัยการปฐมพยาบาลดูแลไปตลอดไม่ได้หรอก

source: No more fighting. Rest up and keep the wound clean, got it?
th_th: ห้ามต่อสู้อีก พักผ่อนและรักษาความสะอาดของแผล เข้าใจใช่ไหม?
