Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Civ marked for death.po
Languages: th_th

source: N- no! They're coming for me!
th_th: มะ- ไม่! พวกมันกำลังมาเพื่อเอาตัวข้า!

source: Th- they're coming... No.. No... Noooo!
th_th: พะ..พวกมันกำลังมา... ไม่.. ไม่.. ม่ายยย!

source: Th- they're coming for me! They're coming for me!!!
th_th: พะ- พวกมันกำลังมาเพื่อเอาตัวข้า! พวกมันกำลังมาเพื่อจะจับข้า!!!

source: Help! Somebody help!
th_th: ช่วยด้วย! ใครก็ได้ ช่วยที!

source: No! I have to get out of here! Nooooo!
th_th: ไม่! ข้าต้องออกจากที่นี่! ม่ายยยยย!

source: /FUCK/! Help! Help!!!
th_th: /FUCK/! ช่วยด้วย! ช่วยด้วย!!!

source: God save me!
th_th: พระเจ้าช่วยข้าด้วย!

source: NO! NOOOO!
th_th: ไม่! ม่ายยย!

source: NO! Go away! Leave me alone!
th_th: ไม่! ไปซะ! ปล่อยข้าไว้คนเดียว!

source: No! Stay away from me! Noooo!
th_th: ไม่! อยู่ให้ห่างจากข้า! ม่ายยยย!

source: Help me! Help!!!!
th_th: ช่วยข้าด้วย! ช่วยด้วย!!!
