Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Civ healing start bad relations.po
Languages: th_th

source: Hey! What are you doing?! Get off of me!
th_th: เฮ้ย! เจ้าจะทำอะไรหน่ะ?! ปล่อยข้านะ!

source: No! Get off me! What are you doing?
th_th: ไม่! ปล่อยข้า! เจ้าจะทำอะไรหน่ะ?

source: No! Back off! Don't touch me!
th_th: ไม่! ถอยไป! อย่ามาแตะตัวข้า!

source: Wh... why are you helping me?
th_th: ทะ... ทำไมเจ้าถึงช่วยข้า?

source: You're... you're helping me?
th_th: เจ้า.. เจ้าช่วยข้าเหรอ

source: Why are you healing me?
th_th: ทำไมเจ้าถึงรักษาข้า?

source: What're you doing? We're enemies.
th_th: เจ้าจะทำอะไรนะ? เราเป็นศัตรูกัน.

source: This a trick?
th_th: นี่เป็นกลลวงหรือเปล่า?

source: The hell are you playing at?
th_th: นี่เจ้าเล่นห่าเหวอะไรฟะ?

source: Wh-what do you want from me!?
th_th: จะ- เจ้า ต้องการอะไรจากข้า!?

source: Wh-what are you doing to me!?
th_th: เจ้าจะทำอะไรกับข้า!?

source: Go away! Leave me alone!
th_th: ไปให้พ้น! ปล่อยให้ข้าอยู่คนเดียว!
