Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/civ assassination failed.po
Languages: th_th

source: Ahhh! Help!
th_th: อ๊าาา า! ช่วยด้วย!

source: Aghhh! I'm under attack!!
th_th: อ๊ากกก! ข้ากำลังถูกโจมตี!

source: Ughh! Help! Help!
th_th: อั๊กก! ช่วยด้วย! ช่วยด้วย!

source: Agh?!
th_th: อ้า?!

source: Oww!
th_th: โอ๊ยย!

source: I need help over here!
th_th: ข้าต้องการความช่วยเหลือที่นี่!

source: Somebody help!
th_th: ใครก็ได้ช่วยที!

source: A little help over here!
th_th: ช่วยทางนี้หน่อยเซ่!

source: I'll fight to the death!
th_th: ข้าจะต่อสู้จนตาย!

source: What do you want?!
th_th: แกต้องการอะไร?!

source: What do you want from me?!
th_th: แกต้องการอะไรจากข้า?!

source: Who sent you?!
th_th: ใครส่งแกมา?!
