Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Civilian witness lockpick.po
Languages: th_th

source: You sneak! What are you doing?!
th_th: เจ้าหลบ ๆ ซ่อน ๆ! กำลังทำอะไรอยู่หน่ะ?!

source: You sneak! What are you up to?!
th_th: เจ้าทำลับ ๆ ล่อ ๆ! เจ้าทำอะไรอยู่?!

source: What are you up to, you sneak?!
th_th: เจ้าทำอะไรของเจ้า, มัวแต่หลบ ๆ ซ่อน ๆ?!

source: What are you trying to do, sneak?!
th_th: เจ้าคิดจะทำอะไร, มาทำลับ ๆ ล่อ ๆ แถวนี้?!

source: Sneak! Stop that!
th_th: มาเดินลับ ๆ ล่อ ๆ! หยุดสักทีสิวะ!

source: Sneak! Get away from there!
th_th: มาทำลับ ๆ ล่อ ๆ! ออกไปเลยไป๊!

source: Stop, thief!
th_th: หยุดนะ หัวขโมย!

source: Hey! Back away!
th_th: เฮ้! กลับไป!

source: Help, guards!
th_th: ช่วยด้วย ยาม!

source: Guards! Over here!
th_th: ยาม! ตรงนี้!

source: Guards! Criminal!
th_th: ยาม! คนร้าย!

source: Guards! Guards!
th_th: ยาม! ยาม!

source: Somebody!
th_th: ใครก็ได้!

source: Over here, thief!
th_th: ตรงนี้, ขโมย!

source: I need help! Get /HIM/, somebody!
th_th: ข้าต้องการคนช่วย! จับ/HIM/, ใครก็ได้!

source: Help, somebody, help!
th_th: ช่วยด้วย ใครก็ได้ ช่วยที!

source: Hah?!
th_th: ฮะ?

source: Y- you?!
th_th: จะ..เจ้า?!

source: Th- this-?!
th_th: นะ-นี่?

source: Wh- wha?!
th_th: อะ-อะไรวะ?

source: Get out! Thief!
th_th: ขโมย! ออกไป!

source: Go away! Thief!
th_th: ไปให้พ้น! ไอ้ขโมย!

source: Get out of here! Go!
th_th: ออกไปจากที่นี่! ไป!

source: Get out of my shop! Thief!
th_th: ขโมย! ออกไปจากร้านของข้าซะ!

source: You're not welcome in my shop! Get out! Thief!
th_th: เจ้าไม่ได้รับการต้อนรับเข้ามาในร้านของข้า! ออกไป! ไอ้ขโมย!

source: Thieves aren't welcome! Get out!
th_th: ไม่ต้อนรับขโมย! ออกไป!

source: Leave! Get out!
th_th: ไปให้พ้น! ออกไป!

source: You sneak! Get out! Get out of here!
th_th: ทำเป็นหลบ ๆ ซ่อน ๆ! มึงออกไปซะ! ออกไปจากที่นี่!

source: Thief! Remove /HIM/!
th_th: ขโมย! เอามันออกไป!
