Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/crumblejon.po
Languages: th_th

source: [A shrivelled, sinewy old man glares at you with one eye. He looks expectant in a weary sort of way, like he's already bored with you, but he's got to talk to you anyway.]
th_th: [ชายชราผู้อ่อนแอและผอมแห้งจ้องมองด้วยตาข้างเดียว เขาดูคาดหวังอย่างเหนื่อยล้าเหมือนว่าเขาเบื่อเจ้าอยู่แล้ว แต่เขาก็จะคุยกับเจ้าอยู่ดี]

source: Why do they call you "Crumblejon"?
th_th: ทำไมพวกเขาเรียกเจ้าว่า "Crumblejon"?

source: Because of my crumbling bones. That's enough questions now.
th_th: เพราะกระดูกข้าหัก. นั่นเป็นคำถามที่มากพอแล้วตอนนี้.

source: Can you actually lift that weapon?
th_th: เจ้าสามารถยกอาวุธนั้นได้จริงหรือ?

source: No. Go away.
th_th: ไม่, ไปให้พ้น.

source: That's a really long beard.
th_th: เครานั่นยาวจริงๆ

source: It's the source of my power. Stop pestering me!
th_th: มันเป็นที่มาของความแข็งแกร่งของข้า เลิกยุ่งกับข้าสักที!

source: Why are you so old?
th_th: ทำไมเจ้าแก่จัง?

source: LEAVE ME ALONE!
th_th: ปล่อยข้าอยู่คนเดียวเถอะ

source: Join my squad!
th_th: เข้าร่วมทีมกับข้า!

source: FINE! I'LL JOIN YOUR STUPID SQUAD!
th_th: ดี! ข้าก็อยากเข้าร่วมทีมงี่เง่าของเจ้า!

source: Yay!
th_th: เย่!

source: Nah, I changed my mind.
th_th: ไม่อ่ะ, เปลี่ยนใจแล้ว

source: FUCK YOU!
th_th: อ้าวควย!

source: BLOODY FUCK YOU!
th_th: ควยตายแน่

source: I'M GONNA FREAKING KILL YOU!
th_th: ฆ่าจะฆ่าเจ้า
