Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Dark skeleton shoo.po
Languages: th_th

source: Wrong building, /RACENAME/.
th_th: เข้ามาผิดตึกแล้ว /RACENAME/

source: You're not supposed to be here, /RACENAME/.
th_th: เจ้าไม่ควรมาอยู่ที่นี่ /RACENAME/

source: You don't belong here, /RACENAME/.
th_th: เจ้าไม่ควรมาที่นี่ /RACENAME/

source: You're not welcome here, /RACENAME/.
th_th: ที่นี่ไม่ต้อนรับเจ้า /RACENAME/

source: You have one chance to leave, or I destroy you.
th_th: เจ้ามีโอกาสเดียวเลือกมาว่าจะจากไป หรือจะให้ข้าทำลายเจ้า

source: Leave. Or I destroy you.
th_th: จากไป หรือให้ข้าทำลายเจ้า

source: You trespass, you die.
th_th: เจ้าบุกรุก เจ้าตาย

source: I'll warn you once. Leave.
th_th: ข้าเตือนเจ้าครั้งหนึ่งแล้วนะ ไปซะ

source: One chance. Leave.
th_th: โอกาสเดียว ไปซะ

source: Leave or die. One chance.
th_th: จะไปหรือตาย โอกาสเดียว

source: Die, trespasser.
th_th: ตายซะ ผู้บุกรุก

source: Dispose.
th_th: กำจัด
