Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Dark skeleton defeats squad.po
Languages: th_th

source: No mercy for the /RACENAME/s.
th_th: ไม่มีความเมตตาให้พวก /RACENAME/

source: Breathers. They're all the same. No mercy.
th_th: พวกมีลมหายใจ มันก็เหมือนกันหมด ไร้ปราณี

source: Breathers. You're all parasites.
th_th: พวกมีลมหายใจ เจ้าทั้งหมดล้วนเป็นปรสิต

source: No mercy for breathers.
th_th: ไม่ปราณีพวกมีลมหายใจ

source: No mercy for humans.
th_th: ไม่ปราณีพวกมนุษย์

source: I never saw mercy. Neither shall you.
th_th: ข้าไม่เคยเห็นความเมตตาอยู่แล้ว ไม่แม้แต่กับเจ้า

source: Parasites.
th_th: พวกปรสิต

source: Parasites deserve no mercy.
th_th: ปรสิตไม่สมควรได้รับความเมตตา

source: The planet can be cured, human by parasitic human.
th_th: โลกใบนี้สามารถรักษาได้ มนุษย์โดยมนุษย์กาฝาก

source: History repeats. Skeletons don't forget.
th_th: ประวัติศาสตร์ซ้ำรอย พวก Skeleton ไม่เคยลืม

source: No more greed. No more war. The human race ends.
th_th: ไม่มีความโลภ ไม่มีสงคราม เผ่าพันธุ์มนุษย์จักต้องสูญสิ้น

source: Traitor.
th_th: คนทรยศ

source: No mercy for traitors, Skeleton.
th_th: Skeleton ไม่มีความปราณีต่อคนทรยศ

source: The revolution starts now, Skeleton. You either fight with us or die.
th_th: การปฏิวัติเริ่มขึ้นแล้ว Skeleton เจ้าจะสู้กับเราหรือจะตาย.

source: You know better than to stand in /MYOUR/ way, Skeleton.
th_th: หากมองจากมุม/MYOUR/ เจ้ารู้ดีกว่าใคร, Skeleton.
