Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Deadcat spots ex slave.po
Languages: th_th

source: Ex-slave, huh?
th_th: อดีตทาสหรอ?

source: Ex-slave, eh?
th_th: อดีตทาสใช่ไหม?

source: ... You're an ex-slave, aren't you?
th_th: ...เจ้าเป็นอดีตทาสใช่มั้ย?

source: The ninjas'll be able to help you out, you should go find 'em
th_th: พวกนินจาจะสามารถช่วยเจ้าได้, เจ้าควรไปหาพวกเค้า

source: Tough break. You should lay low for a while.
th_th: แย่หน่อยนะ. เจ้าควรนอนพักซักครู่.

source: You should hide somewhere safe
th_th: เจ้าควรไปหาที่ซ่อนที่ไหนสักที่ ที่ปลอดภัย

source: You should lay low for a while
th_th: เจ้าควรนอนพักสักครู่

source: You should seek out the Ninjas
th_th: เจ้าควรออกไปตามหาพวกนินจานะ

source: Careful. The slavers have eyes everywhere.
th_th: จงระมัดระวัง. พวกนายทาสนั้นมีตาอยู่ทุกที่นะ

source: Only takes one blabbermouth to get you caught all over again
th_th: แค่มีคนปากโป้งแค่คนเดียวจะทำให้เจ้าถูกจับอีกครั้ง

source: Careful. No town is completely safe from the eyes of the slavers
th_th: จงระมัดระวัง. ไม่มีที่ไหนเลยที่ปลอดภัยจริง ๆ จากสายตาพวกนายทาส
