Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Defeated enemy.po
Languages: th_th

source: Don't cross me again
th_th: อย่าได้มาลองดีกับข้าอีก

source: I don't want to see your face again
th_th: ข้าไม่อยากจะเห็นหน้าเจ้าอีก

source: What a pain in the ass...
th_th: โคตรน่าลำคาญเลยว่ะ

source: What a pain in the neck...
th_th: น่ารำคาญเสียจริง

source: You got what you deserved, /RAT/
th_th: แกได้รับสิ่งที่สมควรโดน, /RAT/

source: You disgust me. I hope you die slowly
th_th: แกทำให้ข้าขยะแขยง. ข้าหวังให้แกค่อย ๆ ตายอย่างช้า ๆ

source: Die slowly and painfully
th_th: ตายอย่างช้า ๆ และ ทรมาน

source: Damn animals
th_th: พวกสัตว์เดรัจฉาน

source: Disgusting animals
th_th: สัตว์น่าขยะแขยง

source: /FUCKING/ ferals
th_th: เดรัจฉาน/FUCKING/

source: Feral creatures
th_th: สิ่งมีชีวิตเดรัจฉาน

source: Your kind disgusts me
th_th: พวกเผ่าพันธ์ที่น่าขยะแขยง

source: /FUCKING/ /BANDIT/s
th_th: /FUCKING/ /BANDIT/

source: Stay out of my damn way
th_th: ออกไปให้พ้นทางของข้า

source: Don't bother me again, lowlife
th_th: อย่ามากวนใจข้าอีก, ไอชั้นตํ่า

source: Don't get in my way again, lowlifes
th_th: อย่าได้สะเออะเข้ามาขวางทางข้าอีก, ไอชั้นตํ่า

source: /QUICKLAUGH/, that was fun!
th_th: /QUICKLAUGH/ โคตรสนุก!

source: /QUICKLAUGH/, again again!
th_th: /QUICKLAUGH/ เอาอีกๆ!

source: /ARG/ my /FUCKING/ leg
th_th: /ARG/ ไอ้ขา/FUCKING/ของข้า

source: Rrgh! My /FUCKING/ leg's broken
th_th: อ๊าก! ขา/FUCKING/ของข้าหัก

source: Dammit, my head!
th_th: เวรเอ้ย หัวข้า!
