Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Defeated squad okranite.po
Languages: th_th

source: The light will always prevail
th_th: แสงสว่างจะมีชัยเหนือกว่าเสมอ

source: Good will always prevail over evil
th_th: ความดีจะมีชัยเหนือความชั่วเสมอ

source: Darkness will never survive Okran's Will!
th_th: ความมืดจะไม่มีทางอยู่รอด Okran's จะ!

source: Burn in the flame of the abyss...
th_th: เผาด้วยเปลวไฟแห่งอเวจี...

source: The will of Okran is done
th_th: ความตั้งใจของ Okran สำเร็จแล้ว

source: The blood of the /TERRORIST/ has been spilled
th_th: เลือดของพวก /TERRORIST/ จักต้องหลั่งไหล

source: The light of Okran has prevailed
th_th: แส่งของ Okran จักได้รับชัยชนะ

source: The darkness has been purged
th_th: ความมืดได้ถูกกำจัดไปแล้ว

source: Light be sated!
th_th: แสงกำลังส่องสว่าง

source: Father, be with us...
th_th: บิดา, อยู่ข้างเรา

source: Fire be sated!
th_th: ไฟกำลังลุกโชน

source: The ground will run red...
th_th: ผืนดินจักเป็นสีแดง...

source: The blood of evil has been spilled...
th_th: เลือดแห่งความชั่วร้าย จักต้องหลั่งไหล...

source: You cannot win the fight against Okran
th_th: เจ้าไม่สามารถชนะไฟแห่ง Okran ได้!

source: May the light of Okran shine on us!
th_th: ขอให้แสงแห่ง Okran ส่องประกายแด่ข้า!
