Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Defeated squad desparate.po
Languages: th_th

source: Check /EM/ for food...
th_th: ไปค้นอาหารของ/EM/...

source: Food! Check for food!
th_th: อาหาร!ค้นหาอาหาร!

source: Please... please have food...
th_th: ได้โปรด... ได้โปรด ขออาหาร

source: I don't care about your life... I just want to survive...
th_th: ข้าไม่สนชีวิตของเจ้าหรอก... ข้าแค่ต้องการจะอยู่รอด...

source: I don't care if you die here... I just want to live...
th_th: ข้าไม่สนหรอกถ้าเจ้าจะตายที่นี่... ข้าแค่อยากมีชีวิตอยู่ต่อ...

source: I need to eat, I need your food...
th_th: ข้าหิว, ข้าต้องการอาหารของเจ้า...

source: I haven't eaten in three days...
th_th: ข้าไม่ได้กินอาหาร มาสามวันแล้ว...

source: Everyday is torture when you can't afford to eat...
th_th: ทุกๆวันช่างทรมาน เมื่อไม่มีอะไรจะให้กิน...

source: Those that have the luxury of never going hungry. I despise them...
th_th: พวกคนรวยไม่เคยต้องทนหิว. ข้าเกียจพวกมัน...

source: All I care about is your food...
th_th: ทั้งหมดที่ข้าสนใจคืออาหารของเจ้า...

source: Only thing I care about is your food...
th_th: สิ่งเดียวที่ข้าสนใจคืออาหารของเจ้า...

source: Meat! Today /IWE/ eat!
th_th: เนื้อ! ในวันนี้ /IWE/ กิน!

source: So hungry... but today... /IWE/ eat steak...
th_th: หิวมาก... แต่วันนี้... /IWE/ ได้กินเนื้อสเต็ก

source: Meat... so much meat...
th_th: เนื้อ... เนื้อ มากมาย...

source: Mm... meat...
th_th: นะ... เนื้อ...

source: I... I can taste the meat in my mouth already...
th_th: ขะ... ข้าสามารถลิ้มรสเนื้อ ในปากของข้าได้ตอนนี้...
