Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/defeats squad.po
Languages: th_th

source: Learn how to fight, /FLATSKIN/
th_th: เรียนรู้วิธีการต่อสู้, /FLATSKIN/

source: Natural selection at its finest
th_th: การเลือกสรรจากธรรมชาติ ที่ยอดเยี่ยมที่สุด

source: Honor to Kral!
th_th: เพื่อเป็นเกียรติแด่ Kral!

source: Glory!
th_th: ความรุ่งโรจน์!

source: Victory!
th_th: ชัยชนะ!

source: Triumph!
th_th: การมีชัย!

source: You fought with honor...
th_th: เจ้าต่อสู้ด้วยเกียรติยศ...

source: Die with honor...
th_th: ตายเพื่อเกียรติยศ!

source: Fight to the end, always...
th_th: ต่อสู้จนตัวตาย, เสมอ...

source: A glorious death...
th_th: ความตายอันรุ่งโรจน์...

source: An honorable death...
th_th: การตายอย่างมีเกียรติ...

source: It was an admirable effort...
th_th: มันเป็นความพยายามที่น่ายกย่อง...

source: Glory to the Shek!
th_th: ชัยชนะแด่ Shek!

source: They all fall down...
th_th: พวกเขาทั้งหมดล้มลง ...

source: And down they fall...
th_th: พวกเขาล้มลง

source: Fall to the /DIRT/...
th_th: ล้มลงกับ/DIRT/...

source: The stench of death...
th_th: กลิ่นสาบแห่งความตาย ...

source: Don't mess with a Shek.
th_th: อย่ามาแหยมกับ Shek.

source: Weakling.
th_th: อ่อนแอ.

source: Never cross a Shek.
th_th: ไม่มีใครโค่น Shek ได้.

source: Stay down in the dirt.
th_th: ร่วงไปกับพื้น

source: Let the blood flow.
th_th: ให้เลือดไหลตาย
