Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/defeat squad.po
Languages: th_th

source: Bosh!
th_th: เหลวไหล!

source: Took those bastards DOWN!
th_th: ฆ่าไอ้พวกนั้น!

source: Oh yeah!
th_th: โอ้ว ช่ายย!!

source: HA HAHAHAHA!
th_th: ฮ่า ฮ่าฮ่าฮ่าฮ่า!

source: Bleed to death in the dirt
th_th: เลือดไหลตายลงบนดินซะ

source: Ha! Did you see that?
th_th: ฮ่า! เจ้าเห็นนั่นมั๊ย?

source: We are the best!
th_th: พวกเราเหนือกว่า!

source: Nce one!
th_th: เจ๋งเป้ง!

source: You the man!
th_th: มึงนี่มันคนจริงว่ะ!

source: Fuckin' A!
th_th: ไอ้เย็ดแม่!

source: HA!
th_th: ฮ่่า!

source: HAHA!
th_th: ฮ่าฮ่า!

source: We are the greatest!
th_th: พวกเรายิ่งใหญ่ที่สุด!

source: Baddest in the desert!
th_th: และเลวที่สุดในทะเลทราย!

source: Yeah! High five me!
th_th: ใช่! แท็กมือ กับข้า!

source: High five!
th_th: แท็กมือ!

source: Oh yeaahhh!
th_th: โอ้ ช่าายยย!

source: Ooooh yeaahhh!
th_th: โอ้ววว ช่าายยยย!

source: Anyone?
th_th: ใครก็ได้?

source: Guys?....
th_th: พวกเรา?...

source: Don't fuck with /MEUS/
th_th: อย่ามาซ่ากับ /MEUS/

source: Don't EVER mess with /MEUS/
th_th: อย่าซะเออะมาซ่ากับ /MEUS/

source: Rot in the dirt, /BASTARD/
th_th: เน่าตายไปซะ/BASTARD/

source: Die SLOWLY, /BASTARD/
th_th: ตายอย่างช้าๆ, /BASTARD/

source: Stay down, /BASTARD/
th_th: ร่วงไปซะ, /BASTARD/

source: Rot in the dirt, bastards
th_th: เน่าตายไปซะ ไอ้ระยำ

source: Stay down, assholes
th_th: ร่วงไปซะ, ไอ้ระยำ

source: Die SLOWLY, /BASTARD/s
th_th: ตายอย่างช้าๆ, /BASTARD/s

source: Respect your superiors, /BASTARD/s
th_th: เคารพเหล่าเจ้าขุนสิ ไอ้พวก/BASTARD/
