Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/doctor shop.po
Languages: th_th

source: What's wrong?
th_th: มีอะไร?

source: Do you have any medical supplies for sale?
th_th: เจ้ามีหยูกยาใดขายไหม?

source: Can you change my appearance?
th_th: เจ้าเปลี่ยนรูปลักษณ์ของข้าได้ไหม

source: Seriously? I guess so, 500 cats.
th_th: เอาจริงรึ? ข้าว่าซัก 500 cats

source: It will cost you 500 cats.
th_th: ราคา 500 cats นะ

source: I'm pretty busy. You'll have to pay 500 cats
th_th: ข้ายุ่งมาก เจ้าต้องจ่ายข้า 500 cats

source: Sure, why not? 500 cats.
th_th: เอาสิ จะปฏิเสธไปทำไม? 500 cats

source: Ok
th_th: โอเค

source: Actually nevermind
th_th: ที่จริงแล้ว ไม่มีอะไรหรอก

source: Hmm, I better not
th_th: ฮืมม ข้าว่าไม่ดีกว่า
