Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Shek defeated somebody.po
Languages: th_th

source: You put up a brave fight
th_th: เจ้าต่อสู้อย่างกล้าหาญ

source: You fought well
th_th: เจ้าต่อสู้ได้ดี

source: You fought with honor
th_th: เจ้าต่อสู้ด้วยเกียรติ

source: You put up a good battle
th_th: เจ้าต่อสู้ได้ดี

source: It was a good effort
th_th: มันเป็นความพยายามที่ดี

source: Stay down
th_th: หมอบไว้

source: Let death consume you
th_th: ปล่อยให้ความตายกัดกินเจ้า

source: Let death take hold of you
th_th: ปล่อยให้ความตายครอบงำเจ้า

source: Let death devour you
th_th: ปล่อยให้ความตายกลืนกินเจ้า

source: You will never match up to a Shek
th_th: เจ้าไม่คู่ควรกับเผ่า Shek

source: You will never win against a Shek
th_th: เจ้าจะไม่มีวันชนะเผ่า Shek

source: You can't win against a Shek
th_th: เจ้าไม่สามารถเอาชนะเผ่าShekได้

source: The greatest of honors, to fall in battle against a Shek
th_th: เกียรติยศที่ยิ่งใหญ่ที่สุดได้มาจากการต่อสู้กับเผ่า Shek

source: Nice try, /FLATSKIN/
th_th: พยายามได้ดี, /FLATSKIN/

source: Good effort, /FLATSKIN/
th_th: เป็นความพยายามที่ดี, /FLATSKIN/

source: Good, but not good enough, /FLATSKIN/
th_th: ดี, แต่ยังไม่ดีพอ, /FLATSKIN/

source: Disappointing...
th_th: น่าผิดหวัง...

source: Down!
th_th: ร่วงไปสิ!
