Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/Shinobi Thief Boss Membership.po
Languages: th_th

source: So, you want in on the Shinobi, eh? The guards try to lay the crackdown but they ain't fooling nobody, they're nothing. Nothing a few Cats can't handle.
th_th: โห เจ้าอยากเข้าร่วม Shinobi รึ? พวกยามพยายามที่จะทำการปราบปราม แต่พวกมันหลอกใครไม่ได้ พวกมันไม่ได้อะไรเลย ไม่สามารถจัดการได้แม้แต่ Cats เพียงเล็กน้อย.

source: I want to join the Shinobi Thieves.
th_th: ข้าต้องการเข้าร่วมกองโจร Shinobi.

source: You can join. For a fee.
th_th: เจ้าเข้าได้. ถ้ามีค่าธรรมเนียม

source: ... That's it? I don't have to complete a test or prove myself or something?
th_th: ...แค่นั้น? ข้าไม่จำเป็นต้องทำการทดสอบ หรือพิสูจน์ตัวเองอะไรเลยหรือ?

source: Do I look like I've got time for handing out busy-work? No, this is a business wer're running, not a social club. Just a one-time membership fee, 10,000 Cats.
th_th: ข้าดูเหมือนคนมีเวลาจัดการงานที่ทำให้ยุ่งและไม่มีประโยชน์รึ? ไม่เลย นี่เรากำลังทำธุรกิจไม่ใช่เปิดชมรมจัดสัมนา ธรรมเนียมเข้าเป็นสมาชิกจ่ายครั้งเดียวจบ 10,000 Cats.

source: So, what will it be? Do you want to join the guild?
th_th: แล้วจะเอายังไง? อยากจะเข้าร่วมกิลด์กับเราไหม?

source: 10,000 Cats seems a little steep.
th_th: 10,000 Cats นี้ดูจะแพงไปหน่อยนะ.

source: You wanna use our facilities, you gotta pay for them. If you can't afford it, you're obviously not a very good thief.
th_th: ถ้าเจ้าอยากจะใช้สิ่งอำนวยความสะดวกของพวกเรา เจ้าก็ต้องจ่ายเพื่อมัน ถ้าเจ้าจ่ายไม่ไหว ก็มั่นใจได้ว่าเจ้าไม่ใช่โจรที่เจ๋งอะไร.

source: What do I get in return for all that money?
th_th: จ่ายไปแล้วจะได้อะไรตอบแทน?

source: You get yourself allies. We have hideouts like this one in lots of major towns. We watch eachother's backs, Shinobi Thieves stick together.
th_th: เจ้าได้พันธมิตรของเจ้า เรามีสถานที่กบดานเช่นนี้ในเมืองใหญ่ๆ หลายแห่ง เราระวังหลังให้กันและกัน กลุ่มโจร Shinobi จะคอยอยู่เคียงข้างกัน.

source: It's a safe haven for you to rest and recover. We have specialist training equipment to use, you can sell your stolen items to our fence and he also sells some hard to find specialist equipment at a huge discount.
th_th: มันเป็นสวรรค์อันปลอดภัยสำหรับเจ้า ในการพักผ่อนและฟื้นฟู เรามีอุปกรณ์ฝึกฝนแบบพิเศษให้เจ้าได้ใช้ เจ้าสามารถขายของที่ขโมยมากับคนรับของโจรของเราได้ และเขายังขายอุปกรณ์ที่หายากแถมลดราคากันแบบสุดๆ อีก.

source: Okay, sign me up [c.10,000]
th_th: โอเค ข้าเซ็นสัญญาเข้า [c.10,000]

source: *You clasp hands* Welcome /BROTHER/, to the Shinobi Thieves.
th_th: *เจ้าปรบมือ* ยินดีต้อนรับ/BROTHER/ สู่กองโจร Shinobi

source: Maybe some other time.
th_th: ไว้คราวหลังละกัน.

source: I'm not interested right now, sorry.
th_th: ข้ายังไม่สนใจตอนนี้ โทษที.
