Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/trader mourn.po
Languages: th_th

source: How can I help?
th_th: มีอะไรให้ข้าช่วยไหม?

source: Looking to buy?
th_th: สนใจซื้อของเหรอ?

source: Here to buy?
th_th: จะมาซื้อของเหรอ?

source: Show me your goods.
th_th: ขอดูสินค้าของเจ้าทีสิ.

source: Let's trade.
th_th: มาซื้อขายกัน.

source: Let's do business.
th_th: มาทำธุรกิจกัน.

source: Old mining town. Weren't so great with their slave control, turns out. But it makes a good shelter for travellers, so long as the wildlife keeps at bay...
th_th: เมืองขุดเหมืองเก่า พวกเขาควบคุมทาสได้ไม่ดีนัก แต่มันก็เป็นที่พักพิงที่ดีสำหรับนักเดินทาง ตราบใดที่สัตว์ป่ายังอยู่ในอ่าวน่ะนะ...

source: ... Speaking of which, stay outta the HQ. And leave the gates locked... Call it a pest control measure that no one wants to deal with, eh.
th_th: ...จะว่าไป อยู่ให้ห่างจาก HQ ไว้และให้ประตูมันล็อคต่อไปงั้น...เรียกมันว่ามาตรการควบคุมสัตว์ร้ายที่ไม่มีใครอยากไปจัดการนะ.

source: Pest control? Maybe I can help...
th_th: มาตรการควบคุมสัตว์ร้าย? บางทีข้าช่วยได้นะ...

source: With all due respect, no, don't touch those gates. I don't care if you think you're the next Tinfist, we lost two men trapping that thing in there. Only takes one wannabe hero to let it back out again...
th_th: ด้วยความเคารพ, อย่า, ห้ามไปแตะต้องประตูบานนั้น ข้าไม่สนหรอกนะถ้าเจ้าจะคิดว่าตนจะเป็น Tinfist คนถัดไปน่ะ เราเสียคนไปสองคนที่ติดอยู่ในนั้น เพียงแค่พวกกระสันอยากเป็นฮีโร่คนเดียวจะทำให้มันหลุดมาอีกครั้งน่ะสิ...

source: No, sorry.
th_th: ไม่ล่ะ ขอบคุณ.

source: Get lost, thief!
th_th: ออกไปให้พ้น ไอ้โจร!

source: I never forget a thief. Go shop somewhere else!
th_th: ข้าไม่เคยลืมหน้าโจร ไปร้านอื่นเลยไป!

source: Go trade somewhere else, thief!
th_th: ไปซื้อขายที่อื่นไป ไอ้โจร!

source: Thieve's ain't welcome!
th_th: เราไม่ต้อนรับโจร!

source: ... Well, you sure proved me wrong didn't you, /OUTLANDER/?
th_th: ...แหม เจ้ามั่นใจว่าจะพิสูจน์ว่าข้าคิดผิดงั้นสิ/OUTLANDER/?

source: Have a drink on me, eh?... Now, how about a round of applause for the Great White Killer?
th_th: ดื่มกับข้าซักหน่อยเป็นไง ฮืม?... เอาล่ะ เอาเป็นว่าปรบมือสรรเสริญนักฆ่า Great White ซักรอบล่ะเป็นไง?

source: Cheers.
th_th: ชนแก้ว.
