Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/trader holy nation.po
Languages: th_th

source: /HOLYGREET/. What can I do for you today?
th_th: /HOLYGREET/ วันนี้มีอะไรให้ข้าช่วย?

source: /HOLYGREET/. How can I help you, are you looking to trade?
th_th: /HOLYGREET/ มีอะไรให้ข้าช่วย กำลังจะซื้อของใช่ไหม?

source: /HOLYGREET/, how are you today? Looking for anything in particular?
th_th: /HOLYGREET/ เป็นไงบ้างวันนี้? หาอะไรเป็นพิเศษรึเปล่า?

source: /HOLYGREET/, I hope that you are well. What can I do for you today? Looking to trade?
th_th: /HOLYGREET/ หวังว่าเจ้าจะสบายดีนะ มีอะไรข้าช่วยวันนี้? คิดจะซื้อขายรึ?

source: /HOLYGREET/. Looking to buy?
th_th: /HOLYGREET/ กำลังจะซื้อของรึ?

source: /HOLYGREET/. Today is a fine day for trading! What can I get you?
th_th: /HOLYGREET/ วันนี้ช่างเป็นวันดีเหมาะแก่การค้าขายจริงๆ! มีอะไรให้ช่วย?

source: Can I see your wares?
th_th: ขอดูสินค้าเจ้าหน่อยได้ไหม?

source: Show me your wares
th_th: โชว์สินค้าเจ้าที

source: Let's see what you've got
th_th: ดูหน่อยสิว่ามีอะไร

source: Let's get down to business
th_th: มาทำธุรกิจกัน

source: Show me what you've got
th_th: โชว์ให้ข้าดูสิว่าเจ้ามีอะไรบ้าง.

source: No, nothing. Sorry to bother you.
th_th: เปล่า ไม่มีอะไร โทษทีที่รบกวน.

source: No, nothing. Nevermind.
th_th: เปล่า ไม่มีอะไร ไม่ต้องใส่ใจ

source: Looking to trade?
th_th: สนใจซื้อขายรึเปล่า?

source: Here for business?
th_th: มาทำธุรกิจรึ?

source: See anything you like?
th_th: เจอของที่ชอบไหม?

source: I don't do business with thieves!
th_th: ข้าไม่ทำธุรกิจกับโจร!

source: You think I'd trade with a thief?! Leave.
th_th: คิดว่าข้าจะซื้อของจากโจรหรอ? ออกไป.

source: Take your custom elsewhere, sinner.
th_th: ไปร้านอื่นซะไป เจ้าคนบาป.

source: I don't deal with thieves!
th_th: ข้าไม่ยุ่งกับโจร!

source: Sticky fingered sinner! Take your business elsewhere.
th_th: เจ้าหัวขโมยคนบาป! ไปทำธุรกิจที่อื่นไป.

source: Not in my shop, thief. Take your Cats elsewhere.
th_th: ไม่ใช่กับร้านข้าเจ้าโจร ไปทำธุรกิจที่อื่นไป

source: Really, you want to trade? After you stole from me!? Get out of my shop!
th_th: เอาจริงรึ เจ้าอยากจะค้าขาย? หลังจากที่ขโมยของข้าไป!? ไสหัวออกไปจากร้านข้าเลย!

source: You stole from me. I won't forget that. Leave.
th_th: เจ้าขโมยของข้า ข้าไม่ลืมแน่ ไสหัวไป.

source: Leave, thief. I got no wares for you.
th_th: ออกไปซะ, โจร. ข้าไม่ต้องการสินค้าของเจ้า.

source: I've got nothing to trade with you, thief.
th_th: ข้าไม่มีอะไรจะค้าขายกับเจ้า, ไอ้โจร

source: Looks like I'm all sold out. Leave, thief.
th_th: ดูเหมือนว่าข้าจะขายของหมดแล้ว. ออกไป, ไอ้โจร.

source: I won't waste my breath on a lowly thief. Leave my shop.
th_th: ข้าจะไม่เสียเวลากับโจรชั้นต่ำ. ออกไปจากร้านของข้า.

source: Okran bless you. How may I serve you holy /BROTHER/?
th_th: ขอองค์ Okran ประทานพรให้ท่าน มีอะไรให้เรารับใช้/BROTHER/ศักดิ์สิทธิ์?

source: How may I serve you, holy /BROTHER/?
th_th: มีอะไรให้เรารับใช้/BROTHER/ศักดิ์สิทธิ์?

source: Whatever you need, holy /BROTHER/. I'm here to serve.
th_th: /BROTHER/ศักดิ์สิทธิ์ ไม่ว่าท่านต้องการสิ่งใด เรายินดีรับใช้.

source: ... Please leave
th_th: ...ได้โปรดออกไปซะ

source: ... I will not serve a thief
th_th: ...ข้าจะไม่รับใช้โจร

source: ... Please, leave me, thief
th_th: ...ได้โปรดไปซะ เจ้าโจร
