Repository: khaknet/Kenshi-Translation-MOD-TH
Catalog: locale/*/dialogue/translated/trade slaves.po
Languages: th_th

source: Greetings! Are you looking to trade?
th_th: สวัสดี! ต้องการซื้อขายหรือ?

source: I'm looking to buy some slaves
th_th: ข้าคิดจะซื้อทาสซักหน่อย

source: I'm here to buy
th_th: ข้ามาซื้อสินค้า

source: I'm looking to sell some slaves
th_th: ข้ามาขายทาสซักหน่อย

source: I'm here to sell
th_th: ข้ามาขายสินค้า

source: Good! But come back in a few minutes...
th_th: ดีเยี่ยม! แต่ไว้อีกสักเดี๋ยวค่อยกลับมานะ...

source: I'm just need to process this here slave first.
th_th: ข้าต้องจัดการทาสนี่ก่อน.

source: What are you trading?
th_th: เจ้าขายอะไร?

source: Slaves of course. This is the slave shop.
th_th: ก็ต้องเป็นทาสแน่อยู่แล้ว ก็นี่มันร้านค้าทาสนี่.

source: Oh, of course it is.
th_th: โอ้ แน่นอนใช่สินะ.

source: So? What do you want?
th_th: แล้ว? เจ้าต้องการอะไรล่ะ?

source: What do you want then?
th_th: เจ้าต้องการอะไรล่ะงั้น?

source: You disgust me, Slaver!
th_th: เจ้ามันน่ารังเกียจ พ่อค้าทาส!

source: Bloody loonies! /QUICKLAUGH/!
th_th: พวกบ้าเลือดเรอะ! /QUICKLAUGH/!

source: /QUICKLAUGH/! Get a load of this looney!
th_th: /QUICKLAUGH/! มองดูไอ้บ้านี่สิ!

source: /QUICKLAUGH/! Looney slave-huggers! How quaint!
th_th: /QUICKLAUGH/! ไอ้พวกรักทาสประหลาด! น่าเอ็นดูจัง!

source: Where do you think all the iron comes from that makes your pretty sword? Eh?
th_th: เจ้ารู้ไหมว่าเหล็กทั้งหลายแหล่ที่เอามาตีดาบเจ๋งๆ ของเจ้ามันมาจากไหนน่ะ? หา?

source: Who mines all the stone to make your building materials? Who farms your food?
th_th: รู้ไหมใครมันขุดหินมาสร้างวัสดุก่อสร้างให้เจ้าน่ะ? รู้ไหมใครเป็นคนทำฟาร์มหาอาหารมาให้เจ้าน่ะ?

source: Where do you think the clothes on your back came from, eh?
th_th: เจ้าคิดไหมว่าผ้าบนหลังของเจ้ามันมาจากไหนน่ะ? หา?

source: It's all from slave labour! But you don't care about any of that when you're shopping around for cheap gear do you? No, take it out on the poor slave traders!
th_th: ทั้งหมดนั่นก็มาจากแรงงานทาส! แต่เจ้าไม่ได้สนใจมันเลยตอนที่เดินซื้อหาแต่อุปกรณ์ราคาถูกใช่ไหมล่ะ? ไม่ เอาตัวมันออกไปจากร้านค้าทาสจนๆ นี่!

source: /FUCKING/ hypocrite!
th_th: /FUCKING/เสแสร้ง!

source: Watchya got there? A new slave? Give you 400 'cats for 'im.
th_th: หาอะไรรึ? ทาสใหม่เรอะ? จ่ายมา 400 Cats แล้วเอาไปเลย.

source: Deal.
th_th: ตกลงl.

source: Come to master
th_th: ไปหานายท่านซะ

source: This one's not for sale.
th_th: นั่นไม่ใช่ของขายนะ.
